[
    {
        "code": "ARCH 110",
        "description": "Introduction to the use of graphic media in architecture. Students will engage in exercises in drawing using various media, acquire digital skills, and develop fluency in diverse forms of architectural presentation.",
        "title": "Visual and Digital Media 1"
    },
    {
        "code": "ARCH 113",
        "description": "Introduction to computing techniques in architecture. Students will be instructed in the conceptual foundations for computer use in architecture, graphic applications for the computer, and skills for two-dimensional drawing, three-dimensional modelling and graphic techniques for visualization and portfolio development. Students will gain fluency in a range of software applications for the purposes of developing technical and visual proficiencies to be integrated into the design process.",
        "title": "Visual and Digital Media 2"
    },
    {
        "code": "ARCH 120",
        "description": "This course offers a broad introduction to the evolution of ideas, principles and vocabulary of architecture over time, establishing the concept that architecture conveys meaning through its own expressive language. It will familiarize students with the primary concepts of architecture; develop an awareness of the influences of architectural form; and introduce students to different modes of verbal and written communication, including the language of architectural criticism, analysis, and interpretation.",
        "title": "An Introduction to Architectural Ideas and Communications"
    },
    {
        "code": "ARCH 126",
        "description": "An introduction to environmental design practices leading to low carbon design. Topics of discussion include passive heating and cooling, solar geometry, climate and meteorological influences, microclimate, site design, daylighting, active systems, embodied energy, sustainable rating systems, sustainable design philosophies such as cradle to cradle, biomimicry, and design for disassembly. Energy-related issues will be addressed and energy-based software design programs will be introduced. Understanding the role of design in an energy efficient or passive solar building will be a central learning outcome.",
        "title": "Environmental Building Design"
    },
    {
        "code": "ARCH 142",
        "description": "This course will introduce cultural history and the ethical dimension of the role architects play. Localizing the realities of modernity as an enduring cultural force and a global economy on one hand, with global threats to the future of humankind on the other. This course will explore the commonality of human experience, the interdependence of humans, and the natural environment. By considering narratives, artefacts, and buildings, this course will present how architecture and other cultural creations intersect with issues of race, gender, and identity, within a range of spiritual, social, political, and environmental contexts. Through orientation, disorientation, and reorientation, this course introduces human constructs and environmental conditions from a variety of perspectives such as location, foundation, habituation, accommodation, exile, and displacement.",
        "title": "Introduction to Cultural History"
    },
    {
        "code": "ARCH 143",
        "description": "This course introduces buildings, cultural practices, and worldviews of nomadic and sedentary societies across a broad range of geographies and periods. Beginning with the earliest shrines and cities that appear in the Middle East, the Far East, and India, and exploring settlements in Africa, Asia, Europe, and the Americas up to the year 1000 CE. This course examines the origins of sacred and civic architectures in the landscapes and environments in which they emerge, moving across continents to recognize patterns of life, concepts of order and conduct, symbols, rituals, and myths embodied in our building practices and settlement patterns. Analysis in this course foregrounds the relationships to the lands that inform cultures, the formation and movement of societies, their temporary and permanent constructions, looking at the ecological and social bearings of cities as spaces of power, sanctuary, and exchange.",
        "title": "Settlements, Sanctuaries, and Cities"
    },
    {
        "code": "ARCH 172",
        "description": "A focus on the construction of small-scale buildings will introduce the fundamentals of building construction demonstrating relationships between contemporary design and material selections. Design development practices will reference; regulatory frameworks, building science, soils, foundations, light wood construction, engineered wood, masonry (brick, concrete block, load bearing, veneer systems), shallow foundations, residential codes, barrier free design.",
        "title": "Building Construction 1"
    },
    {
        "code": "ARCH 173",
        "description": "Focusing on the construction of medium-to large-scale buildings examines relationships between design development, and the building science, and construction practices of structural systems and enclosures. Case studies and projects will be used to investigate steel framing systems (traditional, long span, architectural exposed structural steel [AESS]); reinforced, precast, fibre reinforced and prestressed concrete construction; heavy timber construction (traditional, glulam, cross laminated timber [CLT]); deep foundations; building envelopes (curtain wall, window walls, glazing, insulation strategies, and roofing systems); fire protective design.",
        "title": "Building Construction 2"
    },
    {
        "code": "ARCH 192",
        "description": "Development of the means to appreciate the art and science of building; introduction to the study of theories of architecture; development of skills in graphic communication; introduction to a study of building elements; promotion of the application of theory in the practice of design.",
        "title": "Design Studio"
    },
    {
        "code": "ARCH 193",
        "description": "Further development of basic skills, and the application of theory and design in small scale architectural design projects. Introduction to issues of inhabitation, program, and context.",
        "title": "Design Studio"
    },
    {
        "code": "ARCH 212",
        "description": "This course will introduce students to the tools, work-flows, and culture surrounding computer-aided design/computer-aided manufacturing (CAD/CAM) and its creative applications within architecture. Students will learn how to work with CAD/CAM technologies such as laser cutters, three-dimensional (3D) printers, and computer numerical control (CNC) routers while expanding their knowledge of two- and three-dimensional CAD geometries that inform the digital fabrication process.",
        "title": "Digital Fabrication"
    },
    {
        "code": "ARCH 225",
        "description": "This course provides an historical overview of the ideas of nature and landscape in Western thought. \"Nature\", \"Ecology\", and \"Landscape\" are treated as cultural constructs, related to specific philosophical, technological, economic, political, and social issues. Many of these issues will be considered as the course of study traces the evolution and transformation of contemporary landscape.",
        "title": "Theory and Design of the Contemporary Landscape"
    },
    {
        "code": "ARCH 243",
        "description": "This course will engage students in a range of topics that include historical, practical, or theoretical investigations centering indigenous topics and epistemologies. This can include indigenous architectures, spatial and land practices locally or globally, Indigenous typologies and worldviews, traditional ecological knowledge, and practices of restoration. This course will also look at critical and decolonizing frameworks for research methods and creative practices in order to introduce other ways of knowing and engaging the world.",
        "title": "Indigenous Practices"
    },
    {
        "code": "ARCH 246",
        "description": "This course presents encounters across peoples, worldviews, belief systems, and empires, following the movement of ideas, practices, and objects to consider significant cultural transformations resulting from conflictual or peaceful interactions. From Indigenous civilizations and imperial dynasties, to sites of economic, political, and religious encounters such as the Silk Road or the Crusades. This course thematically presents creative works across all continents and includes proto-capitalist and proto-colonial phenomena. Representational, material, and spatial practices studied range from visual and oral discourses, drawing, mapping, printing, land markings, places of burials, worship, and teachings, as well as the organization of cities, landscapes, and territories, all studied as windows into ways of knowing, patterns of life and relationships to the land.",
        "title": "Cultural Encounters 600-1600"
    },
    {
        "code": "ARCH 248",
        "description": "This course critically examines the period from the 17th century to the first years of the 20th century, studying revolutions in science, agriculture, and industry, and considering the social, political, and economic changes engendered globally in their wake. Selected works from philosophy, literature, the arts, architecture, landscape, and city design reveal complex social and political upheavals. The increasing influence of technology, and the power struggles around access to and extraction of the globe's resources. Topics considered include the birth of industrial nations driven by Enlightenment reason, science and the emancipative promise of political liberty, as well as the fall of that early idealism with the realities of capitalism, colonialism, racism, and the destruction of the natural environment. Considering encounters between people, as well as between people and the earth, this course studies both the promises and shadows of the complex global society that emerges in this time.",
        "title": "Cultural Encounters 1600-1914"
    },
    {
        "code": "ARCH 260",
        "description": "Fundamental concepts of mechanics and structures, as related to architectural design, study of loading conditions, forces, moments, systems of forces, conditions of equilibrium for two- and three-dimensional structures, centre of gravity of loads and areas, bar forces in trusses, simple frame analysis, moment of inertia. Concepts of simple stress and strain; shear and bending moments in simple beams; shear and moment diagrams, qualitative deflected shapes, flexural and shearing stresses, deflection calculations; compression members; Euler's formula.",
        "title": "Principles of Structures"
    },
    {
        "code": "ARCH 276",
        "description": "Architectural case studies are used to examine conceptual development, structural design, building process, and the selection of structural timber systems. Topics such as flexural, compression and truss members, connections, and plywood construction are studied using calculations, design aids, rules of thumb, and the latest CSA design standards.",
        "title": "Timber: Design, Structure and Construction"
    },
    {
        "code": "ARCH 292",
        "description": "The exploration of design as a thinking process through the medium of small scale design projects. The development and analysis of architectural propositions concerning personal space within the context of a larger community.",
        "title": "Design Studio"
    },
    {
        "code": "ARCH 293",
        "description": "Design involving problems of human perception and dimension in more complex environments, and dealing with issues of public and private space. Development of skills in analysis and programming, and further exploration of questions of siting and context.",
        "title": "Design Studio"
    },
    {
        "code": "ARCH 327",
        "description": "An introduction to the structure and form of urban environments as understood through the urban architecture. The forces that determine the creation and development of urban places will be examined. Topics include the plan as a generative form, urban building types, urban morphology, and the shape of the public realm, infrastructure as both system and architectural object, nature and the park, and real estate and development controls. Of special interest will be analyses of the suburb, and urban master plans.",
        "title": "Architecture of the Urban Environment"
    },
    {
        "code": "ARCH 332",
        "description": "A design/build workshop which offers opportunities for hands-on experience in three-dimensional design. Advancements of technical and design skills provide the underpinnings for the projects. Students are encouraged to explore a variety of media and techniques such as woodworking and metalworking, allowing for both individual and small team investigations. A logbook will be kept to record creative intentions and the design process from conception to completion.",
        "title": "Design/Build Workshop"
    },
    {
        "code": "ARCH 342",
        "description": "This course examines the cultural, architectural, urban, and environmental history of those complex movements designated as \"modernism\". Through selected works, projects and texts, this course studies the changing social, industrial, aesthetic, and ecological ambitions of these movements, critically reviewing their development and examining forms of acceptance and resistance to the \"modern project\". Through the examination of selected Canadian and international artistic, cultural, architectural, and landscape works, this course questions the technological, political, and social ideologies that continue to inform our buildings and cities as well as our relation to the earth and environment. Using a thematic approach to address the complexity of modernization, modernism, and modernity, this course presents issues related to habitat, health, craft, economy, and labour; histories of displacement, global narratives, resistance movements, and processes of emancipation and decolonization.",
        "title": "Modernisms: Local and Global"
    },
    {
        "code": "ARCH 346",
        "description": "This course provides an opportunity for the student to independently engage in the respected tradition of the Architectural Competition. The competition entry and accompanying research paper must focus on the use of architectural precedents as the basis for the creation of typologically-based propositions. Submission to the external competition is mandatory, the timing and detailed requirements of which will determine the personalized academic requirements for this course.",
        "title": "Competitions in Architecture"
    },
    {
        "code": "ARCH 362",
        "description": "Architectural case studies are used to examine conceptual development, structural design, building process, and the selection of structural steel and concrete systems. Topics such as tension, flexural, and compression members; and connections are studied using calculations, design aids, rules of thumb, and the latest CSA design standards.",
        "title": "Steel and Concrete: Design, Structure and Construction"
    },
    {
        "code": "ARCH 364",
        "description": "The physio-technical factors that influence building design for performance, durability, efficiency, health, and sustainability will be explored. Common building design construction problems, their causes and solutions, will be examined with the aid of case studies. Using the principles of building science, good details of masonry, wood, steel, and glass will be developed.",
        "title": "Building Science"
    },
    {
        "code": "ARCH 384",
        "description": "This course offers a student an opportunity for independent research into architectural problems not offered in the regular curriculum. It allows guided exploration of a specific architectural problem area, of appropriate complexity to the particular term.",
        "title": "Architectural Research"
    },
    {
        "code": "ARCH 392",
        "description": "Development of design skills and theoretical knowledge through their application in projects involving various building types in urban situations. Emphasis is placed upon issues of materiality and technology in architectural design.",
        "title": "Design Studio"
    },
    {
        "code": "ARCH 393",
        "description": "This design studio is subdivided into distinct studio sections, each of which provides a specific platform for advanced research and design presented within the context of a topic or set of issues to be explored in relation to a specific design project, program, and site. These studios range in both scale and scope, traversing an array of academic investigations, design hypotheses, research agendas, interdisciplinary explorations, and pedagogical intentions. These topics foreground the disciplinary arenas within architecture in the areas of architectural theory, media, technology, urbanism, and landscape.",
        "title": "Option Design Studio"
    },
    {
        "code": "ARCH 428",
        "description": "History of settlement and building in Rome and the surrounding area from antiquity to the present. Acts of design in architecture, urban form and landscape related to political, cultural, and spiritual authority of Rome. Comparison drawn between the image of the city, represented in literature and art, and the material facts of the place. Field trips, lecture.",
        "title": "Rome and the Campagna (Rome)"
    },
    {
        "code": "ARCH 429",
        "description": "A global cities course enabling students to travel abroad and study first hand the architecture and urbanism of cities across Europe, Asia, and South America. These course offerings are thematically based and involve field trips to specific architectural sites, cities, and regions around the world.",
        "title": "Global Cities"
    },
    {
        "code": "ARCH 442",
        "description": "This course presents a thematically organized survey of contemporary architectural theory that focuses on the relationship between key theoretical texts and critical developments in contemporary architectural theory, practice, and their social and ecological contexts. This course is intended to be a forum for discussion of selected topics in contemporary culture, and to provide students with an advanced knowledge base in contemporary theory broadly, and architectural theory more specifically to ground other forms of advanced architectural research. Themes explored in the course may include ethics in architectural practice, gender and identify in architecture, race and spatial justice, climate, sustainability, and ecological care.",
        "title": "Contemporary Architectural Theory"
    },
    {
        "code": "ARCH 446",
        "description": "The course provides a survey of the history of settlement and urban form on the Italian peninsula from antiquity to the present day. In it the influences upon the structure of public and private space are outlined for each historical period. These include constants such as geography and climate, but more especially the factors that induce and manifest change: politics, warfare, economics, social structure, the arts, and theory.",
        "title": "Italian Urban History (Rome)"
    },
    {
        "code": "ARCH 449",
        "description": "The course addresses the issues of architecture and urbanism in Rome and Italy from 1750 to the present. It explores the relationship between cultural, political, and artistic phenomena such as Futurism, Novecento, and Rationalism, that anticipate and create modernism in Italy.",
        "title": "The Development of Modern Italian Architecture (Rome)"
    },
    {
        "code": "ARCH 463",
        "description": "This course is focused on the integrated environmental systems of buildings with an aim to develop the knowledge and skills appropriate to architectural practice. Subjects covered include environmental parameters, air and water systems, heating and cooling loads, energy conservation, ventilating and air conditioning systems, plumbing and waste systems, artificial source lighting and daylighting, acoustics, and fire protection criteria and systems, with reference to building codes and standards.",
        "title": "Integrated Environmental Systems"
    },
    {
        "code": "ARCH 473",
        "description": "Students will investigate and report on technical issues as they relate to the development of the comprehensive building project in the parallel Design Studio. Innovation and integration in architectural design will be stressed with respect to structure, building envelope, environmental systems, health and life safety, movement systems, site planning, and the integration of information technology.",
        "title": "Technical Report"
    },
    {
        "code": "ARCH 485",
        "description": "This course offers a student an opportunity for independent research into architectural problems not offered in the regular curriculum. It allows guided exploration of a specific architectural problem area, of appropriate complexity to the particular term.",
        "title": "Architectural Research"
    },
    {
        "code": "ARCH 492",
        "description": "The studio course is mounted in Rome, Italy, with the school's own faculty and premises, and offers a unique opportunity to undertake design studies in a truly rich architectural heritage. The main focus is the nature of the institution and its relationship to the city and its culture. Students participating in the Rome term are expected to defray the costs of travel, accommodation, and food. For students unable to study in Rome, an alternative studio is offered in Cambridge. It presents similar design projects and theoretical questions in a North American context.",
        "title": "Design Studio"
    },
    {
        "code": "ARCH 493",
        "description": "This studio represents a culmination of the pre-professional degree, through the integration and application of skills and knowledge to a complex building project. Students will develop designs to a high level of detail. A concern for technical material, environmental, and legal aspects of architecture will support open speculation and innovative design.",
        "title": "Design Studio/Comprehensive Building Design"
    },
    {
        "code": "ARCH 510",
        "description": "A range of special topics within visual and digital media that include course offerings in parametric design and scripting, advanced visualization, interaction design, and digital fabrication.",
        "title": "Special Topics in Visual and Digital Media"
    },
    {
        "code": "ARCH 520",
        "description": "A range of special topics courses within urbanism and landscape.",
        "title": "Special Topics in Urbanism and Landscape"
    },
    {
        "code": "ARCH 540",
        "description": "A range of special topics courses within cultural and architectural history, theory, and criticism.",
        "title": "Special Topics in Architectural History and Theory"
    },
    {
        "code": "ARCH 570",
        "description": "A range of special topics courses within building technologies, structures, materials and methods and environmental systems including coursework in alternative energy systems, ecological design and design build.",
        "title": "Special Topics in Building Technology and Environmental"
    },
    {
        "code": "ARCH 580",
        "description": "The equity and environmental justice electives include courses that are at the intersection of representation, culture, technology, environment, landscape, and urbanism to consider questions of race, space, and environmental justice, addressing a range of topics that can include universal design principles, design norms and standards, exclusionary and inclusive practices in architecture, questions of solidarity, climate crisis, sustainability, as well as social and spatial justice.",
        "title": "Special Topics in Race, Equity, and Environmental Justice"
    },
    {
        "code": "BME 101",
        "description": "This course introduces first-year students to biomedical engineering with a focus on the engineering profession and technical communication skills. Through in-class and independent activities leading to formative and summative assessments, students will consider and reflect on communication intention, audience, content, medium, format, and tone to demonstrate and improve upon their listening, written and oral communication skills for academic, engineering, and professional context.",
        "title": "Communications in Biomedical Engineering-Written and Oral"
    },
    {
        "code": "BME 101L",
        "description": "This laboratory course introduces students to visual communication methods relevant to engineering analysis and design. Through in-class and independent activities leading to formative and summative assessments, students will consider and reflect on communication intention, audience, content, medium, format, and level of detail to demonstrate and improve upon their skills in graphing, freehand sketching, technical drawing, and computer-aided design (CAD).",
        "title": "Communications in Biomedical Engineering-Visualization"
    },
    {
        "code": "BME 121",
        "description": "The key skills necessary to develop software solutions to solve biomedical engineering problems. Topics include software development, software design, programming language syntax, object oriented programming, structured programming, arrays, matrices, pointers, and algorithm efficiency. The topics will be reinforced in the context of practical biomedical software systems such as physiological monitoring systems and clinical support systems. ",
        "title": "Digital Computation"
    },
    {
        "code": "BME 122",
        "description": "Topics of structured software design, data structures, abstract data types, recursive algorithms, algorithm and data structure analysis and design from both computational and memory perspectives, lists, stacks, queues, trees, graphs, sorting and searching, hashing, and problem-solving strategies. Embedded programming in health monitoring systems and healthcare management systems.",
        "title": "Data Structures and Algorithms"
    },
    {
        "code": "BME 161",
        "description": "Topics related to biomedical design will be covered: multidisciplinary system design, design process, problem definition, life-cycle design, design specification, function analysis, design evaluation and decision-making, introduction to mechanical design, prototyping, experimentation, safety and responsibility in engineering design, design for society and environment, and design documentation.",
        "title": "Introduction to Biomedical Design"
    },
    {
        "code": "BME 162",
        "description": "Design of human-machine environments, designing for patient safety and reduce human error in decision-making, analytical methods of determining user needs, information processing and human sensory processes and consideration of these elements in the design of systems with humans, and consideration of human physical capabilities in ergonomic design. Topics will be reinforced in the context of the design of prosthetics or rehabilitation devices.",
        "title": "Human Factors in the Design of Biomedical and Health Systems"
    },
    {
        "code": "BME 181",
        "description": "Introduction to the basic theory and principles of mechanics of static systems. Topics covered include statics of particles, rigid bodies and force systems, equilibrium of rigid bodies, analysis of joints and frames, distributed forces, centroids and moments of inertia, and friction. Applications of mechanical principles to musculoskeletal systems will be presented.",
        "title": "Physics 1: Statics"
    },
    {
        "code": "BME 182",
        "description": "The science of motion is taught with initial focus on particles, and then progressing to planar rigid body systems. Concepts such as inertia, momentum, work, energy, Newton's laws, and contact dynamics are covered, with particular application to human motions (e.g., walking, running, jumping, lifting, and throwing).",
        "title": "Physics 2: Dynamics"
    },
    {
        "code": "BME 186",
        "description": "The stoichiometry of compounds and chemical reactions. Periodicity and chemical bonding. Electronic structure of atoms and molecules, correlation with the chemical reactivity of common elements, inorganic and organic compounds. Kinetics and thermodynamics in chemical systems. Introduction to electrochemistry, analytical chemistry, and acid/base reactions. Structure, nomenclature, and reactions of important classes of organic compounds and functional groups. Introduction to synthetic and biological polymers and polymerization reactions. Surface chemistry, catalysis, and enzymes. Applications of chemistry principles in biomedical engineering.",
        "title": "Chemistry Principles"
    },
    {
        "code": "BME 213",
        "description": "Fundamentals of probability and statistics, and applications to biomedical engineering. Random variables and statistical distributions, statistical estimation, hypothesis testing, regression, and experiment design considerations. Applications to biomedical experiments, biomedical imaging data, and clinical trials.",
        "title": "Statistics and Experimental Design"
    },
    {
        "code": "BME 252",
        "description": "Models and analysis of linear systems in the context of measurement and processing of biosignals such as electroencephalography (EEG), electrocardiography (ECG), and electromyography (EMG). Discrete and continuous time systems, difference and differential equations, impulse and frequency response, transform domain techniques, transfer functions and frequency response, frequency domain analysis of linear systems, sampling theory, stability, and linear filters.",
        "title": "Linear Systems and Signals"
    },
    {
        "code": "BME 261",
        "description": "Problem-solving approaches, agile design and development, rapid prototyping, revision control, design patterns, development cycles, and simulation. Topics will be reinforced in the context of biomedical engineering projects conducted in groups within a collaborative environment.",
        "title": "Prototyping, Simulation and Design"
    },
    {
        "code": "BME 281",
        "description": "Introduction to mechanical response of materials and stress-strain relationship. Behaviour of prismatic members in tension, compression, shear, bending, and torsion. Shear-force and bending-moment diagrams. Introduction to instability. Mechanical properties of biological tissues, and viscoeleastic models. Applications to bone, cartilage, and biomedical implants.",
        "title": "Mechanics of Deformable Solids"
    },
    {
        "code": "BME 281L",
        "description": "Laboratory experiments for students taking BME281.",
        "title": "Mechanics of Deformable Solids Laboratory"
    },
    {
        "code": "BME 282",
        "description": "Crystalline structure, crystal defects, non-crystalline materials, structure and properties of metals, ceramics, glasses, semi-conductors, polymers, and composites. Factors in materials design, material selection and processing in the context of biomedical devices and instruments will also be discussed.",
        "title": "Materials Science for Biomedical Engineers"
    },
    {
        "code": "BME 284",
        "description": "The structure, functions, and properties of the major biological systems (musculoskeletal, nervous, cardiovascular) will be presented in relation to the design of biomedical devices (imaging, assistive, and diagnostic). Concepts in modelling biological systems will be introduced. Various aspects of pathology and how they influence medical device design will also be discussed.",
        "title": "Physiological and Biological Systems"
    },
    {
        "code": "BME 284L",
        "description": "Laboratory experiments for students taking BME284.",
        "title": "Physiology and Anatomy Laboratory"
    },
    {
        "code": "BME 285",
        "description": "Introduction to basic concepts of biochemistry and cell biology. Overview of the chemistry of amino acids, carbohydrates, lipids, and nucleic acid. Structure and properties of proteins and enzymes. Elements of cell structure and diversity, and relationship of biochemistry with cell metabolism. A focus on biomedical engineering with relevant examples such as biomimetic engineering design, system biology, and tissue engineering.",
        "title": "Engineering Biology"
    },
    {
        "code": "BME 285L",
        "description": "Laboratory experiments for students taking BME285.",
        "title": "Engineering Biology Laboratory"
    },
    {
        "code": "BME 294",
        "description": "Basic concepts of hardware measurement systems pertaining to the measurement of biosignals: active and passive circuit elements, Kirchhoff's laws, mesh and nodal circuit analysis, principle of superposition, step responses of first and second order networks, sinusoidal steady state analysis, input-output relationships, transfer functions and frequency response of linear systems, operational amplifiers, analog signal detection, conditioning and conversion systems, transducers, difference and instrumentation amplifiers, A/D and D/A conversion. Examples will be presented in the form of physiological monitoring hardware for vital measurements such as electroencephalography (EEG), electrocardiography (ECG), and electromyography (EMG).",
        "title": "Circuits, Instrumentation, and Measurements"
    },
    {
        "code": "BME 294L",
        "description": "Laboratory experiments for students taking BME294.",
        "title": "Circuits, Instrumentation, and Measurements Laboratory"
    },
    {
        "code": "BME 355",
        "description": "Introduction to systems theory as a general modelling method, and applied to the skeletal, neuromuscular, central nervous, cardiovascular, and respiratory systems of the human body. Time-domain simulations, sensitivity analyses, and parameter identification, with the latter driven by experimental measurements of system performance.",
        "title": "Physiological Systems Modelling"
    },
    {
        "code": "BME 356",
        "description": "Classical and state space representations of control systems. Stability, controllability, observability, and sensitivity. Routh-Hurwitz and root-locus methods. Frequency domain behaviour, Bode plots, Nyquist stability criteria. Pole placement, PID, phase-lead and phase-lag controllers. Application to anatomical system models, including musculoskeletal and cardiovascular systems, and to physiological feedback systems.",
        "title": "Control Systems"
    },
    {
        "code": "BME 356L",
        "description": "Laboratory experiments for students taking BME356.",
        "title": "Control Systems Laboratory"
    },
    {
        "code": "BME 361",
        "description": "The course covers topics related to product design and regulatory processes as it pertains to biomedical devices. Various regulatory pathways will be covered and how these regulations influence design and development will be explored. Students will gain an understanding of the engineering processes necessary to ensure safety and efficacy during commercialization of novel biomedical products by examining regulatory processes, design controls, risks assessments, non-clinical testing, design verification and validation strategies, and postmarket requirements.",
        "title": "Biomedical Product Design and Regulation"
    },
    {
        "code": "BME 362",
        "description": "Engineering design project course where students work in small groups as part of a biomedical design workshop sequence. This portion of the project will be focused on needs assessment, including specification development. Project management, teamwork, reflection, ethics, and project critique will also be covered in the context of engineering design. Technical skill development workshops to support practical application of biomedical design will be included.",
        "title": "Biomedical Engineering Design Workshop 1"
    },
    {
        "code": "BME 364",
        "description": "This course examines key economic issues in health care and biomedical industries. Topics include the market for medical care, health insurance, various models of healthcare delivery and competition and the role of government in policy, financing and delivery of health care. This course will train students to use economic analysis to model and understand the complex interactions between health care delivery, insurance markets, health innovators, governments, and firms.",
        "title": "Engineering Biomedical Economics"
    },
    {
        "code": "BME 381",
        "description": "This course explores ethical issues in biomedical engineering practice, including professional ethics, medical ethics, the ethics of human and animal subject use in biomedical research, and the impact of biomedical engineering solutions on society and the environment.",
        "title": "Biomedical Engineering Ethics"
    },
    {
        "code": "BME 384",
        "description": "Fundamental concepts in systems involving fluid flow. Basic treatment of statics, kinematics, and dynamics of fluids. Mass transfer, conservation of mass, momentum and energy for a control volume. Dimensional analysis and similarity. Discussion of flow in pipes and channels and brief introduction to boundary layers, lift and drag, ideal and compressible flow will be specifically covered in the context of the cardiovascular system (macrocirculation and microcirculation).",
        "title": "Biomedical Transport: Biofluids and Mass Transfer"
    },
    {
        "code": "BME 386",
        "description": "This course offers a comprehensive introduction to the fundamental principles governing the interaction of electromagnetic and mechanical waves with matter, encompassing essential concepts in electricity, magnetism, and optics. Building on this foundational knowledge, students will delve into the theories and applications of various medical imaging technologies, including X-rays, computed tomography (CT), magnetic resonance imaging (MRI), ultrasound (sonography), and optical microscopy techniques. The course will also discuss how these basic physical principles underpin and facilitate advancements in medical imaging.",
        "title": "The Physics of Medical Imaging"
    },
    {
        "code": "BME 393",
        "description": "Digital technology, combinatorial logic, binary arithmetic, sequential circuits, digital design, and microcontrollers. Topics will be reinforced in the context of biomedical microcontrollers and sensors used in physiological monitoring and clinical support systems.",
        "title": "Digital Systems"
    },
    {
        "code": "BME 393L",
        "description": "Laboratory experiments for students taking BME393, focusing on circuit construction, simulation, and design.",
        "title": "Digital Systems Laboratory"
    },
    {
        "code": "BME 399",
        "description": "A biomedical research project carried out under the supervision of a faculty member. Students interested in graduate studies or industrial research careers will gain experience in advanced research techniques and develop valuable research skills. A written report is to be submitted to the course co-ordinator. This course is extra over and above the normal course load.",
        "title": "Directed Biomedical Research Project"
    },
    {
        "code": "BME 400",
        "description": "A work-term presentation. The presentation provides an opportunity for students to effectively communicate and reflect on their engineering experience gained during their co-op work terms. In the presentation, students draw connections between the theoretical aspects of engineering taught in the classroom and the practical applications of that theory in the workplace.",
        "title": "Work-Term Presentation"
    },
    {
        "code": "BME 411",
        "description": "Interpolation and curve fitting, root-finding methods, local and global optimization methods, constrained optimization, multiobjective and multidisciplinary design optimization for biomedical applications.",
        "title": "Optimization and Numerical Methods"
    },
    {
        "code": "BME 461",
        "description": "The first half of a two-term engineering design project continuing the biomedical design workshop sequence. A prototype and interim progress report are presented at the end of the first term. Lecture topics include safety and risk analysis of biomedical technologies.",
        "title": "Biomedical Engineering Design Workshop 2"
    },
    {
        "code": "BME 462",
        "description": "The concluding half of the fourth-year Biomedical Engineering Design Workshop.",
        "title": "Biomedical Engineering Design Workshop 3"
    },
    {
        "code": "BME 499",
        "description": "A major undergraduate individual biomedical research project carried out as a technical elective (TE) under the supervision of a faculty member. Students are expected to demonstrate initiative and responsibility. An oral presentation of results and a written report are the minimum requirements. The faculty supervisor or department may set other requirements. Students will arrange for a faculty supervisor prior to registration.",
        "title": "Elective Biomedical Research Project"
    },
    {
        "code": "BME 530",
        "description": "A broad introduction to the Canadian healthcare system, with emphasis on factors related to biomedical engineering. History, structure, and function of various healthcare organizations, procurement practices in healthcare, electronic health records and information exchange.",
        "title": "The Healthcare System"
    },
    {
        "code": "BME 540",
        "description": "Introduction to the field of neural and rehabilitation engineering (NRE). Topics include describing common neurological and musculoskeletal injuries, related neural and rehabilitation engineering approaches to address disabilities, and the development of a design framework for synthesizing a novel neural and rehabilitation engineering approach. Critical concepts in clinical research design to meet current regulatory, ethical, and practice policies will be studied.",
        "title": "Fundamentals in Neural and Rehabilitation Engineering"
    },
    {
        "code": "BME 544",
        "description": "This course develops an understanding of biomedical measurements through the examination of electromyographic (EMG), electroencephalographic (EEG), and electrocardiographic (ECG) signals. Measurement of human-body position, force, and pressure, and related instrumentation will also be presented. Signal processing techniques will be discussed in the context of extraction and application of useful biomedical signals.",
        "title": "Biomedical Measurement and Signal Processing"
    },
    {
        "code": "BME 550",
        "description": "This course focuses on the application of engineering principles to the analysis of sports equipment and their effects on athletic performance. Principles of mechanics are used to understand the motion and forces arising in sports equipment, and their interaction with the musculoskeletal dynamics of athletes.",
        "title": "Sports Engineering"
    },
    {
        "code": "BME 551",
        "description": "This course introduces students to the biomechanics of the musculoskeletal system, including motor control and rehabilitation engineering. Multibody models in two-dimensional (2D) and three-dimensional (3D) will be used to study the dynamics of normal and pathological motions. Motor control will be included, as well as the identification of body segment parameters and the dynamics of muscles. Applications may include assistive devices, rehabilitation, human gait, occupational biomechanics, and other activities.",
        "title": "Biomechanics of Human Movement"
    },
    {
        "code": "BME 552",
        "description": "This course will introduce engineering students to the topic of computational biomechanics. Students will gain practical experience in biomechanical modelling and simulation, with a specific focus on the musculoskeletal (MSK) system and human body movement, injury, and repair.",
        "title": "Computational Biomechanics"
    },
    {
        "code": "BME 553",
        "description": "This course covers select topics fundamental to the study of the mechanical behaviour of biological (e.g., bone, tendon, skin, cartilage, etc.) and synthetic (polymers, ceramics, metals, etc.) biomaterials with a strong emphasis on materials found in medicine (biomedical materials). Topics will include a selection of basics of continuum mechanics, structure-function-property (mechanistic) relationships, linear and non-linear elasticity, viscoelasticity, anisotropy, failure criteria, fracture, fatigue, and fundamentals of mechanical testing in the biomaterials and tissues context.",
        "title": "Introductory Mechanics of Biomedical and Biological Materials"
    },
    {
        "code": "BME 561",
        "description": "The course provides an overview of the recent advances in medicine and nano-technologies for development of tissue engineering and regenerative medicine. Strategies and technologies for designing, testing, and manufacturing of biomaterials and tissue-engineering products will be introduced. The biological and clinical applications will be discussed. The unmet medical needs, challenges in manufacturing, regulatory approval and commercialization for tissue engineering applications will also be discussed.",
        "title": "Biomaterials and Tissue Engineering"
    },
    {
        "code": "BME 564",
        "description": "The course covers fundamental topics of biocompatibility of materials in medicine (polymers, ceramics, metals, composites) in the areas of implantable, extracorporeal, and untethered medical devices. Biocompatibility issues of biomaterials, such as protein adsorption, foreign body reaction, immune and inflammatory response, and thrombosis will be presented. Biomaterial characterization, structure-property relationship, and surface modification will be discussed in the context of improving biocompatibility. Clinical applications and design strategies to reduce complications associated with medical devices will be explored.",
        "title": "Biocompatibility and Biomedical Design"
    },
    {
        "code": "BME 581",
        "description": "Ultrasound physics, scanning modes, data acquisition schemes, transducer basics, wave-matter interactions; biomedical applications of ultrasound including imaging, flow measurements, microscopy, therapy, drug delivery.",
        "title": "Ultrasound in Medicine and Biology"
    },
    {
        "code": "BME 582",
        "description": "This course provides a comprehensive exploration of optical principles, techniques, and instrumentation used in pre-clinical research and clinical diagnosis settings. The fundamental principles of light-tissue interactions and biophotonics will be presented as well as optical sensing and the design of spectroscopy systems tailored for applications in biomedical research and healthcare.",
        "title": "Biomedical Optics"
    },
    {
        "code": "BME 587",
        "description": "This course deals with selected topics at the undergraduate level in medical imaging and diagnostics, biosignals, and neuroscience.",
        "title": "Special Topics in Biomedical Signals"
    },
    {
        "code": "BME 588",
        "description": "This course deals with selected topics at the undergraduate level in biofluid mechanics, tissue mechanics, sports engineering, and rehabilitation engineering.",
        "title": "Special Topics in Biomechanics"
    },
    {
        "code": "BME 589",
        "description": "This course deals with selected topics at the undergraduate level in assistive devices, implants, prostheses, orthoses, biomedical technologies, therapeutics, and biocompatibility.",
        "title": "Special Topics in Biomedical Devices"
    },
    {
        "code": "BME 599",
        "description": "This course deals with selected topics at the undergraduate level in biomedical engineering and healthcare systems.",
        "title": "Special Topics in Biomedical Engineering"
    },
    {
        "code": "CHE 100",
        "description": "Introduction to basic methods and principles in chemical engineering. The fundamentals of engineering calculations (units and dimensions), behaviour of fluids, mass balances, processes, and process variables.",
        "title": "Chemical Engineering Concepts 1"
    },
    {
        "code": "CHE 101",
        "description": "Development of chemical process analysis skills. Introduction to single- and multi-phase physical equilibria. Material and energy balances in reactive and non-reactive systems. Introduction to investigation and technical communication through laboratory experiments illustrating the physical principles discussed. In the winter term only: brief review of co-op fundamentals.",
        "title": "Chemical Engineering Concepts 2"
    },
    {
        "code": "CHE 102",
        "description": "Chemical principles with applications in engineering. Stoichiometric calculations, properties of gases, properties of liquids and solutions, gas phase chemical equilibrium, ionic equilibrium in aqueous solution, oxidation-reduction reactions, chemical kinetics.",
        "title": "Chemistry for Engineers"
    },
    {
        "code": "CHE 120",
        "description": "Using computers as problem-solving tools. Introduction to computer architecture and networking. Effective use of command line interfaces and graphical user interfaces. Word processing, spreadsheet, and presentation software. Introduction to programming and numerical computing using a high-level interpreted programming language. Programming fundamentals including flow charts, variables, design and use of functions, strings and text input/output, relational operators, conditionals, collections, loops. Numerical computing, plotting, and file input/output.",
        "title": "Computer Literacy and Programming for Chemical Engineers"
    },
    {
        "code": "CHE 161",
        "description": "Introduction to basic concepts of biochemistry and cell biology. Overview of the chemistry of amino acids, carbohydrates, lipids, and nucleic acids. Properties and functions of biopolymers. Elements of cell structure and diversity, and relationship of biochemistry with cell metabolism. A focus on biotechnologically relevant examples such as biomimetic engineering design, proteomics, system biology, and high throughput biology.",
        "title": "Engineering Biology"
    },
    {
        "code": "CHE 180",
        "description": "Engineering as a profession. An introduction to the fundamentals of data analysis, investigation, design, and communication in chemical engineering. Introduction to chemical product and process design. Needs analysis and problem identification. Literature search and brainstorming. Design requirements, constraints, and criteria. Development and preliminary evaluation of alternative solutions using software tools. Process synthesis, block diagrams, process flow diagrams (PFD), and piping and instrumentation diagrams (P&ID). Introduction to computer-aided design (CAD). Safety and sustainability in design. Principles of green engineering. Occupational health and safety. Introduction to process safety and process hazard identification. Communication of technical information, written reports, and oral presentations. Teamwork. Professional development, rsum and interview skills, and e-portfolios. Students undertake a term-long design project under the supervision of the instructor.",
        "title": "Chemical Engineering Design Studio 1"
    },
    {
        "code": "CHE 181",
        "description": "Development of chemical engineering analysis, investigation, design, and communication skills. Introduction to engineering measurement. Instrument performance characteristics. Electric circuits, current, voltage and resistance, measurements, and signal transmission. Electrical safety. Measurement uncertainty, types of errors, calibration, instrument uncertainty analysis, and error propagation. Measurement of force and load, chemical composition, temperature, pressure and flow. Sensor interfacing and data acquisition using software. Process safety management and inherently safer design. Prototyping, testing, and verification. Communication of technical information, written reports, and oral presentations. Teamwork. Students undertake a term-long design project under the supervision of the instructor.",
        "title": "Chemical Engineering Design Studio 2"
    },
    {
        "code": "CHE 200",
        "description": "Equilibrium between phases; the equilibrium stage concept. Cascades of stages with and without reflux; group methods and stage-by-stage approaches; graphical solutions. Applications in the separation of components by distillation, absorption, stripping, extraction, and leaching.",
        "title": "Equilibrium Stage Operations"
    },
    {
        "code": "CHE 211",
        "description": "Fundamentals of fluid flow. Conservation laws for mass, momentum and mechanical energy. Flow of fluids in conduits. Flow past immersed bodies. Flow through beds of solids, fluidization. Transportation and metering of fluids. Dimensional analysis.",
        "title": "Fluid Mechanics"
    },
    {
        "code": "CHE 220",
        "description": "Introduction to statistical methods for analyzing and interpreting process data. Introduction to statistical ideas, probability theory, distribution theory, sampling theory, confidence intervals, and significance tests. Introduction to regression analysis. Introduction to design of experiments and statistical quality control.",
        "title": "Process Data Analysis"
    },
    {
        "code": "CHE 225",
        "description": "A course in practical statistics at a level one step beyond an elementary course. Material includes regression analysis for linear and nonlinear models, analysis of variance, statistical inference, single and multiple comparisons, and an introduction to the design of experiments including single factor designs, multifactor designs, response surface methods, d-optimality (with empirical and mechanistic models), and the analysis of undesigned data. Applications to process improvement, product development, and research problems will be explored. Use of statistical analysis software to apply these techniques.",
        "title": "Strategies for Process Improvement and Product Development"
    },
    {
        "code": "CHE 230",
        "description": "Thermodynamics: work and heat as forms of energy. First law, internal energy and enthalpy. Heats of chemical and physical changes. Cycles and the second law, entropy. Spontaneity and equilibrium, free energies. Systems of variable composition, chemical equilibrium. Phase equilibrium and the phase rule. Ideal solutions, colligative properties.",
        "title": "Physical Chemistry 1"
    },
    {
        "code": "CHE 231",
        "description": "Thermodynamics: ideal solutions; non-ideal solutions, non-electrolytic and electrolytic solutions, phase equilibrium and phase diagrams, reaction equilibrium. Surface phenomena: surface tension, capillarity, properties of small particles, adsorption. Chemical kinetics: rate laws, reaction rates, mechanisms, catalysis, heterogeneous reactions.",
        "title": "Physical Chemistry 2"
    },
    {
        "code": "CHE 241",
        "description": "Fundamentals; atomic bonding, crystalline structure, crystal defects, non-crystalline materials; structure and properties of metals, ceramics, glasses, semi-conductors. Amorphous materials, polymers, composites. Processing and concepts of engineering design of materials.",
        "title": "Materials Science and Engineering"
    },
    {
        "code": "CHE 290",
        "description": "A selection of computer and laboratory exercises refreshing and reinforcing material covered in the previous term. Topics may include basic microbiology and biotechnology, introductory physical chemistry, mass and energy balances.",
        "title": "Chemical Engineering Lab 1"
    },
    {
        "code": "CHE 291",
        "description": "A selection of computer and laboratory exercises refreshing and reinforcing material covered in the previous term. Topics may include physical chemistry, design of experiments and statistics, and equilibrium stage operations.",
        "title": "Chemical Engineering Lab 2"
    },
    {
        "code": "CHE 298",
        "description": "Directed research project under the supervision of faculty members. Participation will give students experience in advanced research techniques, with valuable training for those potentially interested in graduate school or industrial research careers. Taken over and above normal course load. Good standing required for registration.",
        "title": "Directed Research Project"
    },
    {
        "code": "CHE 299",
        "description": "Directed research project under the supervision of faculty members. Participation will give students experience in advanced research techniques, with valuable training for those potentially interested in graduate school or industrial research careers. Taken over and above normal course load. Good standing required for registration.",
        "title": "Directed Research Project"
    },
    {
        "code": "CHE 312",
        "description": "Fundamentals of mass transfer: species and mixture velocities, diffusive and convective fluxes, Fick's law and the diffusion coefficient. Vector form of the microscopic (differential) mass balance. Fundamentals of heat transfer: conduction, convection and radiation, Fourier's law and thermal conductivity. Vector form of the microscopic thermal energy balance for solids and incompressible fluids. Mass and heat transfer models leading to ordinary differential equation problems in Cartesian, cylindrical and spherical geometries; types of boundary conditions. Bessel functions. Analytical solution of linear partial differential equations: combination of variables, separation of variables and Sturm-Liouville theory, Laplace transform. Mass and heat transfer models leading to linear partial differential equations: 1D transient diffusion and conduction in Cartesian, cylindrical and spherical geometries; steady-state 2D conduction and diffusion. Heat-mass transfer analogies and dimensionless numbers.",
        "title": "Mathematics of Heat and Mass Transfer"
    },
    {
        "code": "CHE 313",
        "description": "Convective heat transfer. Analysis of convective heat transfer in external flows using the boundary layer approach. Analysis of convective heat transfer in internal flows. Empirical correlations for convective heat transfer. Heat transfer with phase change: condensation and boiling. Heat exchanger design. Convective mass transfer. Empirical correlations for convective mass transfer. Mass transfer at fluid-fluid interfaces. Design of continuous differential contactors for absorption/stripping, distillation and liquid-liquid extraction. Analogy between heat, mass and momentum transfer. Dimensional analysis. Simultaneous heat and mass transfer operations.",
        "title": "Applications of Heat and Mass Transfer"
    },
    {
        "code": "CHE 314",
        "description": "Review of stoichiometry and chemical kinetics. Homogeneous reactors: isothermal operation; batch; semi-batch; continuous tank; plug flow reactor design. Continuous stirred-tank reactors (CSTRs) in series; plug flow reactor with recycle. Multiple reactions in reactor networks. Temperature effects in adiabatic and non-isothermal reactors. Yield, selectivity and optimal operation of reactors. Heterogeneous catalysis and effectiveness factors in two-phase reactors.",
        "title": "Chemical Reaction Engineering"
    },
    {
        "code": "CHE 322",
        "description": "Systems of linear and non-linear algebraic equations; polynomial and spline interpolation; numerical differentiation and integration; numerical solution of initial value and boundary value ordinary differential equation problems: accuracy and stability, step size control and stiffness; finite differences for the numerical solution of elliptic and parabolic partial differential equations: method of lines, explicit vs. implicit finite-difference methods; introduction to the finite element method (optional).",
        "title": "Numerical Methods for Process Analysis and Design"
    },
    {
        "code": "CHE 330",
        "description": "Review of fundamentals, including 2nd law and concepts of equilibrium, phase and reaction equilibria, fugacity, exergy. Thermodynamics applied to practical situations. Examples chosen from: fluid flow; power generation; refrigeration; air conditioning and water cooling; liquefaction of gases; equilibria in complex chemical reactions and separation processes; surface phenomena; electrochemical reactions; biological processes. ",
        "title": "Chemical Engineering Thermodynamics"
    },
    {
        "code": "CHE 331",
        "description": "Topics and applications of electrochemistry and electrochemical engineering. Industrial process examples. Environmental aspects. Ionic equilibria. Laws of electrolysis. Theory of electrolytes. Transport properties of electrolytes. Reversible cell potentials. Irreversible electrode processes. Thermodynamic and kinetic aspects of corrosion. Common examples of corrosion. Electrochemical energy conversion and storage.",
        "title": "Electrochemical Engineering"
    },
    {
        "code": "CHE 341",
        "description": "Laplace transform techniques. Proportional-integral-derivative control. Frequency response methods. Stability analysis. Controller tuning. Process control simulation and computer control systems. Process identification.",
        "title": "Introduction to Process Control"
    },
    {
        "code": "CHE 361",
        "description": "Review of elementary aspects of microbiology, biochemistry, molecular biology, and genetic engineering. Introduction of biological systems for the production of commercial goods and services, e.g., foods, pharmaceuticals, chemicals, fuels, diagnostics, waste treatment, and biomaterials. Introduction to design of bioprocess systems, including biosafety and sustainability. Development of reaction kinetics associated with biological systems. Quantification of metabolism. Development of material balances for key constituents in bioreactors operated in different modes, e.g., batch, fed-batch, continuous stirred-tank reactor (CSTR), perfusion, recycle. Introduction to mass and heat transfer considerations for bioreactors. Dynamic simulation of cultures defined by ordinary differential equations. Introduction of downstream processes associated with biological systems and recovery of biological products.",
        "title": "Bioprocess Engineering"
    },
    {
        "code": "CHE 383",
        "description": "An introduction to the engineering design process, including problem definition and needs analysis, critical analysis of problems, alternative solutions, process synthesis, design constraints, and safety and environmental protection in design. This course also develops and enhances team work, project management, and technical communication (written and oral). Students in teams work on open-ended problems and apply the formal methods of engineering design. At the conclusion of this course, each student team presents a pre-proposal of the design project that will become the subject of CHE482 and CHE483.",
        "title": "Chemical Engineering Design Workshop"
    },
    {
        "code": "CHE 390",
        "description": "A selection of computer and laboratory exercises, and project-based investigations, refreshing and reinforcing material covered in the previous term. Topics may include fluid mechanics, physical chemistry and kinetics, materials properties, and testing.",
        "title": "Chemical Engineering Lab 3"
    },
    {
        "code": "CHE 398",
        "description": "Directed research project under the supervision of faculty members. Participation will give students experience in advanced research techniques, with valuable training for those potentially interested in graduate school or industrial research careers. Taken over and above normal course load. Good standing required for registration.",
        "title": "Directed Research Project"
    },
    {
        "code": "CHE 399",
        "description": "Directed research project under the supervision of faculty members. Participation will give students experience in advanced research techniques, with valuable training for those potentially interested in graduate school or industrial research careers. Taken over and above normal course load. Good standing required for registration.",
        "title": "Directed Research Project"
    },
    {
        "code": "CHE 425",
        "description": "A course in practical statistics at a level one step beyond an elementary course. Material includes regression analysis for linear and nonlinear models, analysis of variance, statistical inference, single and multiple comparisons, and an introduction to the design of experiments including single factor designs, multifactor designs, response surface methods, d-optimality (with empirical and mechanistic models), and the analysis of undesigned data. Applications to process improvement, product development, and research problems will be explored. Use of statistical analysis software to apply these techniques.",
        "title": "Strategies for Process Improvement and Product Development"
    },
    {
        "code": "CHE 450",
        "description": "An engineering report based upon a technical project, activity, or analysis carried out by the student, during the preceding work-term employment. Evaluation is based upon a level of written communication, technical proficiency, and engineering analysis appropriate to a graduating engineering student.",
        "title": "Technical Work-Term Report"
    },
    {
        "code": "CHE 480",
        "description": "Development and analysis of process flowsheets and chemical product design. Design and selection of common process equipment such as heat exchangers, pumps, piping, staged separations. Incorporation of pollution prevention and inherently safer design principles. Equipment and project cost estimation.",
        "title": "Process Analysis and Design"
    },
    {
        "code": "CHE 490",
        "description": "A project-based experimental investigation of complex systems in main areas of application of chemical engineering. Topics selected from reaction engineering, separation processes, bioprocess engineering, electrochemical engineering, materials engineering, and process control.",
        "title": "Chemical Engineering Lab 4"
    },
    {
        "code": "CHE 491",
        "description": "Project-based experimental investigation of complex systems in main areas of application of chemical engineering. Topics selected from reaction engineering, separation processes, bioprocess engineering, electrochemical engineering, materials engineering, and process control.",
        "title": "Chemical Engineering Lab 5"
    },
    {
        "code": "CHE 498",
        "description": "Directed research project under the supervision of faculty members. Participation will give students experience in advanced research techniques, with valuable training for those potentially interested in graduate school or industrial research careers. Taken over and above normal course load. Good standing required for registration.",
        "title": "Directed Research Project"
    },
    {
        "code": "CHE 499",
        "description": "A major undergraduate research project carried out as a technical elective (TE) under the supervision of a faculty member. An oral presentation of results and a written report are the minimum requirements. Other requirements may be set by the faculty supervisor or department.",
        "title": "Elective Research Project"
    },
    {
        "code": "CHE 500",
        "description": "Special courses on advanced topics may be offered from time to time, when resources are available. For current offerings, inquire at the CHE undergraduate office.",
        "title": "Special Topics in Chemical Engineering"
    },
    {
        "code": "CHE 514",
        "description": "Fundamentals of surface chemistry, capillary pressure, and wettability. Petrophysics, measurement, and interpretation of electrical, capillary, and flow properties of reservoir rock. Hydrostatic pressure regimes and estimation of oil and gas reserves. Darcy's law and modelling of steady-state and transient incompressible and compressible single-phase flow through porous media. Thermodynamics of petroleum fluids. Material balance for oil and gas reservoirs: subsurface withdrawal and primary production mechanisms. Oil well testing. Two-phase flow in oil reservoirs, relative permeability, Buckley-Leverett theory of linear water flooding and sweep efficiency. Introduction to enhanced oil recovery.",
        "title": "Fundamentals of Petroleum Production"
    },
    {
        "code": "CHE 516",
        "description": "Energy systems in society. Review of fossil fuel reserves, production and consumption trends, including unconventional sources such as shale gas, and oil sands. Transportation fuels and alternative fuels; the design of hybrid power trains, fuel cells and batteries. Design considerations of carbon-free energy generation and carbon-neutral technologies, including nuclear, wind, solar and bio-energy. Design of energy storage on a 'utility scale' and portable power sources. Applications of thermodynamics in the design of energy systems, including the Rankin and Brayton cycles. Other energy system topics as appropriate.",
        "title": "Energy Systems Engineering"
    },
    {
        "code": "CHE 520",
        "description": "An introduction to chemical process modelling and simulation tools. Review of relevant chemical engineering concepts including material/energy balances, thermodynamics of mixtures, and unit operation models. Review of numerical methods for linear/nonlinear equation systems. Overview of numerical methods for thermodynamic, flash, and distillation models. Modular versus equation-oriented process model solution methods, recycle tearing, and partition. Applications including heat exchanger networks, multistage multicomponent separation processes, and chemical reactor networks. Practical skills will be developed through the application of available process simulation software.",
        "title": "Process Modelling and Simulation"
    },
    {
        "code": "CHE 521",
        "description": "An introduction to chemical process optimization. Model development and classification of optimization problems. Linear programming techniques, simplex algorithm, goal programming and barrier method, parametric sensitivity analysis and duality theory. Convex optimization, necessary and sufficient conditions for optimality for unconstrained and constrained problems. Mixed-integer programming. Trajectory optimization. Applications include optimization of heat exchanger networks, multistage separation processes, batch operations, process scheduling and chemical reactor networks.",
        "title": "Process Optimization"
    },
    {
        "code": "CHE 522",
        "description": "State space methods. Sampled-data systems. Discrete systems. Transform methods. Multivariable control. Computer control. Closed-loop analysis. Design of controllers. Control of complex chemical systems.",
        "title": "Advanced Process Dynamics and Control"
    },
    {
        "code": "CHE 524",
        "description": "Experiments on process dynamics, control, and simulation of processes. Time constant; step and frequency response; controller tuning; multivariable control strategies. Implementation using simulation systems, mainframe computer control, microcomputers.",
        "title": "Process Control Laboratory"
    },
    {
        "code": "CHE 541",
        "description": "An introduction to principles governing polymerization reactions and the resultant physical properties of polymers. Molecular weight distribution. Crystallinity. Step-growth and chain-growth polymerization and copolymerization. Selected additional topics in polymer characterization/ properties.",
        "title": "Introduction to Polymer Science and Properties"
    },
    {
        "code": "CHE 543",
        "description": "Overview of polymer production technology and polymer reaction engineering analysis tools. Examples from chain growth polymerization processes (free radical, ionic, living/controlled radical variants, metal co-ordination catalysis, etc.), different modes of polymer reactor operation (batch, semi-batch, continuous flow stirred-tank reactor (CSTR), tubular, trains of CSTRs), homogeneous (bulk/solution/suspension) and heterogeneous (emulsion/dispersion/co-ordinated/etc.), linear and branched/cross-linked chains. Calculations and mathematical models for rate, copolymer composition, molecular weight and sequence length characteristics, for polymer reactor design/optimization of polymer productivity and quality variables.",
        "title": "Polymer Production: Polymer Reaction Engineering"
    },
    {
        "code": "CHE 560",
        "description": "Overview of biomedical engineering principles. Formulation and manufacturing processes for production of nanoparticles for medical applications. Pharmacokinetics, toxicity, and human physiology in drug administration. Route of administration and controlled delivery strategies. Formulation and manufacturing process for drug delivery in the biotechnology and pharmaceutical industries.",
        "title": "Nanomedicine and Nanobiotechnology"
    },
    {
        "code": "CHE 561",
        "description": "The course provides an overview of the recent advances in medicine and nano-technologies for development of tissue engineering and regenerative medicine. Strategies and technologies for designing, testing, and manufacturing of biomaterials and tissue-engineering products will be introduced. The biological and clinical applications will be discussed. The unmet medical needs, challenges in manufacturing, regulatory approval and commercialization for tissue engineering applications will also be discussed.",
        "title": "Biomaterials and Tissue Engineering"
    },
    {
        "code": "CHE 562",
        "description": "Application of process engineering principles to the design and operation of fermentation reactors which are widely used in the pharmaceutical, food, brewing, and waste treatment industries. Aspects of mass transfer, heat transfer, mixing, and rheology with biochemical and biological constraints.",
        "title": "Advanced Bioprocess Engineering"
    },
    {
        "code": "CHE 564",
        "description": "Applications of unsteady and steady state heat and/or mass transfer operations to processing natural and texturized foods. Design and analysis of sterilization, low temperature preservation, concentration, separation and purification processes. Effects of formulation, additives and processing on organoleptic and nutritional quality.",
        "title": "Food Process Engineering"
    },
    {
        "code": "CHE 565",
        "description": "Synthetic biology involves developing new approaches, based on engineering principles, for genetic engineering of biological systems. Students will prepare a comprehensive research proposal for a synthetic biology project of their own design, under the supervision of a faculty member. Attendance at a weekly journal club focused on synthetic biology will be mandatory.",
        "title": "Synthetic Biology Project Design"
    },
    {
        "code": "CHE 571",
        "description": "Industrial ecology is a rapidly growing field that systematically examines local, regional, and global uses and flows of materials and energy in products, processes, industrial sectors, and economies. It focuses on the potential role of industry in reducing environmental burdens throughout the product life cycle from the extraction of raw materials to the production of goods, to the use of those goods and to the management of the resulting wastes. This course will review the environmental issues associated with chemical industries and the roles of engineers to manage these issues. The principles and philosophy of green chemistry will be addressed including pollution prevention in unit operations. The concepts and practices of environmental life cycle analysis and accounting will be addressed in detail, together with the basics of risk assessment, management and communication. ",
        "title": "Industrial Ecology"
    },
    {
        "code": "CHE 572",
        "description": "Nature and sources of air pollutants. Transport of pollutants and dispersion modelling for regulatory purposes. Design of industrial particulate capture systems using cyclones, electrostatic precipitators, filters, scrubbers. Design of organic compound emissions control using incineration, biofiltration, adsorption and absorption. Overview of NOx and SOx control. Indoor air quality assessment techniques.",
        "title": "Air Pollution Control"
    },
    {
        "code": "CHE 574",
        "description": "Primary focus is on the control and treatment of inorganic aqueous waste from chemical process industries. Waste minimization methods with specific examples such as rinsewater circuit design. Principles and design of treatment methods: chemical treatment, precipitation, coagulation and flocculation, ion exchange and membrane separation. Treatment of organic aqueous waste.",
        "title": "Industrial Wastewater Pollution Control"
    },
    {
        "code": "ECE 101A",
        "description": "This course requires a two-page report where students reflect on the experience gained during the first co-op term. Students identify the requirements in their job where they were able to practice engineering, how theory learned in academic terms was applied to solve problems in the work place, and significant contributions they made during their work term. If students did not secure a co-op position, they are to reflect on how they used their time to update their skills. The report template is accessed online and is submitted online.",
        "title": "Work-Term Reflections"
    },
    {
        "code": "ECE 101B",
        "description": "This course requires a two-page report where students reflect on the experience gained during the second co-op term. Students identify the requirements in their job where they were able to practice engineering, how theory learned in academic terms was applied to solve problems in the work place, and significant contributions they made during their work term. If students did not secure a co-op position, they are to reflect on how they used their time to update their skills. The report template is accessed online and is submitted online.",
        "title": "Work-Term Reflections"
    },
    {
        "code": "ECE 101C",
        "description": "This course requires a two-page report where students reflect on the experience gained during the third co-op term. Students identify the requirements in their job where they were able to practice engineering, how theory learned in academic terms was applied to solve problems in the work place, and significant contributions they made during their work term. If students did not secure a co-op position, they are to reflect on how they used their time to update their skills. The report template is accessed online and is submitted online.",
        "title": "Work-Term Reflections"
    },
    {
        "code": "ECE 101D",
        "description": "This course requires a two-page report where students reflect on the experience gained during the fourth co-op term. Students identify the requirements in their job where they were able to practice engineering, how theory learned in academic terms was applied to solve problems in the work place, and significant contributions they made during their work term. If students did not secure a co-op position, they are to reflect on how they used their time to update their skills. The report template is accessed online and is submitted online.",
        "title": "Work-Term Reflections"
    },
    {
        "code": "ECE 101E",
        "description": "This course requires a two-page report where students reflect on the experience gained during the fifth co-op term. Students identify the requirements in their job where they were able to practice engineering, how theory learned in academic terms was applied to solve problems in the work place, and significant contributions they made during their work term. If students did not secure a co-op position, they are to reflect on how they used their time to update their skills. The report template is accessed online and is submitted online.",
        "title": "Work-Term Reflections"
    },
    {
        "code": "ECE 105",
        "description": "Forces in nature and Newton's laws, dynamics and circular motion, work, energy, and conservation of energy. Linear momentum and linear impulse, rotational dynamics. Oscillations; simple harmonic motion. Wave motion; travelling waves and standing waves.",
        "title": "Classical Mechanics"
    },
    {
        "code": "ECE 106",
        "description": "Electrostatics: electric field, flux, Gauss's Law, potential and potential energy. Capacitors: dielectric, capacitance, electric energy storage. Resistors: charge flow, current, resistance. Magnetostatic: magnetic force, magnetic fields, Ampere's Law. Inductors: magnetic flux, inductance, magnetic materials, magnetic energy storage. Time-varying fields: Faraday's Law, mutual inductance, simple motors and generators.",
        "title": "Electricity and Magnetism"
    },
    {
        "code": "ECE 108",
        "description": "Introduction to discrete mathematics, including propositional/Boolean logic, syntax and semantics, proof theory, and model theory; set theory, relations and functions, combinatorics (counting techniques, permutations, and combinations), graph theory. Applications in electrical, computing, and software engineering.",
        "title": "Discrete Mathematics and Logic 1"
    },
    {
        "code": "ECE 109",
        "description": "This course will help students understand the relationship between the microstructure of common semiconductor and optoelectronic materials, and the electrical, optical, and magnetic properties exhibited by the materials. Topics include structure of atoms, models of the atom, electronic configuration, band theory, atomic bonding, dielectric properties, optical transparency, magnetic properties, molecular bonding, metals and alloys, and activation energy.",
        "title": "Materials Chemistry for Engineers"
    },
    {
        "code": "ECE 124",
        "description": "Number systems and Boolean arithmetic. Boolean algebra and simplification of Boolean functions. Combinational circuits. Sequential circuits; design and implementation. Hardware description languages. Timing analysis. Implementation technologies.",
        "title": "Digital Circuits and Systems"
    },
    {
        "code": "ECE 140",
        "description": "Analysis of linear circuits. Voltage, current, resistance, capacitance, inductance, voltage source, current source, dependent sources, Ohm's Law, Kirchhoff's Laws, nodal analysis, mesh analysis, circuit transformations, operational amplifier circuits, time response, sinusoidal steady-state response. Preparing for, conducting, and reporting of laboratory experiments.",
        "title": "Linear Circuits"
    },
    {
        "code": "ECE 150",
        "description": "Software design process in a high-level programming environment. Programming fundamentals, language syntax, simple data types, control constructs, functions, parameter passing, recursion, classes, arrays and lists, list traversals, introduction to searching and sorting algorithms, basic object-oriented design, polymorphism and inheritance, simple testing and debugging strategies, pointers and references, basic memory management.",
        "title": "Fundamentals of Programming"
    },
    {
        "code": "ECE 190",
        "description": "Introduction to electrical and computer engineering with an emphasis on the profession of engineering, and engineering design. Topics include engineering design, safety, risk analysis, engineering data analysis, project management, sustainability, business, entrepreneurship, and intellectual property. Additional topics include co-op fundamentals for engineering students, professional development, and diversity training with a goal of understanding the roles and responsibilities of the professional engineer in society.",
        "title": "Engineering Profession and Practice"
    },
    {
        "code": "ECE 192",
        "description": "This course teaches engineering economics and the impact of engineering on the society at large. Important concepts of engineering economics including cash flow diagrams, present worth, quantification of impact costs, and rate of return analysis are presented. This course discusses real-life engineering cases that cover the above aspects, and provide a broad perspective on the issues. Energy supply scenarios and the environment, global energy use and supply, and environmental impacts of engineering projects are discussed.",
        "title": "Engineering Economics and Impact on Society"
    },
    {
        "code": "ECE 198",
        "description": "A design project integrating content from physics, math, and programming courses. Topics include engineering design process, problem definition, risk analysis, design specification, system modelling and analysis, engineering data analysis, project management, and prototyping. Students work in teams to build and test a prototype. Safety orientation training including WHMIS assessment, is included in this course.",
        "title": "Project Studio"
    },
    {
        "code": "ECE 203",
        "description": "Ensemble model of randomness. Conditional probability, independence, and Bayes' theorem. Random variables, probability distribution functions. Expected values. Collections of random variables, joint and marginal probability distributions, and correlation. Introduction to random processes.",
        "title": "Probability Theory and Statistics 1"
    },
    {
        "code": "ECE 204",
        "description": "Application of computational methods to engineering problems. Number systems, errors and error propagation. Roots of nonlinear equations. Introduction to numerical linear algebra. Interpolation and numerical integration. Introduction to numerical solutions of ordinary differential equations, optimization. Emphasis will be placed on algorithm development.",
        "title": "Numerical Methods"
    },
    {
        "code": "ECE 205",
        "description": "Fourier series. Ordinary differential equations. Laplace transform. Applications to linear electrical systems.",
        "title": "Advanced Calculus 1 for Electrical and Computer Engineers"
    },
    {
        "code": "ECE 206",
        "description": "Triple integrals, cylindrical and spherical polar coordinates. Divergence and curl, applications. Surface integrals, Green's, Gauss' and Stokes' theorems, applications. Complex functions, analytic functions, contour integrals, Cauchy's integral formula, Laurent series, residues.",
        "title": "Adv Calculus 2 for Electrical Engineers"
    },
    {
        "code": "ECE 207",
        "description": "Discrete, continuous and periodic signals, time- and frequency-domain analysis of continuous- and discrete-time linear systems, periodic signals and Fourier series, non-periodic signals, and Fourier transforms.",
        "title": "Signals and Systems"
    },
    {
        "code": "ECE 208",
        "description": "Formal logics, methods, and associated tools, and their uses in specifying, synthesizing, and verifying computing systems. Predicate logic. Temporal logic. Relational logic. Set theory. Proof theory. Model theory. Graph theory. Formal models of computation. Applications in computer and software engineering.",
        "title": "Discrete Mathematics and Logic 2"
    },
    {
        "code": "ECE 222",
        "description": "Computer organization. Memory units, control units, I/O operations. Assembly language programming, translation and loading. Arithmetic logic units. Computer case studies.",
        "title": "Digital Computers"
    },
    {
        "code": "ECE 224",
        "description": "Microprocessor system architecture, bus systems, memory systems, peripherals, parallel interfaces, serial interfaces, analog interfaces, data transfer, synchronization, error detection/correction, testing and debugging.",
        "title": "Embedded Microprocessor Systems"
    },
    {
        "code": "ECE 231",
        "description": "Introduction to the physical principles and electrical behaviour of semiconductor materials and devices; electronic band structure, charge carriers, doping, carrier transport, pn-junctions, metal-oxide-semiconductor capacitors, transistors, and bipolar junction devices.",
        "title": "Semiconductor Physics and Devices"
    },
    {
        "code": "ECE 240",
        "description": "Introduction to electronic signal processing; second-order circuits; operational amplifier circuits; diode device and circuits; metal-oxide-semiconductor (MOS) biasing networks; load-line analysis; diode and MOS small-signal equivalent circuits; single-stage small-signal MOS amplifiers; complementary metal-oxide-semiconductor (CMOS) logic circuits.",
        "title": "Electronic Circuits 1"
    },
    {
        "code": "ECE 250",
        "description": "Data structures, abstract data types, recursive algorithms, algorithm analysis, sorting and searching, and problem-solving strategies.",
        "title": "Algorithms and Data Structures"
    },
    {
        "code": "ECE 252",
        "description": "Processes and threads (pthreads); system calls; concurrency (semaphore, mutex, monitors, and barrier synchronization); user-level memory management. Performance and correctness of concurrent systems. Deadlock detection and recovery; file systems.",
        "title": "Systems Programming and Concurrency"
    },
    {
        "code": "ECE 260",
        "description": "Power systems and their fundamental components and models. Introduction to the principles of electromechanical energy conversion, including transformers and rotating machines, in particular (direct current) dc, induction and synchronous machines.",
        "title": "Electromechanical Energy Conversion"
    },
    {
        "code": "ECE 298",
        "description": "Practical aspects of analog and digital instrumentation. Prototyping such as printed circuit board design and manufacture.",
        "title": "Instrumentation and Prototyping Laboratory"
    },
    {
        "code": "ECE 305",
        "description": "Introduction to quantization, wave-particle duality, and the uncertainty principle. The Schroedinger equation and solvable examples. Topics include stationary states of particle- in-a-box, harmonic oscillator, and the hydrogen atom. Quantization of angular momentum and spin. Introduction to approximation methods including time-independent perturbation theory. Modern applications of quantum mechanics.",
        "title": "Introduction to Quantum Mechanics"
    },
    {
        "code": "ECE 307",
        "description": "This course provides in depth knowledge of statistics motivated by electrical and computer engineering applications. Use of modern statistical software tools is introduced. Topics include sufficient statistics, exponential families, hypothesis testing, error estimation, confidence intervals, chi-square tests, analysis of variance, regression, correlation, decision theory, and Bayesian and non-Bayesian statistics.",
        "title": "Probability Theory and Statistics 2"
    },
    {
        "code": "ECE 313",
        "description": "Fourier representations in discrete and continuous time. Discrete Fourier transform and fast Fourier transform algorithms. Sampling theory. Sampling and quantization errors. Transform analysis of linear time-invariant systems. Filter design. Discrete Hilbert transform. Introduction to filter banks and discrete wavelet transform.",
        "title": "Digital Signal Processing"
    },
    {
        "code": "ECE 318",
        "description": "Introduction to random processes, power spectral density. Thermal noise and the white noise model. Amplitude and angle modulation, generation and detection schemes. Sampling and reconstruction, quantization. Digital baseband transmission. Overview of digital passband communications.",
        "title": "Communication Systems"
    },
    {
        "code": "ECE 320",
        "description": "Organization and performance of uniprocessors, pipelined processors, dynamically scheduled processors, parallel processors and multiprocessors; memory and cache structures; multiprocessor algorithms and synchronization techniques; special-purpose architectures.",
        "title": "Computer Architecture"
    },
    {
        "code": "ECE 327",
        "description": "Design and modelling of digital hardware systems using a hardware description language. Development process. Impact of implementation technologies. Performance analysis and optimization. Functional verification. Timing analysis. Power analysis and optimization. Faults and testability. Reliability and fault tolerance.",
        "title": "Digital Hardware Systems"
    },
    {
        "code": "ECE 331",
        "description": "Review of band theory and doped semiconductors in thermal equilibrium, charge neutrality, mass action law, recombination and transport mechanisms, Boltzmann relations. Device theory and modelling of p-n junction diode and derivation of dc and ac characteristics, charge storage effects. Principles, device theory, and modelling of metal-oxide semiconductor field-effect transistors (MOSFETs), and the derivation of threshold voltage, dc current characteristics, small signal ac models. Principles of bipolar transistor and derivation of dc and ac terminal characteristics, equivalent circuits.",
        "title": "Electronic Devices"
    },
    {
        "code": "ECE 340",
        "description": "Electronic circuits and their limitations including, metal-oxide-semiconductor (MOS) and bipolar junction transistor (BJT) differential pairs, biasing, the cascode configuration and active loads. Differential and multistage amplifiers. Feedback, stability, and compensation.",
        "title": "Electronic Circuits 2"
    },
    {
        "code": "ECE 350",
        "description": "Memory and virtual memory and caching; I/O devices, drivers, and permanent storage management; process scheduling; queue management in the kernel; real-time kernel development. Aspects of multi-core operating systems.",
        "title": "Real-Time Operating Systems"
    },
    {
        "code": "ECE 351",
        "description": "Programming paradigms, compilation, interpretation, virtual machines. Lexical analysis, regular expressions, and finite automata. Parsing, context-free grammars, and push-down automata. Semantic analysis, scope and name analysis, type checking. Intermediate representations. Control flow. Data types and storage management. Code generation.",
        "title": "Compilers"
    },
    {
        "code": "ECE 356",
        "description": "Data models, file systems, database system architectures, query languages, integrity and security, database design.",
        "title": "Database Systems"
    },
    {
        "code": "ECE 358",
        "description": "This course is a comprehensive introduction to computer networks. The focus is on the concepts, the protocols, and the fundamental design principles that have contributed to the success of the internet. Topics include history of the Internet, transmission media and technologies, switching and multiplexing, protocols and layering, wired and wireless LAN (local-area networks), congestion/flow/error control, routing, addressing, internetworking (Internet) including TCP (transmission control protocol).",
        "title": "Computer Networks"
    },
    {
        "code": "ECE 360",
        "description": "Fundamentals of power systems, analysis techniques including power flow and symmetrical fault analyses, and the basics of distribution systems and smart grids.",
        "title": "Power Systems and Smart Grids"
    },
    {
        "code": "ECE 373",
        "description": "Review of transmission line and scattering matrix representation of radiofrequency (RF) circuits, multiport RF networks, modern RF and microwave planar technology, lumped and distributed microstrip circuits, microwave couplers, Hybrids, resonators, filters, Low-noise amplifiers (LNAs), RF oscillators and mixers, computer-aided design (CAD) tools for RF circuits, hybrid and monolithic RF circuits.",
        "title": "Radio Frequency and Microwave Circuits"
    },
    {
        "code": "ECE 375",
        "description": "Maxwell's equations; plane waves; time-harmonic fields; waves at planar boundaries; boundary conditions; reflection and transmission; transmission lines; electric fields in matter; magnetic fields in matter.",
        "title": "Electromagnetic Fields and Waves"
    },
    {
        "code": "ECE 380",
        "description": "Introduction to control systems. Advantages of closed-loop feedback systems. The role of the system mathematical model. Block diagrams and signal flow graphs. The basic control system design problem, stability in control systems. Frequency response analysis techniques. Root-locus analysis. Elementary lead-lag compensation.",
        "title": "Analog Control Systems"
    },
    {
        "code": "ECE 403",
        "description": "Temperature and thermodynamic equilibrium. Work, internal energy and heat; first law, with examples. Kinetic theory of gases. Basic probability theory. Microscopic states and entropy. Absolute temperature, reversibility and the second law. Thermodynamic Functions and Maxwell's relations. Phase transitions. Third Law. Other applications of thermodynamics.",
        "title": "Thermal Physics"
    },
    {
        "code": "ECE 404",
        "description": "Electromagnetic waves and the nature of light. Geometrical optics, aberrations. Physical optics: interference, Fraunhofer and Fresnel diffraction, polarization. Optical instruments.",
        "title": "Geometrical and Physical Optics"
    },
    {
        "code": "ECE 405A",
        "description": "This course introduces physical implementations of quantum computers with an emphasis on common and connecting themes. The course topics include the review of quantum mechanics, criteria to build quantum computers, quantum circuit models, and four quantum hardware platforms (nuclear magnetic resonance, optical photons, trapped ions, and superconducting systems) in terms of qubit definition, universal gate sets, initialization, measurement strategies, and decoherence processes.",
        "title": "Quantum Information Processing Devices"
    },
    {
        "code": "ECE 405B",
        "description": "This course introduces basic experimental tools and techniques on which the main quantum computing platforms are based. The course topics will be covered through lectures and through hands-on lab experiments and will include photon generation and detection; Rabi oscillations, coherence, and NMR; atom cooling and ion traps; low temperature physics; and Bell inequalities and two-qubit quantum tomography.",
        "title": "Fundamentals of Experimental Quantum Information"
    },
    {
        "code": "ECE 405C",
        "description": "The course will teach basic elements to create quantum circuits in quantum computers: qubits, single-qubit gates, two-qubit gates, quantum operators, and measurements. A quantum programming language (one of three: Qiskit, q#, Pennylane) is used to implement representative quantum circuits in quantum simulators or real quantum computers through a cloud service such as IBM Q experience or Microsoft Azure or Xanadu.",
        "title": "Programming of Quantum Computing Algorithms"
    },
    {
        "code": "ECE 405D",
        "description": "This course offers applications of superconductivity in quantum information devices and circuits at microwave frequencies. Introducing the basic physics of superconductivity, superconducting transmission lines and cavity resonators are presented as the elementary passive components in quantum circuits. Josephson junctions as an active element in superconducting electronics is introduced and it is shown how a qubit can be constructed based on various two-level system manipulated in Josephson junctions. Three superconducting qubit archetypes, i.e. charge, flux and phase, are introduced along with some hybrid qubits such as transmon and fluxonium. Single qubit operation and qubit coupling in the form of circuit cavity electrodynamics and their associated qubit readout are discussed. Some existing quantum computers such as IBM Q System One and Google Sycamore are briefly introduced.",
        "title": "Superconducting Quantum Circuits"
    },
    {
        "code": "ECE 406",
        "description": "Design and analysis of efficient, correct algorithms. Advanced data structures, divide-and-conquer algorithms, recurrences, greedy algorithms, dynamic programming, graph algorithms, search and backtrack, inherently hard and unsolvable problems, approximation and randomized algorithms, and amortized analysis.",
        "title": "Algorithm Design and Analysis"
    },
    {
        "code": "ECE 409",
        "description": "Introduction to cryptology and computer security, theory of secure communications, points of attack, conventional cryptographic systems, public key cryptographic systems, standards, firewalls, wireless system security, applications.",
        "title": "Cryptography and System Security"
    },
    {
        "code": "ECE 414",
        "description": "Overview of wireless communications including standards. Characterization of mobile radio propagation channels. Signal representations. Transmission and reception techniques for wireless channels. Fundamentals of cellular communications and multiple-access schemes.",
        "title": "Wireless Communications"
    },
    {
        "code": "ECE 416",
        "description": "This course introduces advanced topics in networking with a focus on applications and wireless technologies. Topics include: cellular networks (2G, 3G, 4G and beyond), applications (Domain Name System [DNS], Simple Mail Transfer Protocol [SMTP], Post Office Protocol [POP], Internet Message Access Protocol [IMAP], Hypertext Transfer Protocol [HTTP]) and socket programming, Content-centric networks (content delivery networks, peer-to-peer protocols, data centers, etc.), protocols for multimedia applications (Session Initiation Protocol [SIP], Real-time Transport Protocol [RTP], RTP Control Protocol [RTCP]), emerging technologies (Internet of Things, sensors, software defined networks), policy issues (network neutrality, who controls the Internet?).",
        "title": "Advanced Topics in Networking"
    },
    {
        "code": "ECE 417",
        "description": "This course introduces the basic theories and methodologies of digital image processing. Topics include intensity transformations for image enhancement, two-dimensional discrete Fourier transform, spatial and frequency domain linear image filtering, nonlinear image filtering, binary image processing, edge detection, image segmentation, and digital video processing basics.",
        "title": "Image Processing"
    },
    {
        "code": "ECE 423",
        "description": "Specification and design of embedded systems, specification languages, hardware/software co-design, performance estimation, co-simulation, verification, validation, embedded architectures, processor architectures and software synthesis, system-on-a-chip paradigm, retargetable code generation and optimization, verification and validation, environmental issues and considerations.",
        "title": "Embedded Computer Systems"
    },
    {
        "code": "ECE 432",
        "description": "An introduction to the theory and practice of Radio Frequency (RF) Integrated Circuit design. Physics and modelling of RF integrated components such as resistor, inductor, capacitor (RLC) passives, diodes, metal oxide semiconductor field-effect transistors (MOSFETs), high electron mobility transistors, hetero-junction bipolar transistors. RF integrated components properties and representation such as short channel effects, noise parameters, transit frequency (ft), maximum frequency of oscillation (fmax), and quality factor.",
        "title": "Radio Frequency Integrated Devices and Circuits"
    },
    {
        "code": "ECE 433",
        "description": "Processes for micro and nanoelectronic fabrication. Semiconductor crystal growth. Thin films by chemical and physical vapor deposition. Epitaxial growth. Plasma-assisted and wet-chemical etch processes. Nano-structured material synthesis. Junction formation. Dielectric layer growth. Photolithography. Patterning on the nano-scale. Fabrication processes for transistors, complementary metal-oxide semiconductor (CMOS), and thin film devices. Micro-electro-mechanical systems (MEMS) technology. Process techniques for nanoelectronic devices.",
        "title": "Fabrication Technologies for Micro and Nano Devices"
    },
    {
        "code": "ECE 444",
        "description": "Analog electronics exploits the physical behaviour of electronic devices to create electronic systems. The performance of single and multiple transistor amplifying stages are studied. Followed by a study of biasing, current mirror, and output stages, which are then combined in the study of operational amplifier circuits. Frequency response and feedback are then reviewed leading to a detailed study of stability and compensation for multistage and operational amplifiers. The course finishes with a look at selected topics from A/D (analog-to-digital) converters, oscillators, and phase-locked loops.",
        "title": "Integrated Analog Electronics"
    },
    {
        "code": "ECE 445",
        "description": "Review of the Metal-Oxide Semiconductor (MOS) transistor: Static and dynamic behaviour, short channel effects, scaling trends, Simulation Program with Integrated Circuit Emphasis (SPICE) models. Complementary Metal-Oxide Semiconductor (CMOS) inverter; combinational CMOS circuit design - logic styles for low power, high performance circuits; sequential CMOS circuit design - flip-flops, pipelines, Schmitt trigger; CMOS arithmetic circuits; interconnect parasitic; clocking and timing considerations in digital Very Large Scale Integration (VLSIs).",
        "title": "Integrated Digital Electronics"
    },
    {
        "code": "ECE 451",
        "description": "Introduces students to the requirements definition phase of software development. Models, notations, and processes for software requirements identification, representation, analysis, and validation. Cost estimation from early documents and specifications.",
        "title": "Software Requirements Specification and Analysis"
    },
    {
        "code": "ECE 452",
        "description": "Introduces students to the design, implementation, and evolution phases of software development. Software design processes, methods, and notation. Implementation of designs. Evolution of designs and implementations. Management of design activities.",
        "title": "Software Design and Architectures"
    },
    {
        "code": "ECE 453",
        "description": "Introduces students to systematic testing of software systems. Software verification, reviews, metrics, quality assurance, and prediction of software reliability and availability. Related management issues.",
        "title": "Software Testing, Quality Assurance, and Maintenance"
    },
    {
        "code": "ECE 454",
        "description": "Principles of distributed computing; architectures and middleware; servers, processes, and virtualization; upper-layer network protocols, interprocess communication and remote procedure calling; concurrency, synchronization and distributed algorithms, dependable distributed systems and fault tolerance.",
        "title": "Distributed Computing"
    },
    {
        "code": "ECE 455",
        "description": "Concepts, theory, tools, and practice to understand, design, and write embedded software. This course covers computing elements, structures in embedded software, resource access protocols, uniprocessor scheduling, programming-language support, languages for MDD (model-driven development), worst-case execution time analysis, and overview of embedded distributed systems.",
        "title": "Embedded Software"
    },
    {
        "code": "ECE 457A",
        "description": "The course starts by addressing the ill-structured problems and need for computational intelligence methods. It introduces the concepts of heuristics and their use in conjunction with search methods, solving problems using heuristics and metaheuristics, constraints satisfaction. The course also introduces the concepts of co-operation and adaptations and how they are influencing new methods for solving complex problems. The course starts by illustrating how the concepts of co-operation and adaptation are manifested in nature and how such models are inspiring new types of solutions methods. Topics to be covered include search algorithms, game playing, constraints satisfaction, meta-heuristics, evolutionary computing methods, swarm intelligence, ant-colony algorithms, particle swarm methods, adaptive and learning algorithms and the use of these algorithms in solving continuous and discrete problems that arise in engineering applications.",
        "title": "Co-operative and Adaptive Algorithms"
    },
    {
        "code": "ECE 457B",
        "description": "Fundamentals and recent advances in computational intelligence. Building accurate models with collected data or rules bases. Model-based prediction and classification. Concepts in machine learning, supervised and unsupervised learning, artificial neural networks, deep learning, feature extraction, feature selection, dimensionality reduction, classification and clustering, support vector machines. Approximate reasoning based on fuzzy set theory. Performance metrics to assess the validity of produced models. Multiple examples and case studies such as autonomous driving, intelligent manufacturing, natural language understanding, speech recognition, computer vision, stock market prediction, disease early detection and diagnosis.",
        "title": "Fundamentals of Computational Intelligence"
    },
    {
        "code": "ECE 457C",
        "description": "Introduction to reinforcement learning (RL) theory and algorithms for learning decision-making policies in situations with uncertainty and limited information. Topics include Markov decision processes, classic exact/approximate RL algorithms such as value/policy iteration, Q-learning, State-action-reward-state-action (SARSA), Temporal Difference (TD) methods, policy gradients, actor-critic, and Deep RL such as Deep Q-Learning (DQN), Asynchronous Advantage Actor Critic (A3C), and Deep Deterministic Policy Gradient (DDPG).",
        "title": "Reinforcement Learning"
    },
    {
        "code": "ECE 458",
        "description": "Introduction to computer security. Models of security. Elementary cryptography. Software security, vulnerabilities, threats, defenses, and secure-software development processes. Threats to networks and defenses. Security issues at the application layer. Secure design principles, techniques, and security evaluation. Privacy, ethics, and legal issues.",
        "title": "Computer Security"
    },
    {
        "code": "ECE 459",
        "description": "Profiling computer systems; bottlenecks, Amdahl's law. Concurrency: threads and locks. Techniques for programming multicore processors; cache consistency. Transactional memory. Streaming architectures, vectorization, and SIMD. High-performance programming languages.",
        "title": "Programming for Performance"
    },
    {
        "code": "ECE 462",
        "description": "This course provides the students an understanding of the operation, analysis, and design of electric power distribution systems, starting with estimation of the loads on the network to the detail design of the distribution system networks. The primary objective of the course is to provide students with the skills to understand the analytical and design methods and modern tools for solution of problems associated with electric distribution system engineering.",
        "title": "Electrical Distribution Systems"
    },
    {
        "code": "ECE 463",
        "description": "Principles of power conditioning. Switching characteristics of power semiconductor devices. Computer simulation of power electronic circuits. Analysis, design, and applications of power converters.",
        "title": "Design and Applications of Power Electronic Converters"
    },
    {
        "code": "ECE 464",
        "description": "The course provides the fundamentals concepts of generation and measurements of high voltage ac, dc, and impulses. Briefly introduces the students to basic conduction and breakdown mechanisms of insulating materials. The scope of this course also includes understanding the basic protection system, studying the principles for protecting different elements and studying different technologies used in designing protective relays. Exposure to several state-of-art high voltage testing techniques of power system components will ensure that students have knowledge of the industrial solutions to the management of the problems associated with overvoltage and the protection mechanisms used.",
        "title": "High Voltage Engineering and Power System Protection"
    },
    {
        "code": "ECE 467",
        "description": "This course provides a basic understanding of the main issues relevant to the operation, analysis, and management of power grids, and gives an introduction to the functioning of electricity markets. The course covers the following main technical and economic issues relevant to system operators, utilities and analysts: power system economic operations; short-term operation of power systems; power flow; introduction to optimal power flows; overview of electricity markets; fault calculations; and basic concepts in power system stability and control.",
        "title": "Power Systems Analysis, Operations, and Markets"
    },
    {
        "code": "ECE 474",
        "description": "Modern transmitter and receiver architectures, Noise and linearity in radio and wireless systems, Design considerations of RF/microwave subsystems, radio and wireless system designs, CAD tools for radio and wireless systems, Antennas, Radio wave propagation models, Indoor radio, Satellite communication, Personal communication systems (PCSs).",
        "title": "Radio and Wireless Systems"
    },
    {
        "code": "ECE 475",
        "description": "Review of Maxwell's equations and uniform plane waves. Electromagnetic wave propagation, reflection and transmission through different uniform media, metallic waveguides, multilayer structures, radiation theory, transmitting and receiving antenna, antenna arrays and applications, simple radio-wave propagation models, radio transmission systems and wireless networks.",
        "title": "Radio-Wave Systems"
    },
    {
        "code": "ECE 477",
        "description": "Review of Maxwell's equations and electromagnetic plane waves, dielectric waveguides, optical fibers, lasers and photonic transmitters, photodetectors and photonic receivers, optical amplifiers, and photonic systems and networks.",
        "title": "Photonic Devices and Systems"
    },
    {
        "code": "ECE 481",
        "description": "Performance specifications for design. Dynamic system modelling and basic system identification. Dealing with basic nonlinear effects. Sampled data systems. Discrete-time system stability and dynamic performance. Digital control system design: emulation methods, z-domain, frequency domain, pole placement. Implementation of digital controllers.",
        "title": "Digital Control Systems"
    },
    {
        "code": "ECE 484",
        "description": "Dynamic system modelling: linear, nonlinear, state-space, sample data systems, computer simulation, system identification. Discrete system stability and dynamic performance. Nonlinear system analysis, limit cycles. Digital control system design: emulation methods, z-domain, frequency domain, pole placement. Implementation of digital controllers. Laboratory projects in computer control of mechatronic and other systems.",
        "title": "Digital Control Applications"
    },
    {
        "code": "ECE 486",
        "description": "Introduction to the study of robotics focusing on the mechanics and control of serial manipulators. Topics include rigid body motion, forward and inverse kinematics, differential kinematics, forward and inverse dynamics, trajectory generation, motion planning, and feedback control.",
        "title": "Robot Dynamics and Control"
    },
    {
        "code": "ECE 488",
        "description": "Review of feedback control design fundamentals; SISO controller parameterizations; the fundamental effect of MIMO interaction; introduction to state-space models in continuous and discrete time; SISO techniques for MIMO design; optimal control; model-predictive control design; state estimation; decoupling, MIMO PID control design; applications in areas such as aerospace systems.",
        "title": "Multivariable Control Systems"
    },
    {
        "code": "ECE 493",
        "description": "Special courses on advanced topics will be offered from time to time, when resources are available. For current offerings, inquire at the ECE Undergraduate Office or check the ECE website.",
        "title": "Special Topics in Electrical and Computer Engineering"
    },
    {
        "code": "ECE 495",
        "description": "Autonomous driving system overview; computer vision basics, deep learning for perception, motion modelling and state estimation, localization and mapping, object tracking, behavioral planning and reinforcement learning, path planning and vehicle control, safety and verification and validation, adoption and impact.",
        "title": "Autonomous Vehicles"
    },
    {
        "code": "ECE 499",
        "description": "An engineering project requiring the student to demonstrate initiative and assume responsibility. The student will arrange for a faculty supervisor prior to registration. Students can propose their own topic. A project report is required at the end of the term.",
        "title": "Engineering Project"
    },
    {
        "code": "ENVE 100",
        "description": "An introduction to the fundamental methods, principles and skills of environmental and geological engineering. Fundamentals of technical communication, the engineering design process and problem solving. Completion of a pre-design study and report for an environmental engineering project. Independent and team work. Fundamentals of engineering computation units, data collection, measurement, and error analysis. Field surveying (automatic level, engineer's transit, differential global positioning system (GPS), total station). Laboratory on engineering graphics auto-computer assisted diagnosis (AutoCAD) and computational software (Excel, Matlab). Aspects of the engineering profession (code of ethics, negligence, misconduct, role of the Professional Engineers Ontario (PEO), etc.), diversity in the workplace, and professional development. Preparation for the University of Waterloo co-operative education program (Co-operative and Experiential Education, rsum writing, job search, and interview skills).",
        "title": "Environmental and Geological Engineering Concepts"
    },
    {
        "code": "ENVE 115",
        "description": "Linear systems of equations, matrices, and determinants. Introduction to the eigenvalue problem. Applications.",
        "title": "Linear Algebra"
    },
    {
        "code": "ENVE 121",
        "description": "Introduction to computer programming, examples of efficient numerical algorithms for basic scientific computations. Programming and problem solving concepts introduced in the course will be incorporated into group projects involving civil, environmental, or geological engineering applications. The language of instruction will be Matlab.",
        "title": "Computational Methods"
    },
    {
        "code": "ENVE 123",
        "description": "Charge, current, and voltage. Voltage and current sources, resistors, capacitors, and inductors. Ohm's Law, Kirchhoff's Laws, nodal analysis, instrumentation amplifier circuits, impedance. Function and characteristics of basic electrical transducers. Resolution, precision, and accuracy. Basics of data acquisition.",
        "title": "Electrical Circuits and Instrumentation"
    },
    {
        "code": "ENVE 153",
        "description": "This course studies earth materials and processes from an engineering point of view through case histories and problem sets. The course develops a geological knowledge for applications to any physical environment and provides an appreciation of the impact of engineering work on the environment. Topics include mineral and rock identification, the rock cycle, structural geology and tectonics, geology of Canada, effects of water, ice and wind. Students are also introduced to the concept of geologic time, topographic and geologic maps, and the basic principles and tools used to determine geologic history.",
        "title": "Earth Engineering"
    },
    {
        "code": "ENVE 175",
        "description": "Chemical principles with applications in natural environments and environmental engineering systems. Properties of the atmosphere and hydrosphere. Chemical reactions and stochiometric calculations. Reaction kinetics and equilibria in dilute solutions. Oxidation-reduction reactions.",
        "title": "Introduction to Environmental Chemistry"
    },
    {
        "code": "ENVE 176",
        "description": "Introduction to microbial biology and technologies used to characterize it. Topics include cell structure and function, cultivation methods, genetics, phylogeny and taxonomy, metabolic and genetic diversity, genomics, bioinformatics, and pathogenesis.",
        "title": "Microbial Biology for Environmental Engineers"
    },
    {
        "code": "ENVE 200",
        "description": "Development of design and communication expertise through projects involving various environmental engineering systems. Exposure to energy, air, water, and waste management systems. Emphasis placed on critical evaluation, problem solving, and design synthesis. Introduction to geographic information systems (GIS), sustainability analysis, and climate change mitigation and adaptation.",
        "title": "Sustainability Analysis and Solutions"
    },
    {
        "code": "ENVE 223",
        "description": "An introduction to ordinary differential equations with applications to mass and energy balance problems in engineering. Standard methods of solution of first and second order linear equations with constant coefficients. Numerical methods for solving ordinary differential equations. Partial differential equations.",
        "title": "Differential Equations and Balance Laws"
    },
    {
        "code": "ENVE 224",
        "description": "Role of probability in engineering and decision-making under uncertainty. Basic probability concepts. Probability distributions. Functions of random variables. Data analysis. Confidence intervals and hypothesis testing. Introduction to regression analysis. Introduction to design of experiments and statistical quality control.",
        "title": "Probability and Statistics"
    },
    {
        "code": "ENVE 225",
        "description": "Modelling of environmental engineering processes via the solution of differential equations. Mass transfer processes in continuum and discrete systems, with applications to natural and engineered systems. Reactor theory. Understanding initial and boundary conditions. Classical and numerical solution techniques for solving differential equations. Volume and surface integration. Reynolds transport theorem.",
        "title": "Environmental Modelling"
    },
    {
        "code": "ENVE 275",
        "description": "Overview of principles of equilibrium chemistry in aquatic systems, both in the natural environment and in contaminated water treatment processes. Composition of water. Electroneutrality and activity. Chemical thermodynamics. Acid-base equilibria concepts, including solution pH, titration, buffering intensity, and alkalinity. Metal complexation, dissolution, and precipitation reactions in natural and engineered systems. Redox reactions and pE-pH diagrams in aerobic and anaerobic environments.",
        "title": "Aquatic Chemistry"
    },
    {
        "code": "ENVE 277",
        "description": "Quantitative introduction to indoor and outdoor air pollution sources, and major processes including emission rates, atmospheric dispersion, chemistry, and deposition. Air quality standards and regulations. Basic atmospheric science and meteorology to support the fate and transport of air pollutants. Overview of control and treatment methods. Indoor air exposure estimates and the function of the HVAC components.",
        "title": "Air Quality Engineering"
    },
    {
        "code": "ENVE 279",
        "description": "Conservation of energy, energy balances on closed systems. Steady-state and transient heat transfer via convection, radiation, and conduction. Mechanical and electrical work. Internal energy, enthalpy, and specific heats of solids, liquids and gases. Phase change in natural environmental systems; The basics of heat engines, refrigerators, and heat pumps. Function, evaluation, and design of energy resource technology: wind and hydroelectric turbines, photovoltaics, geothermal energy, biomass and biofuel, natural gas and petroleum extraction, and tidal energy. Renewable energy policy and implications.",
        "title": "Energy and the Environment"
    },
    {
        "code": "ENVE 280",
        "description": "An introduction to fluid mechanics. Fluid properties. Review of fluid statics. Buoyancy. Bernoulli equation. The momentum equation and applications. Laminar and turbulent flow. Dimensionless numbers. Closed conduit flow including friction losses. Pipe network analysis including energy losses and efficiencies. Four lab sessions.",
        "title": "Fluid Mechanics"
    },
    {
        "code": "ENVE 330",
        "description": "An introduction to the fundamental concepts of physical and chemical measurement of the environment. Review of basic statistics, quality assurance and control, sources of error, seasonal effects, sample preservation. Practical and essential elements of water, soil and air sampling. Introduction to measurement techniques including: colorimetry, chromatography, spectroscopy, electrochemical probes, remote sensing. Design of monitoring strategies, and use of methods to assess validity of laboratory data.",
        "title": "Lab Analysis and Field Sampling Techniques"
    },
    {
        "code": "ENVE 335",
        "description": "Decision-making, optimization, and assessment of environmental and water resource systems, and the design process in environmental engineering. Multi-criteria decision-making methods for concept and embodiment engineering design phases. Risk-based system performance metrics and trend tests. Uncertainty estimation via First-Order Uncertainty Analysis and Monte Carlo Simulation. Formulation and solution of linear, integer, and nonlinear optimization models. Multi-objective optimization methods. Sensitivity analysis for decision-making and descriptive (numerical) models.",
        "title": "Decision Making for Environmental Engineers"
    },
    {
        "code": "ENVE 375",
        "description": "Fundamentals of coagulation, flocculation, clarification, sedimentation, filtration, adsorption, air stripping, membrane technologies, chemical reduction/oxidation, and disinfection processes with applications to natural and various engineered systems. Quantitative analysis and design of processes and applications to the treatment of drinking water, wastewater, stormwater, groundwater, and soils.",
        "title": "Physico-Chemical Processes"
    },
    {
        "code": "ENVE 376",
        "description": "Common microbial substrates and metabolisms in engineered and natural systems, kinetics of microbial growth, stoichiometry of nutrient uptake, continuous flow stirred tanks with/without recycle, aeration system design, applications to wastewater treatment, solid waste management, groundwater, and soil remediation.",
        "title": "Biological Processes"
    },
    {
        "code": "ENVE 382",
        "description": "Introduction to the water cycle, flood frequency analysis, design storms. Analysis of hydrographs and rainfall-runoff response mechanisms in urban and natural systems. Mass continuity and water budgets at the watershed scale. Impact of land use change on hydrologic response. Quantification of open channel flow; subcritical and supercritical flow regimes. Dynamic forces on submerged structures and low/scour beneath bridges.",
        "title": "Hydrology and Open Channel Flow"
    },
    {
        "code": "ENVE 383",
        "description": "Mathematical models of watershed hydrology for estimation of streamflow and other water balance components. Pre- and post-processing of hydrometeorological data; quantitative description of hydrologic processes such as snowmelt, evaporation, and routing; assessment of model performance; parameterization, application, and calibration of models. Interpreting model assumptions, modelling choices, and uncertainty in natural and managed watersheds. Modern hydrologic modelling software will be used.",
        "title": "Hydrologic Modelling"
    },
    {
        "code": "ENVE 391",
        "description": "Philosophy of environmental controls; introduction to national and international regulatory structures relevant to industrial planning, emissions control, environmental impact assessment, occupational health; stance of government, industry and community pressure groups. Contract law. Professional ethics, including the social responsibility of engineers, conflicts of interest.",
        "title": "Law and Ethics for Environmental and Geological Engineers"
    },
    {
        "code": "ENVE 392",
        "description": "Project financing, life-cycle cost analysis, time value of money, sensitivity analyses, tax, financial implications of infrastructure projects, quantitative decision-making, financial aspects of a business plan.",
        "title": "Economics and Life Cycle Cost Analysis"
    },
    {
        "code": "ENVE 481",
        "description": "Physical and mathematical models of river processes at the landscape scale, and hydraulic responses in channels. Analysis of gradually varied flow profiles, energy losses around infrastructure (bridges and culverts), and floodplain mapping. Calculation of flood propagation along river channels, estimating scour and erosion around infrastructure, and an introduction to sediment transport. An introduction to river mixing and contaminant transport.",
        "title": "Open Channel Hydraulics"
    },
    {
        "code": "ENVE 495",
        "description": "A special topics course on design intensive advanced topics in environmental engineering is offered from time to time, when resources are available. For the current offering, inquire at the Department.",
        "title": "Design Intensive Special Topics in Environmental Engineering"
    },
    {
        "code": "ENVE 497",
        "description": "A special topics course on advanced topics in environmental engineering is offered from time to time, when resources are available. For the current offering, inquire at the Department.",
        "title": "Special Topics in Environmental Engineering"
    },
    {
        "code": "ENVE 573",
        "description": "Importance and complications associated with environmental modelling, the model building process, limitations, and measures of success. Types of contaminants; transport phenomena with a focus on advection-dispersive transport; development of governing equations; types and utility of boundary and initial conditions; and mass balance considerations. Review of completely mixed systems including lakes, streams, source functions, feedback systems, and toxic substance models. Model calibration, sensitivity, and uncertainty; methods and approaches. Solute transport models and solution techniques including random walk, method of characteristics, finite difference method and finite volume method. Aspects of multiphase flow (gas/water and NAPL/water systems) with an emphasis on groundwater problems. Introduction to mass removal technologies for remediation of soil and groundwater systems.",
        "title": "Contaminant Transport"
    },
    {
        "code": "ENVE 577",
        "description": "The engineering aspects of solid waste management are examined. Attention is given to the engineering design and operational aspects of the control of generation, storage, collection, transfer and transport, processing and disposal of solid wastes in landfill site. Design of natural attenuation sites and system reliability features for landfill designs.",
        "title": "Engineering for Solid Waste Management"
    },
    {
        "code": "ENVE 583",
        "description": "Design of water supply and distribution systems. Design of waste and storm water collection systems. Storm water management. The course consists of 24 hours of lectures and a subdivision design project. The emphasis is on computer aided design and sustainability, using commonly used software packages.",
        "title": "Design of Urban Water Systems"
    },
    {
        "code": "ENVE 585",
        "description": "This course introduces air quality, design of engineering solutions, and associated health and economic impacts. It includes topics focused on the indoor environment, the outdoor environment, or both, such as air pollution sources, emission estimation, control strategies, measurement, modelling methods, health impact assessment, cost-benefit analysis, technical policy analysis, and co-impacts with climate change.",
        "title": "Air Quality Engineering and Impacts"
    },
    {
        "code": "GENE 101",
        "description": "The goal for this course is to help students become successful independent learners through learned study skills, a better understanding of their personality type, and an understanding of how personal wellness affects academic success. It takes a modelled approach to teaching learning strategies to students who struggle to meet the demands of a university curriculum. In the lectures, students will be taught various learning strategies that they will be able to apply to successfully meet the demands of their other courses. Students will then apply these modelled strategies in their other courses during a weekly application lab. Students will be expected to demonstrate their understanding of the material through a variety of assignments. The course will include an engineering component.",
        "title": "Strategies and Skills for Academic Success"
    },
    {
        "code": "GENE 123",
        "description": "Charge, current, and voltage. Voltage and current sources, resistors, capacitors, and inductors. Ohm's Law, Kirchhoff's Laws, nodal analysis, Thevenin and Norton models, instrumentation amplifier circuits, time response, impedance. Function and characteristics of basic electrical transducers. Resolution, precision, and accuracy. Basics of data acquisition.",
        "title": "Electrical Circuits and Instrumentation"
    },
    {
        "code": "GENE 199",
        "description": "Various courses dealing with selected topics of particular interest to first-year engineering students. These courses will be offered as resources are available and the material is needed.",
        "title": "Special Topics in First-Year Engineering"
    },
    {
        "code": "GENE 298",
        "description": "Various courses dealing with selected complementary studies topics of particular interest to engineering students. These courses will be offered as resources are available and the material is needed.",
        "title": "Special Complementary Studies Topics"
    },
    {
        "code": "GENE 299",
        "description": "Various courses dealing with selected topics of particular interest to second-year engineering students. These courses will be offered as resources are available and the material is needed.",
        "title": "Special Topics in Second-Year Engineering"
    },
    {
        "code": "GENE 310A",
        "description": "Courses taken by University of Waterloo architecture students while completing an international exchange, and reserved for courses without equivalents at the University of Waterloo. These courses are treated as technical electives in the student's plan.",
        "title": "Topics for Technical Courses Taken on Exchange by Architecture Students"
    },
    {
        "code": "GENE 310E",
        "description": "Courses taken by University of Waterloo engineering students while completing an international exchange, and reserved for courses without equivalents at the University of Waterloo. These courses are treated as technical electives in the student's plan.",
        "title": "Topics for Technical Courses Taken on Exchange by Engineering Students"
    },
    {
        "code": "GENE 311A",
        "description": "Courses taken by University of Waterloo engineering students while completing an international exchange, and reserved for courses without equivalents at the University of Waterloo. These courses are treated as List A complementary studies electives in the student's plan.",
        "title": "Topics for List A Complementary Studies Courses Taken on Exchange by Engineering Students"
    },
    {
        "code": "GENE 311B",
        "description": "Courses taken by University of Waterloo engineering students while completing an international exchange, and reserved for courses without equivalents at the University of Waterloo. These courses are treated as List B complementary studies electives in the student's plan.",
        "title": "Topics for List B Complementary Studies Courses Taken on Exchange by Engineering Students"
    },
    {
        "code": "GENE 311C",
        "description": "Courses taken by University of Waterloo engineering students while completing an international exchange, and reserved for courses without equivalents at the University of Waterloo. These courses are treated as List C complementary studies electives in the student's plan.",
        "title": "Topics for List C Complementary Studies Courses Taken on Exchange by Engineering Students"
    },
    {
        "code": "GENE 311D",
        "description": "Courses taken by University of Waterloo engineering students while completing an international exchange, and reserved for courses without equivalents at the University of Waterloo. These courses are treated as List D complementary studies electives in the student's plan.",
        "title": "Topics for List D Complementary Studies Courses Taken on Exchange by Engineering Students"
    },
    {
        "code": "GENE 312E",
        "description": "Courses taken by University of Waterloo engineering students while completing an international exchange, and reserved for courses without equivalents at the University of Waterloo. These courses are treated as natural science electives in the student's plan.",
        "title": "Topics for Natural Science Elective Courses Taken on Exchange by Engineering Students"
    },
    {
        "code": "GENE 315",
        "description": "This course is provided for students who wish to request a course credit for university-related scholarly activities. Students wishing to claim this credit must show evidence of university-level academic activity not otherwise claimed for credit.",
        "title": "Special Directed Non-Technical Studies"
    },
    {
        "code": "GENE 395",
        "description": "Waterloo students studying abroad for academic transfer credits under an engineering exchange program during a fall term register at Waterloo under GENE395.",
        "title": "Engineering Study Abroad"
    },
    {
        "code": "GENE 396",
        "description": "Waterloo students studying abroad for academic transfer credits under an engineering exchange program during a winter term register at Waterloo under GENE396.",
        "title": "Engineering Study Abroad"
    },
    {
        "code": "GENE 397",
        "description": "Waterloo students studying abroad for academic transfer credits under an engineering exchange program during a spring term register at Waterloo under GENE397.",
        "title": "Engineering Study Abroad"
    },
    {
        "code": "GENE 399",
        "description": "Various courses dealing with selected technical topics of particular interest to third-year engineering students. These courses will be offered as resources are available and the material is needed.",
        "title": "Special Topics in Third-Year Engineering"
    },
    {
        "code": "GENE 415",
        "description": "This course provides student leaders with a practical framework to analyze and understand their role in their service organization, either in Waterloo Engineering or outside, to become better leaders in the future.  The course is structured for students to both develop and apply reflective practices to their student leadership experiences   using the SLICC (Student-Led, Individually-Created Course) model and circle pedagogy.  Classroom time is used for discussions, workshops, guest presenters, and peer-to-peer learning experiences from discussions of the weeks topic to formal presentations.  Typical topics include positionality and power, conflict and inter-personal relationships, emotional intelligence, leadership and management, communication, teamwork, and succession planning.  Participation in all in-person sessions and submitting weekly reflections are expected. Main deliverables include weekly reflections, SLICC proposal and final report, as well as presentations and peer feedback on SLICC projects.",
        "title": "Non-Technical Studies: Practical Analysis of Student Leadership Experiences"
    },
    {
        "code": "GENE 499",
        "description": "Various courses dealing with selected technical topics of particular interest to fourth-year engineering students. These courses will be offered as resources are available and the material is needed.",
        "title": "Special Topics in Fourth-Year Engineering"
    },
    {
        "code": "GENE 501",
        "description": "An assignment of study or project work under the direction of a faculty member. The specific project is established on the basis of a written proposal that is agreed to by the supervisors at both the host and home institutions. The academic level and the time commitment shall be specified in the proposal. Registration is restricted to international exchange students at Waterloo under an Exchange Agreement with the Faculty of Engineering. Candidates for degrees at the University of Waterloo are not eligible.",
        "title": "Directed Studies for Visiting Exchange Students"
    },
    {
        "code": "GENE 502",
        "description": "An assignment of study or project work under the direction of a faculty member. The specific project is established on the basis of a written proposal that is agreed to by the supervisors at both the host and home institutions. The academic level and the time commitment shall be specified in the proposal. Registration is restricted to international exchange students at Waterloo under an Exchange Agreement with the Faculty of Engineering. Candidates for degrees at the University of Waterloo are not eligible.",
        "title": "Directed Studies for Visiting Exchange Students"
    },
    {
        "code": "GENE 503",
        "description": "An assignment of study or project work under the direction of a faculty member. The specific project is established on the basis of a written proposal that is agreed to by the supervisors at both the host and home institutions. The academic level and the time commitment shall be specified in the proposal. Registration is restricted to international exchange students at Waterloo under an Exchange Agreement with the Faculty of Engineering. Candidates for degrees at the University of Waterloo are not eligible.",
        "title": "Directed Studies for Visiting Exchange Students"
    },
    {
        "code": "GENE 599",
        "description": "Various courses dealing with selected technical topics of particular interest to fourth-year engineering students. These courses will be offered as resources are available and the material is needed.",
        "title": "Special Topics in Engineering"
    },
    {
        "code": "GEOE 100",
        "description": "An introduction to the fundamental methods, principles and skills of environmental and geological engineering. Fundamentals of technical communication, the engineering design process and problem solving. Completion of a pre-design study and report for an environmental engineering project. Independent and team work. Fundamentals of engineering computation units, data collection, measurement, and error analysis. Field surveying (automatic level, engineer's transit, differential global positioning system (GPS), total station). Laboratory on engineering graphics auto-computer assisted diagnosis (AutoCAD) and computational software (Excel, Matlab). Aspects of the engineering profession (code of ethics, negligence, misconduct, role of the Professional Engineers Ontario (PEO), etc.), diversity in the workplace, and professional development. Preparation for the University of Waterloo co-operative education program (Co-operative and Experiential Education, rsum writing, job search, and interview skills).",
        "title": "Environmental and Geological Engineering Concepts"
    },
    {
        "code": "GEOE 115",
        "description": "Linear systems of equations, matrices, and determinants. Introduction to the eigenvalue problem. Applications.",
        "title": "Linear Algebra"
    },
    {
        "code": "GEOE 121",
        "description": "Introduction to computer programming, examples of efficient numerical algorithms for basic scientific computations. Programming and problem solving concepts introduced in the course will be incorporated into group projects involving civil, environmental, or geological engineering applications. The language of instruction will be Matlab.",
        "title": "Computational Methods"
    },
    {
        "code": "GEOE 123",
        "description": "Charge, current, and voltage. Voltage and current sources, resistors, capacitors, and inductors. Ohm's Law, Kirchhoff's Laws, nodal analysis, instrumentation amplifier circuits, impedance. Function and characteristics of basic electrical transducers. Resolution, precision, and accuracy. Basics of data acquisition.",
        "title": "Electrical Circuits and Instrumentation"
    },
    {
        "code": "GEOE 153",
        "description": "This course studies earth materials and processes from an engineering point of view through case histories and problem sets. The course develops a geological knowledge for applications to any physical environment and provides an appreciation of the impact of engineering work on the environment. Topics include mineral and rock identification, the rock cycle, structural geology and tectonics, geology of Canada, effects of water, ice and wind. Students are also introduced to the concept of geologic time, topographic and geologic maps, and the basic principles and tools used to determine geologic history.",
        "title": "Earth Engineering"
    },
    {
        "code": "GEOE 221",
        "description": "Calculus of functions of several variables. Differentiation; partial derivatives of implicit and explicit functions, applications including optimizations. Integration; multiple integrals in various co-ordinate systems with applications. Vector calculus; vector fields, line integrals, surface integrals, and applications. Numerical integration and differentiation.",
        "title": "Advanced Calculus"
    },
    {
        "code": "GEOE 223",
        "description": "An introduction to ordinary differential equations with applications to mass and energy balance problems in engineering. Standard methods of solution of first and second order linear equations with constant coefficients. Numerical methods for solving ordinary differential equations. Partial differential equations.",
        "title": "Differential Equations and Balance Laws"
    },
    {
        "code": "GEOE 224",
        "description": "Role of probability in engineering and decision-making under uncertainty. Basic probability concepts. Probability distributions. Functions of random variables. Data analysis. Confidence intervals and hypothesis testing. Introduction to regression analysis. Introduction to design of experiments and statistical quality control.",
        "title": "Probability and Statistics"
    },
    {
        "code": "GEOE 280",
        "description": "An introduction to fluid mechanics. Fluid properties. Review of fluid statics. Buoyancy. Bernoulli equation. The momentum equation and applications. Laminar and turbulent flow. Dimensionless numbers. Closed conduit flow including friction losses. Pipe network analysis including energy losses and efficiencies. Four lab sessions.",
        "title": "Fluid Mechanics"
    },
    {
        "code": "GEOE 353",
        "description": "An introduction to geologic processes. Subsurface exploration. Classification systems. Weight-volume relationships. Soil mechanics principles including state of stress, ground water flow, consolidation and shear strength. Four lab sessions.",
        "title": "Geotechnical Engineering 1"
    },
    {
        "code": "GEOE 354",
        "description": "Foundation engineering. Earth pressure theories. Retaining walls. Anchors. Shallow and deep foundations. Braced trenches and excavations. Slope stability.",
        "title": "Geotechnical Engineering 2"
    },
    {
        "code": "GEOE 391",
        "description": "Philosophy of environmental controls; introduction to national and international regulatory structures relevant to industrial planning, emissions control, environmental impact assessment, occupational health; stance of government, industry and community pressure groups. Contract law. Professional ethics, including the social responsibility of engineers, conflicts of interest.",
        "title": "Law and Ethics for Environmental and Geological Engineers"
    },
    {
        "code": "GEOE 392",
        "description": "Project financing, life-cycle cost analysis, time value of money, sensitivity analyses, tax, financial implications of infrastructure projects, quantitative decision-making, financial aspects of a business plan.",
        "title": "Economics and Life Cycle Cost Analysis"
    },
    {
        "code": "GEOE 495",
        "description": "A special topics course on design intensive advanced topics in geological engineering is offered from time to time, when resources are available. For the current offering, inquire at the Department.",
        "title": "Design Intensive Special Topics in Geological Engineering"
    },
    {
        "code": "GEOE 497",
        "description": "A special topics course on advanced topics in geological engineering is offered from time to time, when resources are available. For the current offering, inquire at the Department.",
        "title": "Special Topics in Geological Engineering"
    },
    {
        "code": "GEOE 554",
        "description": "Simulation of geotechnical consulting practice. Students are required to complete several projects, based on actual case studies, which require problem identification, evaluation of geotechnical data, analysis, design, and report preparations.",
        "title": "Geotechnical Engineering 3"
    },
    {
        "code": "ME 100",
        "description": "This course is focused on fundamental knowledge and skills essential for academic and professional development in mechanical engineering. It covers basic methods and principles used by mechanical engineers, e.g., fundamentals of technical communication, the design process and problem solving, measurements and data analysis, engineering professionalism, safety, and intellectual property. The fundamentals of engineering graphical communication using computer-aided design (CAD) and freehand sketching will be a significant component of this course. Written, graphical and oral communications are emphasized. Examples are drawn from mechanical engineering.",
        "title": "Introduction to Mechanical Engineering Practice 1"
    },
    {
        "code": "ME 101",
        "description": "This course is a continuation of ME100 and is aimed at reinforcing the concepts related to technical communications, professionalism, and professional development, with emphasis on mechanical engineering concepts and practical examples. The fundamentals of programming are a significant component of this course, focusing on digital computing, and basic programming and algorithm writing. Programming examples are drawn from mechanical engineering.",
        "title": "Introduction to Mechanical Engineering Practice 2"
    },
    {
        "code": "ME 115",
        "description": "The relevance of materials to engineering practice. The microstructure of materials, crystallinity and crystal imperfections, glasses, and amorphous solids. Elastic and plastic deformation in metals, viscoelasticity of plastics. Strengthening mechanisms in metals, polymers, and ceramics. Fracture of brittle and ductile solids. Electrical and magnetic properties of materials.",
        "title": "Structure and Properties of Materials"
    },
    {
        "code": "ME 123",
        "description": "Definitions of electric and magnetic fields. Introduction to circuit theory (direct current) DC circuits, amplifiers, operational amplifiers, single- and three-phase (alternating current) AC circuits. Introduction to basic electronic devices.",
        "title": "Electrical Engineering for Mechanical Engineers"
    },
    {
        "code": "ME 201",
        "description": "A continuation of first-year calculus, focusing on calculus of scalar and vector functions of several variables. Both classical calculus techniques and the computer implementation of numerical methods are discussed. Partial differentiation, total derivatives, chain rule, transformation of variables, Taylor series. Applications include geometrical problems, error estimation, maxima and minima, least squares curve fits. Multiple integration in standard coordinate systems, Jacobians. Vector calculus, divergence, curl, Laplacian, and Stokes', Green's and Divergence theorems. Scalar flux transport, work and energy, conservative force fields.",
        "title": "Advanced Calculus"
    },
    {
        "code": "ME 202",
        "description": "Frequency distributions; measures of central tendency; standard deviation and other measures of dispersion. Probability. Binomial, Poisson, normal distributions. Techniques of sampling and statistical estimation. Tests of hypotheses; significance. The t-test and chi-squared test. Curve fitting by least squares. Statistical process control. Correlation and regression. Experimental design.",
        "title": "Statistics for Engineers"
    },
    {
        "code": "ME 203",
        "description": "Solution of ordinary differential equations. First and higher order differential equations. Nonlinear equations. Linear equations with constant and variable coefficients. Systems of linear equations. Applications involving simple dynamical systems and principles of mass, momentum and heat conservation will emphasize the role of ordinary differential equations in understanding the behaviour of physical systems. Introduction to the Laplace transform method for solving ordinary differential equations.",
        "title": "Ordinary Differential Equations"
    },
    {
        "code": "ME 212",
        "description": "An introduction to the kinematics of particle and rigid body motion. Impulse-momentum equations. Work-energy methods and Euler's equations. Simple gyroscopes. Vibrations.",
        "title": "Dynamics"
    },
    {
        "code": "ME 219",
        "description": "Concept of equilibrium, force analysis of structures and structural components, equilibrium of deformable bodies, stress and strain concepts, stress-strain relationships, stress analysis of prismatic members in axial, shearing, torsional and flexural deformations, shear force and bending moment diagrams.",
        "title": "Mechanics of Deformable Solids 1"
    },
    {
        "code": "ME 220",
        "description": "A general treatment of the behaviour of structural components from the study of stress and strain in solids. Topics include superposition, energy theorems, theories of failure, elastic and inelastic analysis of symmetrical bending, torsion of circular members, columns and stability, and virtual work. ",
        "title": "Mechanics of Deformable Solids 2"
    },
    {
        "code": "ME 230",
        "description": "Phase equilibria, non-equilibrium behaviour, heat treatment of metals, diffusion, strengthening processes. Alloying, composite materials, cold and hot working. Failure of engineering materials; creep, fatigue, corrosion and other environmental degradation processes. Prevention of service failures.",
        "title": "Control of Properties of Materials"
    },
    {
        "code": "ME 235",
        "description": "The microstructure of crystalline and amorphous materials including metals, polymers and ceramics. Elastic and plastic deformation in metals, viscoelastic deformation of polymers and viscous deformation of ceramic glasses. Fracture of brittle and ductile solids. Phase equilibria, non-equilibrium behaviour, heat treatment of metals, diffusion, strengthening processes.",
        "title": "Materials Science and Engineering"
    },
    {
        "code": "ME 250",
        "description": "The engineering science of energy. The scope and limitations of thermodynamics. Macroscopic approach to heat, work, energy and the First Law. Properties and state of simple substances. Control-mass and control-volume energy analysis. The Second Law of Thermodynamics, principle of increase of entropy, limiting cycle efficiencies, criteria for equilibrium.",
        "title": "Thermodynamics 1"
    },
    {
        "code": "ME 262",
        "description": "Number systems, logic gates, Boolean algebra. Karnaugh maps and combinational logic design. Sequential logic and state machines. Programmable Logic Controllers (PLCs) and PLC programming using ladder logic and statement list. Microcomputer structure and operation, I/O and interfacing. Assembly language programming. Laboratory work includes microcomputer and PLC programming.",
        "title": "Introduction to Microprocessors and Digital Logic"
    },
    {
        "code": "ME 269",
        "description": "Review of circuit analysis. Basic electromagnetic theory. DC machines, synchronous generators, transformers, and induction motors. Introduction to typical speed and torque control techniques of machines using power electronic based devices.",
        "title": "Electromechanical Devices and Power Processing"
    },
    {
        "code": "ME 303",
        "description": "A continuation of ME201 and ME203 in which both classical calculus techniques and the computer implementation of numerical methods are discussed. Partial differential equations of mathematical physics: wave, diffusion, Laplace, Poisson equations. Boundary and initial conditions. Separation of variables. Numerical methods for ordinary and partial differential equations. Applications will emphasize the role of ordinary and partial differential equations in understanding the behaviour of physical systems.",
        "title": "Advanced Engineering Mathematics"
    },
    {
        "code": "ME 321",
        "description": "Principles of the geometry of motion, uniform and non-uniform motion, linkages, gears, and analysis of mechanisms. Consideration of the static and dynamic forces in machines. Vibration analysis, response to shock, motion and force transmissibility, vibration isolation, and multi-DOF mechanical vibrations.",
        "title": "Dynamics of Machines and Mechanical Vibrations"
    },
    {
        "code": "ME 322",
        "description": "Adequacy assessment and synthesis of machine elements with a focus on the design process. Static failure of ductile and brittle materials, fatigue analysis of structures. Topics include the design of welds, bolted connections, springs, and shafts.",
        "title": "Mechanical Design 1"
    },
    {
        "code": "ME 340",
        "description": "The principles of manufacturing unit processes including casting, forming, machining and joining. Interactions between design, materials (metals, polymers, ceramics) and processes. Advantages and limitations, relative cost, and production rates of competitive processes.",
        "title": "Manufacturing Processes"
    },
    {
        "code": "ME 351",
        "description": "Physical properties of fluids and fundamental concepts in fluid mechanics. Hydrostatics. Conservation laws for mass, momentum and energy. Flow similarity and dimensional analysis as applied to engineering problems in fluid mechanics. Laminar and turbulent flow. Engineering applications such as flow measurement, flow in pipes, and fluid forces on moving bodies.",
        "title": "Fluid Mechanics 1"
    },
    {
        "code": "ME 353",
        "description": "Introduction to heat transfer mechanisms. The formulation and solution of steady and transient heat conduction. Radiant heat transfer including exchange laws and view factors. Introductory convective heat transfer.",
        "title": "Heat Transfer 1"
    },
    {
        "code": "ME 354",
        "description": "Emphasis on applications of thermodynamics to flow processes. Real fluids, evaluation of state functions of real fluids. Non-reacting mixtures, reacting mixtures, equilibrium considerations.",
        "title": "Thermodynamics 2"
    },
    {
        "code": "ME 360",
        "description": "Open loop and feedback control. Laws governing mechanical, electrical, fluid and thermal control components. Analogies. Analysis of some engineering control systems using block diagram algebra, transient and steady-state operation. Different modes of control. Review of Laplace Transform methods. Concepts of stability. Principles of analog computer simulation. Brief treatment of linear flow graphs and bondgraphs.",
        "title": "Introduction to Control Systems"
    },
    {
        "code": "ME 362",
        "description": "Basic equations of two-dimensional flow, potential flow, exact viscous solutions. Introduction to lubrication, boundary layers, turbulence, and compressible flow. Turbomachinery fundamentals and applications. Selected advanced topics.",
        "title": "Fluid Mechanics 2"
    },
    {
        "code": "ME 380",
        "description": "In this course, students study the design process, including needs analysis, problem definition; design criteria and critical parameter identification, generation of alternative solutions; conceptual design, detailed design, optimization; and implementation. Most of the term is devoted to a significant design project in which student groups work independently and competitively, applying the design process to a project goal set by the faculty co-ordinator. The design project typically includes construction of a prototype, and part of the course grade may depend on the performance of the prototype in a competitive test. In exceptional circumstances, the requirement for a prototype may be replaced by a computer simulation, or may be waived. Other mechanical engineering faculty members, particularly those teaching 3B courses, are available to provide advice and supervision to ME380 students.",
        "title": "Mechanical Engineering Design Workshop"
    },
    {
        "code": "ME 423",
        "description": "A continuation of the ME322 course in analysis and synthesis of machinery, including advanced analysis of machine elements such as clutches, brakes, couplings, journal bearings, and gears. Advanced machine design concepts such as reliability, optimization, and techniques for stimulating innovative design. A synthesis project involving the machine elements studied is usually included.",
        "title": "Mechanical Design 2"
    },
    {
        "code": "ME 435",
        "description": "This course is intended for those students interested in acquiring a working knowledge of metallurgy. It covers: metals and alloy systems, iron-carbon alloys, heat treatment and the function of alloying elements in steel, corrosion and scale resistant alloys, copper and nickel base alloys, light metals and their alloys; casting, hot and cold working of metals; soldering, brazing and welding; corrosion and oxidation; metal failure analysis.",
        "title": "Industrial Metallurgy"
    },
    {
        "code": "ME 436",
        "description": "Introduction to modern welding and joining processes for metals, polymers and ceramics. Fundamentals of the joining process and the influence of the process parameters on weld dimensions, strength and quality. Fusion welding processes such as shielded metal arc, gas tungsten arc, gas metal arc, submerged arc welding and others including electron beam and laser beam welding. Resistance welding processes, solid-state welding processes, soldering and brazing. Laboratory exercises will provide hands-on experience with a number of industrially significant welding processes.",
        "title": "Welding and Joining Processes"
    },
    {
        "code": "ME 452",
        "description": "Advanced psychrometric analysis applied to HVAC system design. Duct design and fan selection. Indoor air quality and thermal comfort. Heating and cooling load calculations. Heat flow through building elements. Solar radiation and solar gains through windows. Infiltration and exfiltration.",
        "title": "HVAC Load Analysis and Design Fundamentals"
    },
    {
        "code": "ME 456",
        "description": "Selected topics in heat transfer fundamentals and applications. Topics to be covered include the fundamentals of convection with analytical solutions to simple laminar flow problems and approximate solutions to turbulent flow problems based on analogies between momentum and heat transfer. Also covered is radiant exchange in grey enclosures and in black enclosures containing emitting-absorbing gases. The remaining topics will be chosen from design of heat exchangers; condensation heat transfer; boiling heat transfer; and the treatment of problems in heat conduction.",
        "title": "Heat Transfer 2"
    },
    {
        "code": "ME 459",
        "description": "Review of reserves and consumption trends of Canada's and the world's energy resources. Design of fossil-fuel central power plants, including boiler efficiency calculations and advanced steam and binary cycles. Review of atomic physics including fission and fusion energy. Design of nuclear fission power plants including design of reactor core for critical conditions, fuel cycles and radiation hazards. Design considerations for solar energy conversion devices including: availability of solar energy, solar-thermal converters, thermal storage and photovoltaics. Principles of fuel cells and some aspects of their design. Other topics as appropriate.",
        "title": "Energy Conversion"
    },
    {
        "code": "ME 524",
        "description": "This course is a continuation of ME212 and ME321. It includes study of planar and three-dimensional motion of rigid bodies and systems, including gyroscopic effects. Vector (Newton's Method) and analytical (Lagrange's Equation) methods are used to derive equations of motion. Linear vibrational analyses are performed to examine natural frequencies, stability, and mode shapes. Computer simulation of non-linear systems is discussed.",
        "title": "Advanced Dynamics and Vibrations"
    },
    {
        "code": "ME 526",
        "description": "Fatigue and fracture analysis of metallic components including welded joints. Review of test and design procedures. Sources of cyclic loading. Cyclic counting procedures and cumulative damage. S-N curves and effects of mean, residual and multiaxial stressing. Stress concentrations; scatter and fatigue life distributions. Transition temperature concepts. Linear elastic fracture mechanics analysis of fatigue crack propagation and fracture initiation. Crack arrest.",
        "title": "Fatigue and Fracture Analysis"
    },
    {
        "code": "ME 531",
        "description": "This course will allow the student to develop a more in depth knowledge of physical metallurgy and its application in understanding and solving relevant manufacturing problems. It will begin with a treatment of solid-state diffusion, mass transport and the principles of solidification including constitutional supercooling. This knowledge will then be applied to understand the microstructural development (and resultant properties) which occur in materials during manufacturing processes including casting, solid-state heat treatments, laser processing, and various joining operations. The course will include case studies aimed at providing the students with an opportunity to apply their knowledge in a practical way.",
        "title": "Physical Metallurgy Applied to Manufacturing"
    },
    {
        "code": "ME 533",
        "description": "This course is intended to provide an advanced treatment of the structure, properties, and processing of non-metallic and composite materials based on polymers, metals, and ceramics. The structure and properties of polymers and ceramics in bulk form and as matrices and reinforcements in composites will be covered. Processing methods for non-metallics and composites (example extrusion, injection molding, etc.) will be considered. The geometrical arrangement of fibres within laminae and their influences on elastic and strength properties of composites will be described based on suitable micromechanical models. The role of the matrix and fibre/matrix interface in determining composite properties will be described.",
        "title": "Non-Metallic and Composite Materials"
    },
    {
        "code": "ME 535",
        "description": "Metallurgy of welding of steels (carbon, microalloy, low alloy and stainless steels), cast irons, aluminum-based, copper-based, nickel-based, cobalt-based, titanium-based and other alloys, (including dissimilar combinations) to explain the effects of welding processes and conditions (including post-weld heat treating) on microstructure and properties; causes and prevention of defects and deficiencies which can occur in different alloys, including porosity, cracking, embrittlement (hydrogen, temper, strain aging, ductile-brittle transition temperatures), overaging; metallurgy of soldered and brazed joints. Laboratory experiments will demonstrate microstructural effects and defects in a range of alloys for different welding processes and conditions.",
        "title": "Welding Metallurgy"
    },
    {
        "code": "ME 538",
        "description": "Manufacturing principles of welded mechanical components, machinery, pressure vessels, and structures subject to static or dynamic loading. Design of weld joints for structures made from ferrous alloys such as plain carbon and low alloy steels and non-ferrous alloys such as aluminum alloys. Residual stresses in weldments and distortion of weldments. Quality and quality control in welding fabrication; welding standards; welding procedure qualification; nondestructive examination methods for welds and brazed joints such as radiography, dye penetrant, magnetic particle, ultrasonic, and eddy current techniques.",
        "title": "Welding Design, Fabrication and Quality Control"
    },
    {
        "code": "ME 540",
        "description": "Introduction to the field of neural and rehabilitation engineering (NRE). Topics include describing common neurological and musculoskeletal injuries, related neural and rehabilitation engineering approaches to address disabilities, and the development of a design framework for synthesizing a novel neural and rehabilitation engineering approach. Critical concepts in clinical research design to meet current regulatory, ethical, and practice policies will be studied.",
        "title": "Fundamentals in Neural and Rehabilitation Engineering"
    },
    {
        "code": "ME 547",
        "description": "Homogeneous transformations, D-H convention, forward and inverse kinematics. Differential transformations and Jacobians. Robot dynamics. Programming, trajectory generation and joint control. End-of-arm sensing and outer loop control. Industrial applications.",
        "title": "Robot Manipulators: Kinematics, Dynamics, Control"
    },
    {
        "code": "ME 548",
        "description": "Operation fundamentals of NC machine tools. NC part programming: manual and CAD/CAM methods. Mechanics of metal cutting: examples of turning, milling, and drilling. Tool wear and breakage. Optimum cutting conditions. Dimensional and form errors due to static deformations. Dynamics of machining. Laboratory work provides hands-on experience in tool path generation, machining, and measurements of cutting forces and vibration.",
        "title": "Numerical Control of Machine Tools 1"
    },
    {
        "code": "ME 555",
        "description": "Need for geometric modelling, historic developments; wire frame models; hidden line removed models; polyhedral models; surface models and solid models. Constructive solid geometry; boundary representation and decomposition modelling. Hybrid models. Data structures and their role in modelling. Curves and surfaces in modelling (Bezier, B-splines and NURBS). Geometric models and the role of engineers. Parametric and feature-based design. The course has a heavy lab component which provides exposure to solid modelling on SDRC IDEAS and PC-based CAD packages.",
        "title": "Computer-Aided Design"
    },
    {
        "code": "ME 557",
        "description": "Combustion thermodynamics, introduction to chemical kinetics of combustion, combustion properties of fuels, flammability of combustible mixtures. Flame propagation mechanisms, pre-mixed and diffusional; stability of flames; introduction to combustion aerodynamics, jet flames; atomization; droplet and spray combustion. Elementary ignition concepts and theory. Basic detonation theory.",
        "title": "Combustion 1"
    },
    {
        "code": "ME 559",
        "description": "A course presenting the fundamental ideas involved in conventional finite element analysis in mechanical engineering. Domain discretization, interpolation and shape functions, element derivation and types, element stiffness or property equations, assembly procedure, boundary conditions, solution methods for the algebraic equation system, applications in heat transfer, fluid flow, and stress analysis. Students will, throughout the course, write and test their own finite element code through individual subroutine construction as the course progresses.",
        "title": "Finite Element Methods"
    },
    {
        "code": "ME 561",
        "description": "Properties of hydraulic fluids. Design and function of conventional hydraulic and pneumatic circuits. Characteristics of flow and pressure control valves. Speed control in fluid power circuits. Performance of pumps and fluid motors. Hydrostatic and hydrokinetic transmission systems. Principles of sealing, filtration and heat control in hydraulic circuits. Industrial applications of fluid power systems.",
        "title": "Fluid Power Control Systems"
    },
    {
        "code": "ME 562",
        "description": "This course is focused on theory and practice of experimental analysis of fluid mechanics problems. It covers the following topics: experimental facilities and techniques for measurements in fluid flows, flow visualization, identification of appropriate tools for experimental assessment, planning of experiments, laboratory experiments, data acquisition, analysis of experimental results and uncertainty estimation.",
        "title": "Experimental Methods in Fluids"
    },
    {
        "code": "ME 563",
        "description": "Classification of turbomachines, performance parameters and laws of modelling. Basic equation of flow in turbomachines, compressible flow. Energy transfer in radial and axial turbomachines, performance characteristics, losses, and efficiencies. Blade and cascade design, 3-dimensional effects.",
        "title": "Turbomachines"
    },
    {
        "code": "ME 564",
        "description": "An introductory course in aerodynamics for engineers. Kinematics and dynamics of inviscid flow; airfoil dynamics including thin airfoil theory, finite wings, panel methods and airfoil parameters. Boundary layer theory and boundary layer control as applied in aerodynamics. Introduction to high speed aerodynamics. Introduction to dynamics of flight including stability and control.",
        "title": "Aerodynamics"
    },
    {
        "code": "ME 566",
        "description": "A course to develop the understanding required to simulate complex fluid flows, such as those found in turbo-machines, duct systems, and other engineering hardware. Course topics include the physics of complex viscous fluid flows, first- and second-order finite control volume discretization methods, iterative algorithms for the solution of sparse matrix equation sets, including multi-grid acceleration, boundary condition modelling, two-equation and Reynolds stress turbulence models, and grid generation techniques. Computational fluid dynamics software is used throughout the course to simulate and analyze complex fluid flows relevant to engineering applications.",
        "title": "Computational Fluid Dynamics for Engineering Design"
    },
    {
        "code": "ME 567",
        "description": "The art and science of fire safety engineering. Fundamentals of fire behaviour, fuels and flammability, heat transfer and fluid dynamics of fires and fire modelling. Practical issues and applications of fire safety, fire control and hazard assessment in the design of buildings, industrial environments, and transportation systems.",
        "title": "Fire Safety Engineering"
    },
    {
        "code": "ME 571",
        "description": "Sources of air pollution and greenhouse gases, chemical and biological aspects, effects on health and environment. Thermodynamics and air emissions, air pollution control techniques and equipment monitoring instrumentation, carbon capture, utilization and storage, low-carbon technologies. [Offered: W]",
        "title": "Clean Air Technologies"
    },
    {
        "code": "ME 572",
        "description": "Introduction to whole-building energy analysis. Energy auditing, benchmarking, and simulation. Review of relevant concepts in heat transfer and thermodynamics, including introductory psychrometrics. Interactive effects of building elements, systems, and occupant behaviour. Economic and environmental impacts of building energy use.",
        "title": "Building Energy Analysis"
    },
    {
        "code": "ME 573",
        "description": "Selected topics in HVAC systems design with focus on energy-efficiency and environmental-sustainability. Heating and cooling distribution using air-, water-, and refrigerant-based systems. Constant- and variable-flow systems. Heat- and energy-recovery systems. Vapour-compression refrigeration and heat-pump systems (including air- and geothermal-source heat pumps).",
        "title": "HVAC Systems, Equipment, and Energy Efficiency"
    },
    {
        "code": "ME 574",
        "description": "Introduction to engineering technologies applicable to the field of biomechanics. Specific topics covered may include biological growth, form and function; biomaterials; kinematics and neurology of gait; biotribology; joint anatomy, function and repair; occupational biomechanics; trauma prevention.",
        "title": "Engineering Biomechanics"
    },
    {
        "code": "ME 595",
        "description": "Various courses dealing with selected topics at the undergraduate level in automation and control, solid mechanics and machine design, materials engineering and processing, fluid mechanics, and thermal engineering. Courses offered when resources permit.",
        "title": "Special Topics in Mechanical Engineering"
    },
    {
        "code": "ME 596",
        "description": "Various courses dealing with selected topics at the undergraduate level in automation and control, solid mechanics and machine design, materials engineering and processing, fluid mechanics, and thermal engineering. Courses offered when resources permit.",
        "title": "Special Topics in Mechanical Engineering"
    },
    {
        "code": "ME 597",
        "description": "Various courses dealing with selected topics at the undergraduate level in automation and control, solid mechanics and machine design, materials engineering and processing, fluid mechanics, and thermal engineering. Courses offered when resources permit.",
        "title": "Special Topics in Mechanical Engineering"
    },
    {
        "code": "ME 598",
        "description": "Various courses dealing with selected topics at the undergraduate level in automation and control, solid mechanics and machine design, materials engineering and processing, fluid mechanics, and thermal engineering. Courses offered when resources permit.",
        "title": "Special Topics in Mechanical Engineering"
    },
    {
        "code": "ME 599",
        "description": "Various courses dealing with selected topics at the undergraduate level in automation and control, solid mechanics and machine design, materials engineering and processing, fluid mechanics, and thermal engineering. Courses offered when resources permit.",
        "title": "Special Topics in Mechanical Engineering"
    },
    {
        "code": "MSE 100",
        "description": "An introduction to the practice of management engineering, including topics such as criteria-based decision making with a focus on efficiency and effectiveness; cause and effect analysis, and an engineering approach to problem solving; flow and process analysis; teamwork and project management; decision-making tools; and written and verbal communication. Engineering design methods are also introduced, including a design project with small groups, as are aspects of the engineering profession including topics such as ethics, safety, and legal liability. Professional development for preparation for co-op terms is also included.",
        "title": "Management Engineering Concepts"
    },
    {
        "code": "MSE 121",
        "description": "An introduction to computer programming using a high level programming language. Concepts and topics covered include the basic components of algorithms (primitive operations, variables, sequencing operations, conditionals/branching, repetition/loops, subroutines/functions), problem decomposition, abstraction, testing and debugging, pseudo-code, file based input and output, use of a modern development environment including a symbolic debugger, good coding style, pointers/references, and basic data structures (arrays, records, objects).",
        "title": "Introduction to Computer Programming"
    },
    {
        "code": "MSE 131",
        "description": "The course introduces fundamental concepts in two main areas: The first is work analysis and design where work methods design, motion and time study, and work sampling are covered. The second covers basic concepts in facilities planning such as process analysis, flow design, facility location and layout, and material handling systems. Students will apply these concepts in design activities in labs and projects.",
        "title": "Work Design and Facilities Planning"
    },
    {
        "code": "MSE 211",
        "description": "Introduction to the concepts of learning, person perception, attitudes, and motivation in an organization. Consideration of communication, roles, norms, and decision making within a group. Discussion of power, control, leadership, and management in light of the above concepts.",
        "title": "Organizational Behaviour"
    },
    {
        "code": "MSE 232",
        "description": "This course uses a quantitative approach to problem solving using mathematical modelling, solution by solver, and output and sensitivity analysis.  Students learn how to analyze and solve decision problems in Management and Engineering systems following the Engineering process: understanding the problem, identifying appropriate models and solution methods, formulating and structuring the model, and interpreting the results. The course covers linear, integer, and nonlinear, optimization modelling and dynamic programming.",
        "title": "Modelling in Operations Research"
    },
    {
        "code": "MSE 240",
        "description": "Design and analysis of data structures and algorithms with an emphasis on further development of computer programming skills. Topics include algorithms for searching, sorting, stacks, queues, trees, and graphs. Comparison of algorithms on different data structures. Solutions to common engineering problems in computer science using algorithms and data structures. Introduction to mathematical analysis of space and time complexity with a focus on designing solutions that can scale to large input sizes.",
        "title": "Algorithms and Data Structures"
    },
    {
        "code": "MSE 245",
        "description": "This course introduces students to software systems that use a relational database management system (RDBMS) for data storage. One focus of this course is multi-tier software architectures, such as websites and other software as a service (SaaS) systems. Students will learn common software concepts such as design patterns, and modelling processes, objects, logic, and data. Students will learn how to organize data in a RDBMS and how to interact with the database using the structured query language (SQL).",
        "title": "Databases and Software Design"
    },
    {
        "code": "MSE 251",
        "description": "A first of a two-course sequence that introduces fundamental concepts in probability and statistics. It covers probability concepts, random variables, graphical display of distributions and data, discrete and continuous probability distributions, sampling, estimation, confidence intervals, experimental design, hypothesis testing, and simple linear regression and correlation. Students learn how to graphically explore data, conduct, and analyze a two-treatment experiment, and model data with linear regression, and interpret its fit. Students learn to use statistical computing software (e.g., R) to perform data analyses. Emphasis is placed on gaining experience with data collected from student-conducted experiments.",
        "title": "Probability and Statistics 1"
    },
    {
        "code": "MSE 253",
        "description": "The second of a two-course sequence that introduces probability and statistics. It covers quantitative information displays, conditional probability and Bayes' rule, transforms, joint distributions, special discrete and continuous distributions (t, F, chi-square, Poisson), fitting distributions to data, maximum likelihood estimation, multiple regression, experimental design (blocking, factorial), paired hypothesis tests, analysis of variance, non-parametric statistics, and computer intensive statistics (bootstrap). In addition, students learn how to clean data, handle missing values, smooth data, and perform the statistical techniques covered in the course using a statistical computing package (e.g., R). Emphasis is placed on working with actual data collected from student experiments and other sources such as industrial partners.",
        "title": "Probability and Statistics 2"
    },
    {
        "code": "MSE 261",
        "description": "Introductory finance: time value of money, cash flow analysis. Investment evaluation methods: present worth, annual worth, and internal rate of return. Depreciation models and asset replacement analysis. The impact of inflation, taxation, uncertainty, and risk on investment decisions.",
        "title": "Engineering Economics: Financial Management for Engineers"
    },
    {
        "code": "MSE 263",
        "description": "This course introduces students to key concepts in microeconomics, with an emphasis on applications to managerial decision-making. Topics include basic analysis of supply and demand, demand functions and the theory of consumer behaviour, production and costs, market equilibrium, competition between industry participants, and pricing strategies of firms under different market structures.",
        "title": "Managerial Economics"
    },
    {
        "code": "MSE 271",
        "description": "This course introduces students to first and second order ordinary differential equations, vector calculus, and numerical methods for solution of systems of equations, and ordinary differential equations. Applications in management engineering are emphasized.",
        "title": "Advanced Calculus and Numerical Methods"
    },
    {
        "code": "MSE 302",
        "description": "This course provides a survey of engineering design theories, methods, and tools as they pertain to need finding, problem formulation, and solution generation and evaluation. Students learn about different approaches to design project and team management and communication, as well as the relationship between design and environmental, social, and economic sustainability. Students gain experience in the entire design cycle by working on a number of small design problems throughout the term. Students form teams and work on a term-long project centred on need finding and problem formulation. This activity is expected to result in a project topic that can be further developed in the capstone design series of courses (MSE401/402).",
        "title": "Engineering Design Methods"
    },
    {
        "code": "MSE 311",
        "description": "The focus of this course is on the procedures and variables involved in the design and redesign of organizations. Issues such as departmentation, differentiation, integration, internal politics, innovation, authority, and control are discussed in the context of the underlying technology of the organization. Emphasis will be placed on how one designs both the technical and the organizational systems to ensure their compatibility, noting the effects that one has on the other.",
        "title": "Organizational Design and Technology"
    },
    {
        "code": "MSE 331",
        "description": "This first course in optimization uses a quantitative approach to problem solving involving, mathematical modelling and formulations, solution methods, and output analysis. Students are introduced to a variety of practical problem formulations in management and engineering, a number of solution methods, including, but not limited to, linear optimization, network models, project management, and decision analysis. Students are also involved in a group project, where they go through conceptual and operational model design, analytical solution, output analysis, and recommendation.",
        "title": "Introduction to Optimization"
    },
    {
        "code": "MSE 332",
        "description": "This course builds on the material presented in MSE331, and explores more advanced optimization techniques and applications. Methods, such as integer optimization, dynamic programming, and heuristics, are introduced and used to design solution alternatives for applications from management engineering. This may include network and process design in logistics, transportation, telecommunications, and healthcare.",
        "title": "Deterministic Optimization Models and Methods"
    },
    {
        "code": "MSE 333",
        "description": "This course introduces the use of discrete event simulation as an approach for understanding and analyzing complex management systems. Topics include an introduction to simulation modelling, general purpose and special purpose simulation languages, designing valid and credible simulation models, input data analysis, output analysis and experimental design.",
        "title": "Simulation Analysis and Design"
    },
    {
        "code": "MSE 334",
        "description": "This course exposes students to production planning and inventory control approaches in industrial and service systems. Production planning topics cover capacity and resources planning, production scheduling, manufacturing resource planning, just-in-time and lean manufacturing. Inventory control topics cover lot sizing policies, deterministic and stochastic inventory policies. The course involves a design project of a production and/or inventory system.",
        "title": "Operations Planning and Inventory Control"
    },
    {
        "code": "MSE 342",
        "description": "In this course, students learn how to work as a team to efficiently design and build software that works correctly and solves a customer's problem. Topics include software development processes, requirements gathering and analysis, software design, specifications, estimation, scheduling, revision control, software testing, deployment, and team behaviour.",
        "title": "Principles of Software Engineering"
    },
    {
        "code": "MSE 343",
        "description": "This course is designed to provide in-depth exposure to the concepts of human-computer interaction and methods of interactive information system design. The course will focus on techniques for building information systems that meet human needs and capabilities by following a system development lifecycle: user requirements analysis, information and interaction design, prototyping and evaluation.",
        "title": "Human-Computer Interaction"
    },
    {
        "code": "MSE 391",
        "description": "A work-term report is a written report that provides an opportunity for students to effectively communicate, document, and reflect on engineering experience gained during a preceding work term. In the report, students draw connections between the theoretical aspects of engineering taught in the classroom and the practical applications of that theory in the workplace. Reports are due on the tenth day of lectures for the academic term in which the report is required.",
        "title": "Work-Term Report"
    },
    {
        "code": "MSE 392",
        "description": "A work-term report is a written report that provides an opportunity for students to effectively communicate, document, and reflect on engineering experience gained during a preceding work term. In the report, students draw connections between the theoretical aspects of engineering taught in the classroom and the practical applications of that theory in the workplace. Reports are due on the tenth day of lectures for the academic term in which the report is required.",
        "title": "Work-Term Report"
    },
    {
        "code": "MSE 411",
        "description": "This course will provide students with an overview of how management, psychology, marketing, and related fields have approached the topics of leadership, influence, and power. The first section of the course will address the antecedents of leadership (e.g., How do specific leaders emerge? What are the qualities of good leaders?). The second section of the course will address the act of leadership (e.g., How do leaders influence their followers? What limitations are inherent to leadership positions?) Specific topics covered include leadership styles, persuasion, social influence, evolutionary perspectives, motivating others, and managing conflict.",
        "title": "Leadership and Influence"
    },
    {
        "code": "MSE 422",
        "description": "This course is designed to analyze the impact of technological change and entrepreneurship at a firm and societal level, primarily in terms of the economic antecedents and consequences of new technology. The scope of the course ranges from the study of the determination of productivity and its effect on economic growth to the determination of innovative activity and performance.",
        "title": "Economic Impact of Technological Change and Entrepreneurship"
    },
    {
        "code": "MSE 431",
        "description": "Introduction to operations research models and methods for problems with random, stochastic, and probabilistic components. Topics include birth and death processes, branching processes, waiting line models, and Markov decision processes. Applications include the design, modelling, and analysis of service and manufacturing systems, with emphasis on important functions such as queueing, inventory, reliability, equipment replacement, and maintenance.",
        "title": "Stochastic Models and Methods"
    },
    {
        "code": "MSE 432",
        "description": "Introduction to management, planning, and control decisions in manufacturing and service settings using quantitative approaches. Topic areas include production, inventory, distribution, quality control, facilities layout, and process design. Students are exposed to a number of examples and case studies, and work on a project that involves analysis and discussion of improved designs.",
        "title": "Production and Service Operations Management"
    },
    {
        "code": "MSE 433",
        "description": "This course exposes students to a variety of application areas in management engineering and introduces to them the challenges inherent in implementing new management engineering systems. Topics will be chosen from areas such as manufacturing, services, logistics, finance, healthcare, and engineering.",
        "title": "Applications of Management Engineering"
    },
    {
        "code": "MSE 434",
        "description": "This course focuses on the efficient use of material, information, physical and human capital resources in supply-demand networks consisting of suppliers, manufacturers, distributors, retailers and customers. It emphasizes analytic tools used to design, implement and sustain competitive supply chain systems. The material will highlight application of supply chain practices in industry and supply chain implementation challenges. Issues associated with international or global supply chains will be discussed.",
        "title": "Supply Chain Management"
    },
    {
        "code": "MSE 435",
        "description": "This course covers more advanced topics in optimization that go beyond the contents of MSE232, MSE331, and MSE332. The course will cover topics such as constraint programming, stochastic programming, large scale optimization, or complementarity problems.",
        "title": "Advanced Optimization Techniques"
    },
    {
        "code": "MSE 436",
        "description": "This course provides an introduction to analysis, design, and implementation of decision support systems for engineering and business applications. Operations research modelling techniques and software are integrated with database systems and computer interfaces to create systems that aid managerial decision-making. This course also discusses challenges in designing and implementing decision support systems based on models drawn from Operations Research.",
        "title": "Decision Support Systems"
    },
    {
        "code": "MSE 442",
        "description": "This course is designed to familiarize the student with issues related to the impact of computer-based technologies on individual jobs, organizations, and broader societal level. Particular emphasis will be placed on critical examination of various issues including privacy, security, ethical concern, and professional responsibilities.",
        "title": "Impact of Information Systems on Organizations and Society"
    },
    {
        "code": "MSE 446",
        "description": "This course provides an introduction to machine learning, including supervised and unsupervised learning. Emphasis is placed on proper procedures for the training and testing of models. Topics covered may include data cleaning and transformation, overfitting and generalization, n-fold cross validation, regression, decision trees, neural networks, rule finding, and clustering. Students learn to apply machine learning methods to management engineering problems using common tools such as R and Python.",
        "title": "Introduction to Machine Learning"
    },
    {
        "code": "MSE 452",
        "description": "This course deals with normative, descriptive, and prescriptive theories and models of decision making under uncertainty. The course focuses on concepts such as risk measures, Bayes theorem, and basic and multi-attribute utility theories. The course uses these concepts to build analytical decision-making models considering the randomness and/or risk-attitude of the decision-makers. Various forms of decision analysis techniques will be covered and typically include, expected utility maximization, the value of information analysis, one/two-way sensitivity analysis, and sequential Bayesian inference. Practical uses and limitations of the models and techniques will be illustrated.",
        "title": "Decision Making Under Uncertainty"
    },
    {
        "code": "MSE 454",
        "description": "Technical entrepreneurship is examined considering the role of independent business, entrepreneurial behaviour, types of business and enterprises, business structure, sources of venture concepts and capital, company operation and control, and business start up.",
        "title": "Technical Entrepreneurship"
    },
    {
        "code": "MSE 491",
        "description": "A work-term report is a written report that provides an opportunity for students to effectively communicate, document, and reflect on engineering experience gained during a preceding work term. In the report, students draw connections between the theoretical aspects of engineering taught in the classroom and the practical applications of that theory in the workplace. Reports are due on the tenth day of lectures for the academic term in which the report is required.",
        "title": "Work-Term Report"
    },
    {
        "code": "MSE 531",
        "description": "This course builds on the material covered in MSE431. Students will learn how to construct and analyze a range of stochastic decision models that are useful in the design and control of a wide variety of systems. Applications areas include the design of inventory control systems, telecommunication networks, healthcare polices, manufacturing control, and reliability analysis. Topics include Renewal-Reward Processes, Markov Decision Processes, Matrix Analytic Methods with application areas noted above.",
        "title": "Stochastic Processes and Decision Making"
    },
    {
        "code": "MSE 541",
        "description": "This course provides an opportunity for students to learn the engineering behind search engines and how to optimize search engines to provide higher quality user experiences. This course focuses on text retrieval and web search. Topics include design and construction of retrieval systems, retrieval models, and evaluation of search engines.",
        "title": "Search Engines"
    },
    {
        "code": "MSE 543",
        "description": "This course provides students with an in-depth understanding of methods for evaluating the user experience on a large scale. Students will learn how to design user experiments that involve the collection and analysis of large quantities of data online, apply useful metrics for evaluating the user experience, and use this analysis to inform their designs of software and technology.",
        "title": "Analytics and User Experience"
    },
    {
        "code": "MSE 546",
        "description": "This course provides a deeper understanding of machine learning (ML) techniques by utilizing students' prior background in ML and operations research to understand the drivers of ML methodologies rather than using black-box processes. The course first reviews supervised and unsupervised learning methods, and then dives deeper into their assumptions, mathematical models, and underlying algorithms to help students systematically develop and enhance ML processes. Using the same approach, the course covers more advanced topics in ML, such as neural networks and reinforcement learning. Application areas within this course may include, but are not limited to healthcare, energy, sports, transportation, and manufacturing.",
        "title": "Advanced Machine Learning"
    },
    {
        "code": "MSE 551",
        "description": "The course focuses on the analysis, evaluation, and improvement of quality based on statistical tools. Topics include process capability analysis, statistical process control, experimental design and the Taguchi method, and acceptance sampling. The emphasis is on the assessment of quality and the design of alternate processes and/or quality assessment schemes to improve quality.",
        "title": "Quality Management and Control"
    },
    {
        "code": "MSE 555",
        "description": "Scheduling is the sequencing of tasks to scarce resources. By exploring scheduling problems found in industry, this course will discuss scheduling framework and notation as well as algorithmic, heuristic, and mathematical programming solution approaches. Students will be introduced to the theoretical background in these areas, but the emphasis will be placed on modelling and solving scheduling problems in practice. Students will apply these concepts in design activities in assignments and a course project.",
        "title": "Scheduling: Theory and Practice"
    },
    {
        "code": "MSE 597",
        "description": "A complementary studies course on advanced topics in management science and engineering will be offered when resources are available. For current offerings, see the Course Selection Offerings List or the Schedule of Classes.",
        "title": "Complementary Studies Topics in Management Science and Engineering"
    },
    {
        "code": "MSE 598",
        "description": "A course on advanced topics in management engineering will be offered when resources are available. For current offerings, see the Course Selection Offerings List or the Schedule of Classes.",
        "title": "Special Topics in Management Engineering"
    },
    {
        "code": "MTE 100",
        "description": "An introduction to mechatronics engineering and the engineering profession. Topics include the design process, project planning, data presentation, measurements and error, control logic, sensors and actuators, and intellectual property. Engineering graphics fundamentals of multi-view, isometric, oblique, and perspective projections are also covered while developing skills in computer-aided drawing (CAD), freehand sketching, and the interpretation of technical drawings. Professional development including rsum skills, interview skills, and preparation for co-op terms. A mechatronic design project/competition with small groups supplements the lecture material.",
        "title": "Mechatronics Engineering"
    },
    {
        "code": "MTE 111",
        "description": "The relevance of materials to engineering practice; the relationships between macroscopic physical properties (including mechanical, photonic, thermal, electrical, and magnetic properties) and microscopic causes based on fundamental principles (including electronic and atomic structures, atomic bonding, crystal structure, and microstructure); description of the differences in macroscopic physical properties of metals, polymers, ceramics, semiconductors, and composite materials in terms of microscopic causes.",
        "title": "Structure and Properties of Materials"
    },
    {
        "code": "MTE 119",
        "description": "Basic concepts of mechanics, vectors. Statics of particles. Rigid bodies and force systems, equilibrium of rigid bodies. Analysis of trusses and frames. Distributed forces, centroids, and moments of inertia. Friction. Internal shear and bending moments in beams.",
        "title": "Statics"
    },
    {
        "code": "MTE 120",
        "description": "Basic electromagnetic theory; magnetic circuits; electric circuit elements; DC circuit analysis; first-order transient response; AC circuit analysis. [Offered: W,S]",
        "title": "Circuits"
    },
    {
        "code": "MTE 121",
        "description": "Introduction to electronic digital computers, hardware and software organization, examples of efficient numerical algorithms for basic scientific computations.",
        "title": "Digital Computation"
    },
    {
        "code": "MTE 140",
        "description": "This course emphasizes the following topics: structured software design data structures, abstract data types, recursive algorithms, algorithm analysis and design, sorting and searching, hashing, and problem-solving strategies.",
        "title": "Algorithms and Data Structures"
    },
    {
        "code": "MTE 182",
        "description": "Kinematic of particles, rectilinear and curvilinear motion. Kinetics of particles. Energy and momentum methods. Systems of particles. Kinematics and kinetics of rigid bodies; planar motion.",
        "title": "Dynamics"
    },
    {
        "code": "MTE 201",
        "description": "Measurement errors, calculations with unknown quantities, and error propagation. Sensitivity analysis. Techniques of sampling and statistical estimation. Introduction to sensors and data acquisition tools. Frequency distributions. Probability. Binomial, Poisson, normal distributions. Tests of hypotheses. Significance. The t-test and chi-squared test. Curve fitting by least squares. Correlation and regression. Design of experiments.",
        "title": "Experimental Measurement and Statistical Analysis"
    },
    {
        "code": "MTE 202",
        "description": "First order differential equations; direction field; separable equations, integrating factors and simple transformations; applications; second and higher order ODE's with constant coefficients - transient and steady state solutions; The Laplace Transform; systems of equations - reduction to single equation; matrix differential equations; introduction to partial differential equations.",
        "title": "Ordinary Differential Equations"
    },
    {
        "code": "MTE 203",
        "description": "Review of vectors and vector operations; 3-D analytic geometry and space curves; multivariable calculus, including partial differentiation, total differential, chain rule, directional derivative, gradient operator, maxima and minima; multiple integrals - surface area, volume, and moments of inertia; line and surface integrals; vector theorems; complex analysis including limits, analytic functions, complex line integral, Cauchy's Integral Formula; Fourier Series (real and complex) and Fourier Integrals.",
        "title": "Advanced Calculus"
    },
    {
        "code": "MTE 204",
        "description": "Number systems and machine errors; roots of non-linear equations; matrix calculations; Eigenvalue and Eigenvector calculations; interpolation and approximation; numerical integration and solution of ODE's (linear and non-linear) and systems of ODEs; calculation of series; solution methods for PDE's; use of numeric and symbolic computing tools.",
        "title": "Numerical Methods"
    },
    {
        "code": "MTE 219",
        "description": "Introduction to mechanical response of materials and stress-strain relationships. Behaviour of prismatic members in tension, compression, shear, bending and torsion. Stress and strain transformations. Virtual work and energy methods.",
        "title": "Mechanics of Deformable Solids"
    },
    {
        "code": "MTE 220",
        "description": "Review of circuit theory; input-output relationships, transfer functions and frequency response of linear systems; operational amplifiers, operational amplifier circuits using negative or positive feedback; diodes, operational amplifier circuits using diodes; analog signal detection, conditioning and conversion systems; transducers and sensors, difference and instrumentation amplifiers, active filters.",
        "title": "Sensors and Instrumentation"
    },
    {
        "code": "MTE 241",
        "description": "Introduction to computer organization, basic real-time concepts, process management, interprocess communication and synchronization, memory management, resource management, interrupt handling, concurrent programming, file systems.",
        "title": "Introduction to Computer Structures and Real-Time Systems"
    },
    {
        "code": "MTE 252",
        "description": "Models and analysis of linear systems. Discrete time systems, continuous time systems; difference and differential equations; impulse and frequency response. Complex frequency, functions of complex variable transform domain techniques: Z transforms; Fourier analysis, Laplace transform. Transfer functions and frequency response, frequency domain analysis of linear systems; sample theory, stability, and linear filters.",
        "title": "Linear Systems and Signals"
    },
    {
        "code": "MTE 262",
        "description": "Number systems, logic gates, Boolean algebra. Karnaugh maps, and\ncombinational logic design. Implementation of combinational and sequential logic circuits on Field Programmable Gate Arrays (FPGA) boards. Sequential logic and state machines. Programmable Logic Controllers (PLCs) and PLC programming using ladder. Laboratory work includes FPGA and PLC programming. [Offered: F,W]",
        "title": "Introduction to Digital Logic"
    },
    {
        "code": "MTE 309",
        "description": "Macroscopic approach to energy analysis. Energy transfer as work and heat, and the First Law of thermodynamics. Properties and states of simple substances. Control-mass and control-volume analysis. The essence of entropy, and the Second Law of thermodynamics. The Carnot cycle and its implications for practical cyclic devices. Introduction to heat transfer by conduction, convection, and radiation. Basic formulation and solution of steady and transient problems. Issues relevant to the cooling of electrical devices.",
        "title": "Introduction to Thermodynamics and Heat Transfer"
    },
    {
        "code": "MTE 320",
        "description": "Review of circuit analysis and basic electromagnetic theory. Power electronics: power electronics circuits, H bridges, PWM control, interfacing, power amplifiers. DC servo and stepper motors, AC synchronous and induction motors. Transformers. Introduction to typical speed and torque control techniques of motors.",
        "title": "Actuators and Power Electronics"
    },
    {
        "code": "MTE 321",
        "description": "Principles of the geometry and motion in linkages and mechanisms. Computer-aided kinematic and kinetic analysis of mechanisms. Synthesis of mechanisms. Static failure and yield criteria in ductile and brittle materials. Fatigue failure criteria due to fluctuating stresses. Shaft design under static and fluctuating loads. Shaft components, including shoulders, keys, and keyways. Deflections in shafts.",
        "title": "Design and Dynamics of Machines"
    },
    {
        "code": "MTE 322",
        "description": "Integrated design of mechanical motion transmission systems: gearing, couplings, bearings, power screws, fasteners, and their integration; sensing and measurement of mechanical motion; specification and selection of motors and electromechanical actuators; analysis and design of controllers for motion transmission systems; case studies.",
        "title": "Electromechanical Machine Design"
    },
    {
        "code": "MTE 325",
        "description": "Synchronization and data flow; interfacing to sensors and actuators;\nparallel, serial, and analog interfacing; buses; direct memory access (DMA); interfacing considerations; privacy and security considerations. [Offered: W,S]",
        "title": "Microprocessor Systems and Interfacing for Mechatronics Engineering"
    },
    {
        "code": "MTE 351",
        "description": "Introduction to systems modelling and analysis. Graph theoretic models and formulation of system equations. State space formulation and solution. Time and frequency domain solution. Application to engineering systems.",
        "title": "Systems Models 1"
    },
    {
        "code": "MTE 352",
        "description": "Physical properties of fluids and fundamental concepts in fluid mechanics. Hydrostatics. Conservation laws for mass, momentum, and energy. Flow similarity and dimensional analysis as applied to engineering problems in fluid mechanics. Laminar and turbulent flow. Engineering applications such as flow measurement, flow in pipes, and fluid forces on moving bodies.",
        "title": "Fluid Mechanics 1"
    },
    {
        "code": "MTE 360",
        "description": "Feedback control design and analysis for linear dynamic systems with emphasis on mechanical engineering applications; transient and frequency response; stability; system performance; control modes; state space techniques; introduction to digital control systems.",
        "title": "Automatic Control Systems"
    },
    {
        "code": "MTE 380",
        "description": "In this course, students study the design process, including needs analysis, problem definition; design criteria and critical parameter identification, generation of alternative solutions; conceptual design, detailed design, optimization; and implementation. Most of the term is devoted to a significant design project in which student groups work independently and competitively, applying the design process to a project goal set by the faculty coordinator. The design project typically includes construction of an electro-mechanical prototype, and part of the course grade may depend on the performance of the prototype in a competitive test. In exceptional circumstances, the requirement for a prototype may be replaced by a computer simulation, or may be waived.",
        "title": "Mechatronics Engineering Design Workshop"
    },
    {
        "code": "MTE 420",
        "description": "Analysis, design and control of power electronic converters, principles of operation and control of DC and special-purpose motors, power electronics-based control of DC and special-purpose motors.",
        "title": "Power Electronics and Motor Drives"
    },
    {
        "code": "MTE 421",
        "description": "An introduction to analog transistor-level circuits, including metal-oxide-semiconductor (MOS) single, differential, and multistage amplifiers, cascode configurations, current mirrors, active loads, and frequency limitations. An introduction to digital transistor-level design, including MOS static and dynamic behavior, complementary MOS (CMOS) inverters, combinational and sequential circuit design, arithmetic circuits, and clocking and timing considerations. Students complete a project using industry standard integrated circuit schematic and layout tools.",
        "title": "Introduction to Analog and Digital Transistor-Level Design"
    },
    {
        "code": "MTE 460",
        "description": "Mechatronic system interfaces and architecture design. Sensing and actuation in industrial mechatronics systems. Motion control. Industrial computer vision. Networks and communication. PLC based and distributed control. Discrete and hybrid control systems. Fault finding.",
        "title": "Mechatronic System Integration"
    },
    {
        "code": "MTE 482",
        "description": "This course is an extension of MTE481. Students work on prototyping the designs they proposed and finalized in MTE481. The students either individually or in small groups demonstrate the working prototypes; make a poster presentation for the design competition; and pitch their product on a website. The projects are monitored by the course instructor and evaluated by the instructor with feedback from an expert judging panel.",
        "title": "Mechatronics Engineering Project"
    },
    {
        "code": "MTE 484",
        "description": "Dynamic system modelling: linear, nonlinear, state-space, sample data systems, computer simulation, system identification. Discrete system stability and dynamic performance. Nonlinear system analysis, limit cycles. Digital control system design: emulation methods, z-domain, frequency domain, pole placement. Implementation of digital controllers. Laboratory projects in computer control of mechatronic and other systems.",
        "title": "Control Applications"
    },
    {
        "code": "MTE 544",
        "description": "Fundamentals of autonomous mobile robotics, including both perception and planning for autonomous operation, sensor modelling, vehicle state estimation using Bayes Filters, Kalman Filters, and Particle Filters as well as onboard localization and mapping. Topics in planning include vehicle motion modelling and control, as well as graph based and probabilistic motion planning of (Micro Electro Mechanical Systems) MEMS devices.",
        "title": "Autonomous Mobile Robots"
    },
    {
        "code": "MTE 545",
        "description": "Introduction to MEMS. Fabrication processes for MEMS devices. Basic MEMS governing equations in different energy domains (mechanical, electrical, and thermal). Methods for layout, design, and modelling of MEMS devices. Simulation techniques. Techniques for testing and characterization of MEMS devices.",
        "title": "Introduction to MEMS Fabrication"
    },
    {
        "code": "MTE 546",
        "description": "Sensor data and information fusion systems. Sensor modelling, including characterization of uncertainty. Sensor fusion approaches for estimation and decisions including weighted least squares, extended Kalman Filter, Dempster-Shafer evidential reasoning, artificial neural networks; Outlier rejection; Spatial and temporal registration. Course project involving independent study of one aspect of sensor data fusion.",
        "title": "Multi-Sensor Data Fusion"
    },
    {
        "code": "MTE 597",
        "description": "Various topics at the undergraduate level in mechatronics engineering with a focus on software systems. Courses offered when resources permit.",
        "title": "Special Topics in Mechatronics Engineering: Software Systems"
    },
    {
        "code": "MTE 598",
        "description": "Various topics at the undergraduate level in mechatronics engineering with a focus on hardware systems. Courses offered when resources permit.",
        "title": "Special Topics in Mechatronics Engineering: Hardware Systems"
    },
    {
        "code": "MTE 599",
        "description": "Various topics at the undergraduate level in automation, process control, robotics, autonomous and intelligent systems, and electromechanical design. Courses offered when resources permit.",
        "title": "Special Topics in Mechatronics Engineering: Mechanical Systems"
    },
    {
        "code": "NE 100",
        "description": "An introduction to nanotechnology engineering and its various applications from electronics to biology. Basic concepts related to nanomaterials and devices, fabrication approaches, and characterization methods. Introduction to engineering iterative design, computer aided design (CAD) and modelling. Application of CAD methods in relevant nanotechnology engineering problems. Engineering report preparation skills.",
        "title": "Introduction to Nanotechnology Engineering"
    },
    {
        "code": "NE 102",
        "description": "Introduction to types of nanomaterials hazards their identification, toxicity, and characterization; exposure health-risk assessment; cancer and non-cancer risks. Areas of research and professional practice in nanotechnology engineering; exposure to concepts from other engineering plans; support material for the 1B academic term, including aspects of co-operative education and professional or career development. ",
        "title": "Introduction to Nanomaterials Health Risk; Nanotechnology Engineering Practice"
    },
    {
        "code": "NE 109",
        "description": "Nanotechnology in society; health and environmental sustainability; introduction to environmental life cycle assessments; engineering ethics, policies, and regulations; Canadian legal system, tort, and intellectual property; examples of nanotechnology innovation and commercialization.",
        "title": "Societal and Environmental Impacts of Nanotechnology"
    },
    {
        "code": "NE 110",
        "description": "Nanomaterial impacts on worker, consumer, and environmental health. Engineered nanomaterials and ultrafines. Chemical risk assessment. Nanomaterial exposure characterization. Introductory nanotoxicology. Environmental chemical impacts, transport, and bio-accumulation. Introduction to UN Sustainable Development Goals. Human nanomaterial health risks and benefits. Introductory epidemiology, including study design, strength of association, bias, confounding, and causal inference.",
        "title": "Introduction to Nanomaterials Health Risks"
    },
    {
        "code": "NE 111",
        "description": "Introduction to programming and numerical computing using a high-level interpreted programming language. Programming fundamentals, computer architecture, design and use of functions, strings and text input/output, relational operators, conditionals, lists, loops, designing algorithms, numerical computing, plotting, and file input/output.",
        "title": "Introduction to Programming for Engineers"
    },
    {
        "code": "NE 112",
        "description": "Matrices, operations on matrices. Determinants. Adjoints and inverses. Solution of linear equations: elimination and iterative methods. Eigenvalues and eigenvectors with engineering applications. Complex numbers.",
        "title": "Linear Algebra for Nanotechnology Engineers"
    },
    {
        "code": "NE 113",
        "description": "Spreadsheets for problem solving, plotting, fitting data. Problem solution plotting, and creating complex programs in an engineering prototypical programming environment. Elementary numerical methods: Taylor-series summations, roots of equations, roots of polynomials, direct and indirect solution methods for systems of linear, and nonlinear algebraic equations, integration. Applications in nanotechnology engineering.",
        "title": "Introduction to Computational Methods"
    },
    {
        "code": "NE 121",
        "description": "Chemical reactions. Mass and charge balance. Introduction to the first, second, and third laws of thermodynamics. Chemical equilibrium. Applications of chemical equilibrium principles to proton-transfer reactions. Electronic structure of atoms and molecules. Periodicity and chemical bonding.",
        "title": "Chemical Principles"
    },
    {
        "code": "NE 125",
        "description": "Fundamentals of crystalline structure, crystal defects, and noncrystallinity. Structure and properties of metals, ceramics, glasses, amorphous materials, polymers, and composites. Processing and concepts of engineering design of materials.",
        "title": "Introduction to Materials Science and Engineering"
    },
    {
        "code": "NE 131",
        "description": "A first course in physics that introduces basic topics in classical mechanics, wave mechanics, and physical optics.",
        "title": "Physics for Nanotechnology Engineering"
    },
    {
        "code": "NE 140",
        "description": "Charge, current, and voltage. Resistance, Ohm's Law, Kirchhoff's voltage, and current laws. Nodal, mesh analysis, and source transformation. Superposition, Thvenin, and Norton equivalents. Capacitance, inductance, electrical energy dissipation, and first-order transient response circuits. Phasors, impedances, and alternating current (AC) steady state analysis. Ideal operational amplifier circuits. Frequency filter types, and active filter circuits' configuration. Introduction to the fundamentals of electronic waste recycling.",
        "title": "Linear Circuits"
    },
    {
        "code": "NE 201",
        "description": "Nanotoxicology, including inhalation and dermal exposure effects; translocation, cytotoxicity, mutagenicity, and neurotoxicity; carbon nanotubes as cancer hazards. Areas of research and professional practice in nanotechnology engineering; exposure to concepts from other engineering plans; support material for the 2A academic term, including aspects of co-operative education and professional or career development.",
        "title": "Nanotoxicology; Nanotechnology Engineering Practice"
    },
    {
        "code": "NE 202",
        "description": "Environmental fate and behaviour, bio-availability, consumer exposure, environmental exposure-assessment, aquatic toxicology, bio-accumulation and biomagnification. Areas of research and professional practice in nanotechnology engineering; exposure to concepts from other engineering plans; support material for the 2B academic term, including aspects of co-operative education and professional or career development.",
        "title": "Nanomaterials and Environmental Impact; Nanotechnology Engineering Practice"
    },
    {
        "code": "NE 215",
        "description": "Elementary probability theory. Random variables and distributions. Binomial, Poisson, and normal distributions. Elementary sampling. Statistical estimation. Tests of hypotheses and significance. Regression. Goodness-of-fit tests. ",
        "title": "Probability and Statistics"
    },
    {
        "code": "NE 216",
        "description": "Ordinary differential equations with constant coefficients. Boundary value problems and applications to quantum mechanics. Laplace and Fourier transforms, Fourier series and applications. Numerical solution of ordinary differential equations.",
        "title": "Advanced Calculus and Numerical Methods 1"
    },
    {
        "code": "NE 217",
        "description": "Gradient, divergence and curl: applications. Line and surface integrals. Green's, Gauss', and Stokes' Theorems: Applications to electromagnetism and fluid mechanics. Numerical solution of partial differential equations.",
        "title": "Advanced Calculus and Numerical Methods 2"
    },
    {
        "code": "NE 220L",
        "description": "Labs following the NE125 (Introduction to Materials Science and Engineering) course. This laboratory course introduces students to techniques for the characterization of various materials, such as metals, polymers, ceramics, and composites. Experimental exercises will study the physical properties and characteristics of materials, including mechanical, thermal, electrical, and structural/morphological properties at different length scales.",
        "title": "Materials Science and Engineering Laboratory"
    },
    {
        "code": "NE 222",
        "description": "Nomenclature, stereochemistry, and reactions of important classes of organic compounds. Reaction mechanisms and energetics. Aromaticity and simple molecular orbital theory of conjugated systems. Applications to nanomaterials and/or devices.",
        "title": "Organic Chemistry for Nanotechnology Engineers"
    },
    {
        "code": "NE 225",
        "description": "Electronic orbitals in atoms, molecules and the solid state. Structures and properties of covalent and ionic solid nanoparticles including their catalytic, electrochemical, electrical, optical and magnetic properties. Semiconductors and carbon/silicon-based nanoparticles. Examples discussed include carbon nanoparticles, dendrimers, micelles, and quantum dots.",
        "title": "Structure and Properties of Nanomaterials"
    },
    {
        "code": "NE 226",
        "description": "Materials structure analysis. Materials composition and chemical bonding analysis. In-situ analysis and monitoring of fabrication process parameters. Materials properties characterization.",
        "title": "Characterization of Materials"
    },
    {
        "code": "NE 226L",
        "description": "This laboratory course introduces students to six materials characterization techniques employed routinely by nanotechnology engineers in their practices. Specifically, the six techniques are: Fourier-Transform Infrared (FTIR), Raman light-scattering, and ultra-violet and visible (UV-Vis) spectroscopies, ellipsometry, X-ray diffraction (XRD), and scanning electron microscopy (SEM). This course is intended to familiarize students with the instrumentation involved, prior to its application to nanomaterials in a follow-up laboratory course, NE320L.",
        "title": "Laboratory Characterization Methods"
    },
    {
        "code": "NE 241",
        "description": "Coulomb's law, electric field and electric flux, Gauss's law, electric potential, potential and field, magnetic field, Ampere's law, solenoid, electromagnetic induction, magnetic flux, Lenz' law, Faraday's law, capacitors and capacitance, inductors and inductance, Maxwell's equations, electromagnetic fields and waves, polarization.",
        "title": "Electromagnetism"
    },
    {
        "code": "NE 242",
        "description": "Introduction to the physical principles and electrical behaviour of semiconductor materials and devices: electronic band structure, charge carriers, doping, carrier transport, pn-junctions, metal-oxide-semiconductor capacitors, transistors, and related optoelectronic devices (photodetectors, light emitting diodes, solar cells).",
        "title": "Semiconductor Physics and Devices"
    },
    {
        "code": "NE 281",
        "description": "Introduction to cell biology. Cell structure and components. Critical molecular processes of living organisms. Applications to nanobiotechnology.",
        "title": "Biology for Nanotechnology Engineers"
    },
    {
        "code": "NE 301",
        "description": "Detoxification and bioactivation pathways; surface modification; biopersistence; quantum dots and cellular imagining; biomedical applications of nanomaterials. Areas of research and professional practice in nanotechnology engineering; exposure to concepts from other engineering plans; support material for the 3A academic term, including aspects of co-operative education and professional or career development.",
        "title": "Nanomaterials and Human Risks, Benefits; Nanotechnology Engineering Practice"
    },
    {
        "code": "NE 307",
        "description": "Introduction to the engineering design process: problem definition and needs analysis; process synthesis, analysis, optimization and troubleshooting; safety and environmental protection in design; written and oral communication for design reports. Students form four-person design teams and start a team-oriented project based on the knowledge and skills acquired in previous courses and on co-operative work terms, culminating in a design proposal presentation.",
        "title": "Introduction to Nanosystems Design"
    },
    {
        "code": "NE 318",
        "description": "Tensor operations. Kinematics of a continuum: material and spatial frames, strain and displacement, conservation of mass. Stress, conservation of momentum, energy, and mass. Linear elastic solids: Hooke's Law, infinitesimal elasticity theory. Introduction to Newtonian viscous fluids: hydrostatics, Navier-Stokes equations, flow regimes, and the Reynolds number. Engineering applications in anisotropy, heat transfer, and fluid mechanics will be discussed.",
        "title": "Continuum Mechanics for Nanotechnology Engineering"
    },
    {
        "code": "NE 320L",
        "description": "Follow-up labs associated with the NE226 (Characterization of Materials) course. The laboratory exercises focus upon the synthesis and characterization of nano-based materials. Specifically, the synthesis of carbon nanotubes, quantum dots, magnetic ceramics, or other common nanomaterials will be investigated, and sample preparations for various characterization tools will be carried out. Characterization techniques such as infrared and Raman spectroscopy, x-ray diffraction, scanning electron microscope (SEM), and magnetic inductive heating will be utilized.",
        "title": "Characterization of Materials Laboratory"
    },
    {
        "code": "NE 330L",
        "description": "Lab exercises exploring the synthesis and characterization of polymers, copolymers, and soft nanomaterial structures.",
        "title": "Macromolecular Science Laboratory"
    },
    {
        "code": "NE 332",
        "description": "Historical background; the differential equation approach to quantum mechanics; treatments of solvable problems such as the particle-in-a-box, harmonic oscillator, rigid rotor, and the hydrogen atom; introduction to approximation methods for more complex systems; application to solid state problems, including band theory.",
        "title": "Quantum Mechanics"
    },
    {
        "code": "NE 333",
        "description": "Basic definitions, polymer types and nomenclature, molecular weight averages and distributions, structure and properties. Chemical kinetics, step-growth and free-radical chain-growth polymerizations, polymer recycling and sustainable design.",
        "title": "Macromolecular Science"
    },
    {
        "code": "NE 334",
        "description": "Statistical mechanics vs. thermodynamics. Review of statistical concepts. Canonical and grand canonical ensembles. Entropy. General formulation of statistical thermodynamics. Fermi-Dirac, Bose-Einstein, and Boltzmann statistics. Quantum ideal gases. Specific heat of solids. Electrons in metals and semiconductors. Radiation: the photon gas.",
        "title": "Statistical Thermodynamics"
    },
    {
        "code": "NE 335",
        "description": "Introduction to the applications of macromolecules in nanotechnology. Block copolymers and self-assembled polymerization. Micelles and colloids. Dendrimers and molecular brushes. Supramolecular polymers, polymeric blends, and macromolecular nanocomposites. Polymer templates. Applications in the manufacturing of nanostructured materials and nanoscale devices.",
        "title": "Soft Nanomaterials"
    },
    {
        "code": "NE 336",
        "description": "Modelling and simulation. Lumped versus distributed approaches. Review of differential-equation systems, constitutive relations, boundary conditions, and solvers for complex, coupled transport problems pertinent to micro and nanosystems. Coupling strategies. Numerical schemes for nonlinear systems. Basic modelling and simulation of micro and nanosystems, and fluidic systems. Relevant nanotechnology applications: optical, thermal, mechanical, and fluidic microstructures, and nanoscale devices.",
        "title": "Micro and Nanosystem Computer-Aided Design"
    },
    {
        "code": "NE 343",
        "description": "Key processes for electronic device fabrication. Single crystal growth. Substrate preparation. Homoepitaxy, heteroepitaxy, and molecular-beam epitaxy. Ion implantation. Oxidation and diffusion. Physical and chemical vapor deposition. Sputtering and evaporation. Etching. Micromachining. Spin coating and printing. Photolithography. Effects of device scaling on chip performance. Process integration. Yield and reliability.",
        "title": "Microfabrication and Thin-Film Technology"
    },
    {
        "code": "NE 344",
        "description": "Metal-oxide-semiconductor field-effect transistor (MOSFET), circuit biasing and load-line analysis. Small-signal equivalent circuits and single stage amplifier configurations. Differential and multistage MOSFET amplifiers. The cascode configuration, current mirror and active loads. Feedback circuit configurations and stability. Oscillators, waveform shaping circuits and delay analysis. Introduction to digital circuits, the transistor switch, inverter circuits and complementary metal-oxide-semiconductor (CMOS) logic circuits.",
        "title": "Electronic Circuits"
    },
    {
        "code": "NE 345",
        "description": "Wave nature of light, refractive index and dispersion, group velocity, irradiance and Poynting vector, Snell's law, Fresnel's Equation, antireflection coatings, absorption of light, temporal and spatial coherence, dielectric waveguides and optical fibers, planar waveguides, dispersion in waveguides; light emitting diodes (LED), pn junction, LED materials, stimulated emission, lasers, photodetectors, photovoltaic devices, solar cells.",
        "title": "Photonic Materials and Devices"
    },
    {
        "code": "NE 352",
        "description": "Surfaces and interfaces in microelectronics and nanofabrication. Physicochemistry of interfaces. Capillary phenomena and molecular self-assembly. Structure and properties of clean and adsorbate covered surfaces (metals, semiconductors, oxides). Reactions at surfaces and catalysis. Surface electrochemistry, growth and diffusion, nanoscale structure formation/surface patterning, biological interfaces.",
        "title": "Surfaces and Interfaces"
    },
    {
        "code": "NE 353",
        "description": "Theory and application of nanoprobing based on scanning probe microscopy (scanning tunneling microscopy, atomic force microscopy, scanning near-field optical microscopy). Nanolithographic techniques (extreme-UV lithography, X-ray lithography, e-beam lithography, focused ion beam lithography, nano-imprint lithography and soft lithography).",
        "title": "Nanoprobing and Lithography"
    },
    {
        "code": "NE 380L",
        "description": "This laboratory course introduces students to biotechnology topics including bacterial transformations, isolation of plasmids, biomacromolecule analysis, polymerase chain reaction (PCR), and design of nanobiosensors and encapsulation techniques for drug delivery.",
        "title": "Nanobiotechnology Engineering Laboratory"
    },
    {
        "code": "NE 381",
        "description": "Molecular biology and biochemistry required for the engineering of nanobiotechnological applications. Structure and characterization of nucleic acids, proteins, and lipids. Introduction to lab-on-chip systems and microfluidic devices. Application to medical diagnostics, protein and nucleic acid tools including polymerase chain reaction and blotting techniques. Elements of design required for the development of modern instrumentation and biosensors.",
        "title": "Introduction to Nanoscale Biosystems"
    },
    {
        "code": "NE 451",
        "description": "This course provides an introduction to and an overview of computational methods that are currently employed for the simulation of structural and bulk properties of matter, particularly as applied to physical and biological systems at the nanometer scale. Topics to be covered in this course include energy functions and force fields, geometry optimization, normal mode analysis, and reaction--path techniques at the molecular level, and an introduction to the simulation of static and dynamic properties of substances via both Monte Carlo and molecular dynamics (MD) methodologies.",
        "title": "Simulation Methods"
    },
    {
        "code": "NE 452",
        "description": "Topics in this theme area may include: an overview of modern computational methods and algorithms in nanoscale materials, such as steered molecular dynamics, ab initio molecular dynamics, multiscale modelling, dissipative particle dynamics, transition path sampling, phase-field modelling, quantum simulations using Feynman path integral techniques, condensed-phase spectroscopy, linking of simulations to experiment, simulations and their practical applications.",
        "title": "Special Topics in Nanoscale Simulations"
    },
    {
        "code": "NE 453",
        "description": "Special topics that significantly span two (or more) areas of concentration in or that provide methodologies relevant to nanotechnology engineering will be offered from time to time when resources are available.",
        "title": "Special Topics in Nanotechnology Engineering"
    },
    {
        "code": "NE 454A",
        "description": "Application of experimental tools and techniques in nano-electronics. Experimental exercises may involve circuit simulation and design, circuit prototyping, design of a driver circuit for a quartz crystal microbalance (QCM), printed circuit board (PCB) design and layout optimization, and the use of various characterization instrumentation.",
        "title": "Nano-Electronics Laboratory 1"
    },
    {
        "code": "NE 454B",
        "description": "Application of experimental tools and techniques involved in nanotechnology. Experimental exercises may involve simulation, design, optimization of micro-electro-mechanical-system (MEMS) devices, and the generation of a mask layout.",
        "title": "Nano-Instrumentation Laboratory 1"
    },
    {
        "code": "NE 454C",
        "description": "Application of experimental tools and techniques in nanobiotechnology. Experimental exercises may involve simulation and design, optimization, nanoparticle formulation reactions, microfluidics, and the use of various characterization instrumentation.",
        "title": "Nanobiosystems Laboratory 1"
    },
    {
        "code": "NE 454D",
        "description": "Application of experimental tools and techniques in nanomaterials. Experimental exercises may involve design, use of image analysis software, optimization, electrodeposition, encapsulation and templating, synthetic chemistry protocols, and the use of selected characterization instrumentation.",
        "title": "Nanostructured Materials Laboratory 1"
    },
    {
        "code": "NE 455A",
        "description": "Application of experimental tools and techniques in nano-electronics. Experimental exercises to complete the design cycle involve printed circuit board (PCB) assembly and soldering, measurement of the formation of a nonanethiol self- assembled monolayer, determination of the partition coefficient for a solvent vapour into a monolayer-protected-cluster film deposited on a quartz crystal microbalance (QCM), and the use of various characterization methods. These exercises also stress the safe handling of chemicals in the process.",
        "title": "Nano-Electronics Laboratory 2"
    },
    {
        "code": "NE 455B",
        "description": "Application of experimental tools and techniques employed in nanotechnology. Experimental exercises may involve microfabrication (photolithography, film deposition, and etching) and testing of micro-electro-mechanical-system (MEMS) devices based on the design from NE454B. These exercises also stress working safely in a clean-room environment.",
        "title": "Nano-Instrumentation Laboratory 2"
    },
    {
        "code": "NE 455C",
        "description": "Application of experimental tools and techniques employed in nanobiotechnology. Experimental exercises may involve investigation of microbial culture protocols, biosensor applications, and the use of various characterization techniques. These exercises also stress the need for safe handling of micro-organisms and biomaterials.",
        "title": "Nanobiosystems Laboratory 2"
    },
    {
        "code": "NE 455D",
        "description": "Application of experimental tools and techniques employed in nanomaterials. Experimental exercises may investigate and design the production and performance of electronic double layer capacitors (EDLC) for battery applications through the use of dispersion and mixing protocols to prepare carbon materials. Performance of the materials may be quantified using defined testing methods for measurement of electrical storage metrics. The exercise also stresses safe handling of nanomaterials.",
        "title": "Nanostructured Materials Laboratory 2"
    },
    {
        "code": "NE 459",
        "description": "A nanotechnology engineering research project that requires students to demonstrate initiative and to assume responsibility. Students will select projects at the end of the 4A term. Although students may propose their own projects, a faculty member will provide supervision. A project report is required at the end of the 4B term.",
        "title": "Nanotechnology Engineering Research Project"
    },
    {
        "code": "NE 461",
        "description": "Fabrication technology for development of micro and nanosensors, actuators, and modules (e.g., micro or, nano-electromechanical systems, micro or nanofluidics channels). Integration using examples drawn from chemical analysis micro and nano-instrumentation. An overview of current micro and nano-instrumentation.",
        "title": "Micro and Nano-Instrumentation"
    },
    {
        "code": "NE 466",
        "description": "Tactile sensors, wearable sensors and applications. Principles of transduction including capacitive, piezoelectric, piezoresistive, percolation, and tunneling-based sensing. Designing bendable and stretchable sensors, and self-powered sensors. Applications including robotics, electronic skin, biometrics, and bio-vitals.",
        "title": "Tactile Sensors and Transducers"
    },
    {
        "code": "NE 471",
        "description": "Transport phenomena. Quantum confinement. Single molecule transistors. Resonant tunnelling devices. Large area and mechanically flexible electronics. Deposition and patterning techniques.",
        "title": "Nano-Electronics"
    },
    {
        "code": "NE 476",
        "description": "Electronic structure of conjugated molecules. Photophysics of organic molecules, singlet and triplet states, the transition moment, radiative and non-radiative transitions. Excited state kinetics. Excitonic processes in organic solids, Forster and Dexter transfer, quenching processes. Electronic conduction in organic solids, band and hopping transport, morphological disorder and traps. Introduction to the main types of organic electronic devices, such as light-emitting devices, solar cells, field-effect transistors, photodetectors and imaging devices. Aspects of device design and fabrication technology.",
        "title": "Organic Electronics"
    },
    {
        "code": "NE 481",
        "description": "Overview of biomedical engineering principles. Formulation and manufacturing processes for production of nanoparticles for medical applications. Pharmacokinetics, toxicity, and human physiology in drug administration. Route of administration and controlled delivery strategies. Formulation and manufacturing process for drug delivery in the biotechnology and pharmaceutical industries.",
        "title": "Nanomedicine and Nanobiotechnology"
    },
    {
        "code": "NE 486",
        "description": "Introduction to biosensors. Chemical, optical, and pattern recognition-based sensing. Sensors for metal ions, small molecules, proteins, cancer cells. Deoxyribonucleic acid/ribonucleic acid (DNA/RNA) properties and chemical synthesis. DNA aptamer-based sensors and devices. Combinatorial selection of functional DNA. Applications in drug screening and diagnostics.",
        "title": "Biosensors"
    },
    {
        "code": "NE 487",
        "description": "Principles, design, and fabrication methods for biomedical devices. Techniques for disease diagnosis, including enzyme-linked immunosorbent assays, current state-of-the-art technologies, lab-on-a-chip devices and biosensors. Microfluidic device design and fabrication. Cleanroom fabrication, soft lithography, hot embossing, micro-milling, and testing.",
        "title": "Microfluidic and Nanobiotechnological Systems"
    },
    {
        "code": "NE 488",
        "description": "The course provides an overview of the recent advances in medicine and nano-technologies for development of tissue engineering and regenerative medicine. Strategies and technologies for designing, testing, and manufacturing of biomaterials and tissue-engineering products will be introduced. The biological and clinical applications will be discussed. The unmet medical needs, challenges in manufacturing, regulatory approval and commercialization for tissue engineering applications will also be discussed.",
        "title": "Biomaterials and Tissue Engineering"
    },
    {
        "code": "NE 491",
        "description": "Application of inorganic nanostructured materials and nanocomposites. Synthesis and processing techniques for inorganic nanomaterials and the devices that use them. Students will be required to provide critical analyses and seminar presentations of patents utilizing nanomaterials.",
        "title": "Nanostructured Materials"
    },
    {
        "code": "NE 496",
        "description": "Nanomaterials in electrochemical energy systems, electrochemical reactions, and cell potentials. Nernst equation. Electrode kinetics and mass transport. Electrochemical reactor design. Fuel cells, electrocatalytic reactions, and hydrogen economy. Rechargeable batteries. Design aspects of energy systems. Applications in hybrid and electric vehicles.",
        "title": "Nanomaterials for Electrochemical Energy Systems"
    },
    {
        "code": "SE 101",
        "description": "An introduction to some of the basic methods and principles used by software engineers, including fundamentals of technical communication, measurement, analysis, and design. Some aspects of the software engineering profession, including standards, safety and intellectual property. Professional development including rsum skills, interview skills, and preparation for co-op terms. Safety-orientation training, including WHMIS assessment, is included in this course.",
        "title": "Introduction to Methods of Software Engineering"
    },
    {
        "code": "SE 212",
        "description": "Formal logic. Proof systems and styles. Rudimentary model theory. Formal models of computation. Logic-based specification. Correctness proofs. Applications in software engineering.",
        "title": "Logic and Computation"
    },
    {
        "code": "SE 350",
        "description": "An introduction to the fundamentals of operating system function, and implementation. Topics include concurrency, synchronization, processes, threads, scheduling, memory management, file systems, device management, and security.",
        "title": "Operating Systems"
    },
    {
        "code": "SE 380",
        "description": "Introduction to control systems. Advantages of closed-loop feedback systems. The role of the system mathematical model. Block diagrams and signal flow graphs. The basic control system design problem, stability in control systems. Frequency response analysis techniques. Root-locus analysis. Elementary lead-lag compensation.",
        "title": "Introduction to Feedback Control"
    },
    {
        "code": "SE 463",
        "description": "Introduces students to the requirements definition phase of software development; models, notations, and processes for software requirements, identification, representation, analysis, and validation. Cost estimation from early documents and specifications. Students undertake a substantial customer-driven group project as part of SE490/SE491 design-project sequence covering all major phases of the software engineering life cycle; they decide on a project concept, complete a project-approval process, and develop high-level requirements for the project using all the tools covered in the course. Social, legal, and economic factors are considered.",
        "title": "Software Project Management, Requirements, and Analysis"
    },
    {
        "code": "SE 464",
        "description": "Introduces students to the design, implementation, and evolution phases of software development. Software design processes, methods, and notation. Implementation of designs. Evolution of designs and implementations. Management of design activities.",
        "title": "Software Design and Architectures"
    },
    {
        "code": "SE 465",
        "description": "Introduces students to systematic testing of software systems. Software verification, reviews, metrics, quality assurance, and prediction of software reliability and availability. Related management issues.",
        "title": "Software Testing and Quality Assurance"
    },
    {
        "code": "SE 498",
        "description": "See the course offerings list for topics available.",
        "title": "Advanced Topics in Software Engineering"
    },
    {
        "code": "SE 499",
        "description": "A software engineering project requiring the student to demonstrate initiative and assume responsibility. The student normally proposes their own project, which must involve substantial engineering science or engineering design. The student must find a faculty supervisor. A project report is required at the end of the term. Plan consent required.",
        "title": "Project"
    },
    {
        "code": "SYDE 101",
        "description": "This course introduces first-year students to systems design engineering with a focus on the engineering profession, and technical communication skills. Through in-class and independent activities leading to formative and summative assessments, students will consider and reflect on communication intention, audience, content, medium, format, and tone to demonstrate and improve upon their listening, written and oral communication skills for academic, engineering, and professional context.",
        "title": "Communications in Systems Design Engineering-Written and Oral"
    },
    {
        "code": "SYDE 101L",
        "description": "This laboratory course introduces students to visual communication methods relevant to engineering analysis and design. Through in-class and independent activities leading to formative and summative assessments, students will consider and reflect on communication intention, audience, content, medium, format, and level of detail to demonstrate and improve upon their skills in graphing, freehand sketching, technical drawing, and computer-aided design (CAD).",
        "title": "Communications in Systems Design Engineering-Visualization"
    },
    {
        "code": "SYDE 111",
        "description": "Differential calculus: limits, continuity, derivatives, differentials, applications. Sequences and series: convergence, power series, Taylor expansions. Simple numerical methods. Introduction to integration, indefinite and definite integral, techniques of integration.",
        "title": "Calculus 1"
    },
    {
        "code": "SYDE 112",
        "description": "Integration: improper integrals and applications. Multi-variable calculus: partial, total, and directional derivative, gradient divergence, double and triple integrals, Jacobian, solution techniques, applications.",
        "title": "Calculus 2"
    },
    {
        "code": "SYDE 113",
        "description": "Functions: trigonometric, exponential, log, inverse functions. Mathematical notation and proof techniques. Metric spaces. Geometry and algebra: root-finding, vectors, coordinate systems, lines and planes, conic sections, complex numbers. Introduction to numerical computation: binary and floating point numbers and arithmetic, accuracy and sources of error.",
        "title": "Elementary Engineering Mathematics"
    },
    {
        "code": "SYDE 114",
        "description": "Matrix algebra, inverses, solution of linear systems, determinants, eigenvalues and eigenvectors, lower-upper (LU) factorization. Numerical methods: sensitivity, condition number.",
        "title": "Matrices and Linear Systems"
    },
    {
        "code": "SYDE 121",
        "description": "Computer systems, problem solving, data and programs, structured programming, arrays, matrices and pointers, correct and efficient algorithms, data structures.",
        "title": "Digital Computation"
    },
    {
        "code": "SYDE 161",
        "description": "Multidisciplinary system design, the design process, problem definition, life-cycle design, design specification, concept/design generation and evaluation, design for manufacturing and assembly, system modelling and analysis, introduction to mechanical design, prototyping, safety and responsibility in engineering design, design documentation.",
        "title": "Introduction to Design"
    },
    {
        "code": "SYDE 162",
        "description": "Design of human-machine environments, design to reduce human error. Analytical methods of determining user needs in systems with humans. Information processing and human sensory processes and consideration of these elements in the design of systems with humans. Human physical capabilities and consideration of these in ergonomic design.",
        "title": "Human Factors in Design"
    },
    {
        "code": "SYDE 181",
        "description": "Basic concepts of mechanics, vectors. Statics of particles. Rigid bodies and force systems, equilibrium of rigid bodies. Analysis of trusses and frames. Distributed forces, centroids, and moments of inertia. Friction. Virtual work.",
        "title": "Physics 1: Statics"
    },
    {
        "code": "SYDE 182",
        "description": "Kinematics of particles, rectilinear and curvilinear motion. Kinetics of particles, application to space mechanics. Energy and momentum methods. Systems of particles. Kinematics and kinetics of rigid bodies; planar motion.",
        "title": "Physics 2: Dynamics"
    },
    {
        "code": "SYDE 192",
        "description": "Digital technology, combinatorial logic, binary arithmetic, synchronous sequential circuits, design methodology, algorithmic state machines, microcomputer interfacing.",
        "title": "Digital Systems"
    },
    {
        "code": "SYDE 192L",
        "description": "Laboratory experiments for students taking SYDE192.",
        "title": "Digital Systems Laboratory"
    },
    {
        "code": "SYDE 211",
        "description": "Vector differential calculus: divergence and curl, line and surface integrals, fundamental theorems, applications. First order ordinary differential equations: analytical techniques and applications. Second order linear ordinary differential equations: systems of equations and applications. Numerical methods for solving ordinary differential equations (ODEs).",
        "title": "Calculus 3"
    },
    {
        "code": "SYDE 212",
        "description": "Elementary probability theory. Random variables and distributions. Binomial, Poisson, and normal distributions. Elementary sampling. Statistical estimation. Tests of hypotheses and significance. Regression. Goodness-of-fit tests. Analysis of experimental measurements.",
        "title": "Probability and Statistics"
    },
    {
        "code": "SYDE 223",
        "description": "Algorithms and data structures emphasizes the following topics: structured software design, data structures, abstract data types, recursive algorithms, algorithm analysis and design, sorting and searching, hashing, problem-solving strategies and NP-completeness.",
        "title": "Data Structures and Algorithms"
    },
    {
        "code": "SYDE 252",
        "description": "Models and analysis of linear systems. Discrete time systems, continuous time systems; difference and differential equations; impulse and frequency response. Complex frequency, functions of complex variables, transform domain techniques: Z transforms; Fourier analysis, Laplace transform. Transfer functions and frequency response, frequency domain analysis of linear systems; sampling theory, stability, and linear filters.",
        "title": "Linear Systems and Signals"
    },
    {
        "code": "SYDE 261",
        "description": "This course will help students understand how others think about technology, and then use this knowledge to make better choices when designing. This impact course focuses on identifying, understanding, and analyzing the interactions and impacts among technology, society and the environment for current and emerging technologies using theoretical and evidence-based analyses. Connections among systems of systems engineering, impact analyses, evidence-based analyses, needs assessment, the design process, advocacy, and professional engineering will be discussed and applied.",
        "title": "Design, Systems, and Society"
    },
    {
        "code": "SYDE 262",
        "description": "Topics include microeconomics, supply, demand and external costs in the context of systems design. Sustainability indicators, entrepreneurship, engineering economics, comparison of alternatives, project schedules and developing a business plan.",
        "title": "Engineering Economics of Design"
    },
    {
        "code": "SYDE 263",
        "description": "This course addresses the practical aspects of design and technical communication. By using a series of workshops culminating in a comprehensive final project, students gain the hands-on experience necessary for prototyping and design validation. Topics include generating technical specifications, material selection, fastener basics, motor selection, electronic switching, reading data sheets and schematics, and advanced microcontroller implementation.",
        "title": "Engineering Prototyping"
    },
    {
        "code": "SYDE 283",
        "description": "Introduction to the fundamental laws of electricity, magnetism, and optics; electric fields, voltage, resistance, current, properties of conductors and semiconductors, capacitance, properties of dielectrics, magnetic fields, Faraday's Law and inductance, properties of magnetic materials; electromagnetic waves and the nature of light, geometrical optics; reflection and refraction, physical optics; interference and diffraction.",
        "title": "Physics 3: Electricity, Magnetism and Optics"
    },
    {
        "code": "SYDE 285",
        "description": "The course will present how the fundamentals of chemistry are applied to materials science and engineering. Concepts such as chemical bonding, crystal structure, phase diagram, redox reaction, and electrochemistry will be introduced in the context of materials science. Properties, processing and structure of metals, semiconductors, polymers, ceramic, nanomaterials and biomaterials will be presented.",
        "title": "Materials Chemistry"
    },
    {
        "code": "SYDE 286",
        "description": "Introduction to mechanical response of materials and stress-strain relationship. Behaviour of prismatic members in tension, compression, shear, bending and torsion. Shear-force and bending-moment diagrams. Introduction to instability.",
        "title": "Mechanics of Deformable Solids"
    },
    {
        "code": "SYDE 292",
        "description": "Active and passive circuit elements, Kirchhoff's laws, mesh and nodal circuit analysis, principle of superposition; step response of first and second order networks; sinusoidal steady state analysis using complex impedance phasors; input-output relationships, transfer functions and frequency response of linear systems; operational amplifiers, operational amplifier circuits using negative or positive feedback; diodes, operational amplifier circuits using diodes; analog signal detection, conditioning and conversion systems; transducers, difference and instrumentation amplifiers, active filters, A/D and D/A conversion.",
        "title": "Circuits, Instrumentation, and Measurements"
    },
    {
        "code": "SYDE 292L",
        "description": "Laboratory experiments for students taking SYDE292.",
        "title": "Circuits, Instrumentation, and Measurements Laboratory"
    },
    {
        "code": "SYDE 300",
        "description": "A work-term poster is composed and presented at the Work-term symposium. The poster and presentation provide an opportunity for students to effectively communicate and reflect on their engineering experience gained during their co-op work terms. In the poster and presentation, students draw connections between the theoretical aspects of engineering taught in the classroom and the practical applications of that theory in the workplace.",
        "title": "Work-Term Symposium Poster"
    },
    {
        "code": "SYDE 311",
        "description": "Series solutions of ordinary differential equations; Bessel functions, orthogonal functions, Fourier expansions and integral, Legendre polynomials, Sturm-Liouville systems. Partial differential equations; parabolic, hyperbolic and elliptic equations, numerical methods. Numerical integration; Gaussian quadrature, Runge-Kutta methods. Nonlinear systems; qualitative analysis, phase plane, Newton-Raphson method.",
        "title": "Advanced Engineering Math 2"
    },
    {
        "code": "SYDE 312",
        "description": "Vector spaces, linear independence, linear maps and matrix representations. Inner product spaces and orthogonality. Gramm-Schmidt algorithm and orthogonal projection. Interpolation and curve-fitting. Eigenvalues and eigenvectors, diagonalization, singular value decomposition. Applications and numerical methods.",
        "title": "Applied Linear Algebra"
    },
    {
        "code": "SYDE 322",
        "description": "Software requirements specification; software architecture; design patterns; software testing and quality assurance; software maintenance; design of efficient algorithms and methods for their analysis, mathematical algorithms, string processing algorithms, geometrical algorithms, exhaustive search and traversal techniques, introduction to lower bound theory and NP-completeness. Case studies and engineering examples.",
        "title": "Software Design"
    },
    {
        "code": "SYDE 334",
        "description": "Review of basic Normal theory, t, chi-squared, and F distributions. Simple linear regression. Lack of fit. Analysis of variance. Multiple linear regression, variable selection techniques, indicator variables, diagnostics. Brief introduction to non-linear regression, factorial experimentation.",
        "title": "Applied Statistics"
    },
    {
        "code": "SYDE 351",
        "description": "Introduction to systems modelling and analysis. Graph theoretic models and formulation of system equations. State space formulation and solution. Time and frequency domain solutions. Application to engineering systems.",
        "title": "Systems Models 1"
    },
    {
        "code": "SYDE 352",
        "description": "Classical and state space representations of control systems. Stability, controllability, observability and sensitivity. Routh-Hurwitz and root-locus methods. Frequency domain behaviour, Bode plots, Nyquist stability criteria. Pole placement, PID, phase-lead and phase-lag controllers.",
        "title": "Introduction to Control Systems"
    },
    {
        "code": "SYDE 352L",
        "description": "Laboratory experiments for students taking SYDE352.",
        "title": "Control Systems Laboratory"
    },
    {
        "code": "SYDE 361",
        "description": "The methodology of design, situation of concern; needs analysis and problem definition, engineering analysis and generation of alternative solutions, design prototyping, and design documentation. The lecture material is supplemented by a term-long design project done in small groups that develops hands-on experience with electromechanical prototyping.",
        "title": "Systems Design Methods 1: Needs Analysis and Prototyping"
    },
    {
        "code": "SYDE 362",
        "description": "Engineering design project course where students work in small groups applying the principles of engineering problem solving and design, with a focus on testing and design evaluation, and an introduction to benchmark testing and applied design optimization. Student projects will provide hands-on experience with design verification, validation, and performance measurement and analysis using engineering tools.",
        "title": "Systems Design Methods 2: Testing, Verification, and Validation"
    },
    {
        "code": "SYDE 381",
        "description": "An introductory course in engineering thermodynamics structured for students in systems design. Classical thermodynamics is presented as the systematic study of energy; its use, degradation, and waste. Introduction to heat transfer by conduction, convection, and radiation. Applications focus on problems of energy and environment. The concepts of statistical thermodynamics are introduced.",
        "title": "Thermodynamics"
    },
    {
        "code": "SYDE 383",
        "description": "Fundamental concepts in systems involving fluid flow. Basic treatment of statics, kinematics and dynamics of fluids. Conservation of mass, momentum and energy for a control volume. Dimensional analysis and similarity. Flow in pipes and channels. Brief introduction to boundary layers, lift and drag, ideal and compressible flow.",
        "title": "Fluid Mechanics"
    },
    {
        "code": "SYDE 411",
        "description": "Advanced methods for systems of linear equations. Root-finding methods. Linear programming, simplex and interior-point methods. Local and global optimization methods. Constrained optimization. Multiobjective and multidisciplinary design optimization.",
        "title": "Optimization and Numerical Methods"
    },
    {
        "code": "SYDE 499",
        "description": "A major undergraduate individual systems design engineering research project carried out as a technical elective (TE) under the supervision of a faculty member. Students are expected to demonstrate initiative and responsibility. An oral presentation of results and a written report are the minimum requirements. The faculty supervisor or department may set other requirements. Students will arrange for a faculty supervisor prior to registration.",
        "title": "Elective Systems Design Research Project"
    },
    {
        "code": "SYDE 522",
        "description": "The objective of this course is to introduce students to fundamental concepts of artificial intelligence. An overview of different learning schemes will be provided, including supervised and unsupervised algorithms. The focus of this course will be on dimensionality reduction, clustering, classification, deep and shallow artificial neural networks, and reinforcement learning. Ethical aspects of artificial intelligence will be discussed.",
        "title": "Foundations of Artificial Intelligence"
    },
    {
        "code": "SYDE 531",
        "description": "Optimization methods for real world problems have to deal with probabilistic uncertainty either due to data uncertainty or manufacturing uncertainty or both. Maximizing the expected value of the objective function subject to reliability (or risk) constraints is commonly used in such design or decision-making problems. Common methods used are stochastic programming, stochastic dynamic programming, chance-constraints, yield optimization and tolerance design. Example applications are selected from water management, energy systems, financial engineering, and manufacturing.",
        "title": "Design Optimization Under Probabilistic Uncertainty"
    },
    {
        "code": "SYDE 532",
        "description": "The overwhelming majority of societal, ecological and climate issues of pressing importance are complex systems; nonlinear dynamic interacting systems poorly characterized by linear analyses and Gaussian statistics. This course introduces the mathematics needed to understand such interactions, including nonlinear dynamics, critical and bifurcation behaviours, large-scale systems and power-law distributions. The mathematical methods will be motivated by extensive examples and case studies such as global warming, energy shortages, desertification, overpopulation, poverty, and economic instability, to be investigated from a systems engineering perspective that will connect mathematical concepts to real-world examples.",
        "title": "Introduction to Complex Systems"
    },
    {
        "code": "SYDE 533",
        "description": "Formal methods for studying engineering decision-making problems involving multiple participants and multiple objectives. Topics include the graph model for conflict resolution, normal game form, metagame analysis, games with misperceptions, preference elicitation, human behaviour under conflict, evolution of a conflict, decision-making under uncertainty, sensitivity analyses, multiple criteria decision analysis, group decision and negotiation, coalition analysis, decision support systems, and real-world applications of the foregoing concepts.",
        "title": "Conflict Resolution"
    },
    {
        "code": "SYDE 534",
        "description": "Traditional electric energy systems comprising generation, transmission, and distribution are examined. Emerging technologies and trends are considered, such as competition, smart grids, energy storage, demand side management, renewable energy, and P2P. Future challenges and possibilities are then explored. Issues will be explored from technical, economic, environmental, sustainability, and social perspectives.",
        "title": "Electric Energy Systems"
    },
    {
        "code": "SYDE 535",
        "description": "This course will introduce and apply the fundamentals of computational simulation for complex systems. Data collection and analysis, conceptual modelling, computational modelling, output analysis, and communication of results to non-expert audiences will be covered extensively. Students will develop computational simulations to explore potential solutions for complex societal problems, identifying emergent scenarios, costs, and benefits with the goal of informing decision-makers.",
        "title": "Computational Simulations for Societal and Environmental Systems"
    },
    {
        "code": "SYDE 536",
        "description": "Overview of frameworks used to model the global and community transportation systems followed by four case studies: Bayesian modelling of collision rates; discrete choice modelling of travel mode; operating mode-based time series modelling of tailpipe emissions, and simulation of traffic operations including congestion.",
        "title": "Modelling Transportation Systems"
    },
    {
        "code": "SYDE 537",
        "description": "Artificial life is the study of the simulation and synthesis of living or life-like systems. This course treats the basic principles of biology and computation in nature that underpin the organization of living systems in life as we know it, as it might exist elsewhere in the universe, and in digital or artificial media. We explore the mechanisms within living individuals that grow and change in a complex environment. This provides a variety of methods for understanding, modelling, and designing complex adaptive systems, whether naturally occurring or engineered, in simulation, in physical systems, with a view to applications in artificial life as the foundation for artificial intelligence and biological modelling.",
        "title": "Artificial Life: Biology and Computation"
    },
    {
        "code": "SYDE 542",
        "description": "This course focuses on the design of computer interfaces for simple to complex systems. Examples of applications are used to illustrate theoretical approaches. Main topics include forms of visual display; auditory display and soft controls; context, navigation, and layout; development techniques; design for engagement.",
        "title": "Interface Design"
    },
    {
        "code": "SYDE 543",
        "description": "This course focuses on the role engineering psychology research plays in design of the information displays and devices associated with simple and complex cognitive tasks. Main topics include signal detection and target location tasks, navigation tasks, training tasks, communication tasks, human error, stress and mental workload, supervisory control, and situational awareness.",
        "title": "Cognitive Ergonomics"
    },
    {
        "code": "SYDE 544",
        "description": "This course develops an understanding of biomedical measurements through the examination of electromyographic (EMG), electroencephalographic (EEG), and electrocardiographic (ECG) signals. Measurement of human-body position, force, and pressure, and related instrumentation will also be presented. Signal processing techniques will be discussed in the context of extraction and application of useful biomedical signals.",
        "title": "Biomedical Measurement and Signal Processing"
    },
    {
        "code": "SYDE 548",
        "description": "This course approaches the design of tasks, tools, products, and systems from a user-centered design perspective. Emphasis is on the human factors and usability methods, and techniques that can and should be applied throughout the iterative design process. While design issues pertaining to human-computer interaction are discussed, the methods presented can be applied to the design of almost any user interface. Major topics include user research methods for usability and user experience, inspection methods, user testing, applied statistical analysis.",
        "title": "User Centred Design Methods"
    },
    {
        "code": "SYDE 552",
        "description": "Introduction to modelling and analysis of neurophysiological systems. Models of synaptic plasticity and learning, with focus on the similarities and differences between neuroscience and deep learning.",
        "title": "Computational Neuroscience"
    },
    {
        "code": "SYDE 553",
        "description": "Newtonian and Eulerian formulation of particle and rigid body kinematics and dynamics. Energy (Lagrangian and Hamiltonian) formulations of particle and rigid body dynamics; generalized co-ordinates, generalized forces, holonomic constraints, Lagrange multipliers.",
        "title": "Advanced Dynamics"
    },
    {
        "code": "SYDE 554",
        "description": "This course introduces nonlinear systems with applications in realistic ecological, mechanical, electrical, and chemical engineering systems. The properties of those systems are investigated via analytical and numerical tools, with particular application to MEMS and NEMS actuators & sensors. Students will develop knowledge and appreciation of the following concepts and tools: differences between linear and nonlinear dynamic systems; autonomous and non-autonomous systems; existence and uniqueness of solutions; equilibrium points and limit cycles; phase plane analysis; nonlinear phenomena; Poincare section analysis; multi-frequency oscillations; notions of system stability (e.g., Lyapunov functions).",
        "title": "Nonlinear Dynamic Systems"
    },
    {
        "code": "SYDE 556",
        "description": "This course develops and applies a general framework for understanding neural computation in the context of recent advances in theoretical and experimental neuroscience. Particular emphasis is placed on understanding representation, nonlinear computation, and dynamics in real neurobiological systems. Students will apply signal processing, control theory, linear algebra, probability theory, and similar quantitative tools for the purpose of modelling sensory, motor, and cognitive systems. Topics covered include single neuron function, neural coding, neural dynamics, attractor networks, learning, statistical inference, locomotion, working memory, etc. Familiarity with neural systems is helpful but not essential.",
        "title": "Simulating Neurobiological Systems"
    },
    {
        "code": "SYDE 572",
        "description": "Pattern recognition as a process of data analysis. Pattern features as components in a random vector representation. Classification techniques; distance measures in feature space, probabilistic (Bayesian) decision theory, linear discriminants. Clustering and feature extraction. Applications; optical character recognition, speech recognition, industrial robot vision, medical diagnosis, remote sensing and satellite image analysis, fault detection and diagnosis in complex systems such as nuclear reactors.",
        "title": "Introduction to Pattern Recognition"
    },
    {
        "code": "SYDE 575",
        "description": "Beginning with a discussion of quantitative models of imaging systems, this course moves on to apply methods of linear systems theory and signal processing to image processing. Simple spatial domain techniques as well as spatial frequency domain methods, and digital filter design for image enhancement and restoration are discussed. The key methods and problems are surveyed; edge detection, image denoising, image segmentation, image enhancement, image compression, image registration, and feature detection. Applications to machine vision, remote sensing, and medical imaging will be emphasized.",
        "title": "Image Processing"
    },
    {
        "code": "SYDE 577",
        "description": "Introduction to deep learning. Regression and classification; backpropagation; convolutional and recurrent networks; optimization and regularization of deep networks; transformers; recent developments in the field.",
        "title": "Deep Learning"
    },
    {
        "code": "SYDE 584",
        "description": "In this course, students will become familiar with the physiology and anatomical structures of the human body. The structure, functions, and properties of major physiological systems (e.g., musculoskeletal, nervous, cardiovascular, and respiratory) will be presented in relation to modelling physiological systems and the design of biomedical devices (imaging, assistive, and diagnostic). Various aspects of pathology and how they influence measurements will also be introduced.",
        "title": "Physiological Systems and Biomedical Design"
    },
    {
        "code": "SYDE 586",
        "description": "Material selection based on material property and design requirements. Design a product and selected material against failure. Select a manufacturing process that meets design requirements and constraints. Incorporate economic analysis and environmental impact in the selection process. Assess life cycle of the product and the selected material. Case studies related to general engineering applications and biomedical applications.",
        "title": "Material Selection for Design"
    },
    {
        "code": "SYDE 599",
        "description": "This course deals with selected topics at the undergraduate level in environmental and societal systems, mechatronics and physical systems, or human factors and ergonomics.",
        "title": "Special Topics in Systems Design Engineering"
    }
]